{"title":"Thundergod: The Ascendance of Indra by Rajiv G Menon","uid":9238309,"size":1593506,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:00a2540d6303103974da41fbac18e56880f1a74e&amp;dn=Thundergod%3A+The+Ascendance+of+Indra+by+Rajiv+G+Menon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"floader01","files":3,"time":1385223026,"description":"ePUB, MOBI, PDF formats\n\nOne day a prince from one of the four great tribes will unite the sons of Aditi and he will sow the seeds of an empire that will rule the world. Born of a prophetic union between the Earth Goddess Gaia and Daeyus, chief of the Devas, comes the story of a child recounted by history to have become a king and retold by legend to have transcended into a god. Indra, destiny s orphan, finds himself growing up in a vortex of treachery and tribal incumbency. Shielded from the usurpers of his birthright only by the watchful eye of the warrior sage Mitra, he first sets out to conquer the hearts of his tribesmen, and then the kingdoms of the unmapped world. Aligning forces with his brothers by blood oath and divine intervention Agni, Vayu, Varuna and Soma Indra embarks on a military campaign of epic proportions, stretching from the Euphrates in Asia Minor to Harappa on the Indian subcontinent, encountering formidable armies, demonic beings and powerful goddesses, and losing the only woman he really loves. Will he get her to love him again? Will he avenge the death of his father? Will he assume his place in the pantheon of the gods? In a compelling saga, blended by history, spiced by legend and mutated by myth, Rajiv G. Menon transforms ten years of research into a lightning rod of an action adventure that streaks into your consciousness with the speed of Indra s thunderbolt.\n\nGenre: Fantasy Fiction/Hindu Mythology","torrent":{"xt":"urn:btih:00a2540d6303103974da41fbac18e56880f1a74e","amp;dn":"Thundergod%3A+The+Ascendance+of+Indra+by+Rajiv+G+Menon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00a2540d6303103974da41fbac18e56880f1a74e","infoHashBuffer":{"type":"Buffer","data":[0,162,84,13,99,3,16,57,116,218,65,251,172,24,229,104,128,241,167,78]},"announce":[],"urlList":[]}}