{"title":"Volkswagen 2006-2008 Jetta and Passat MFD2 v.8B Map Update DVD","uid":9363424,"size":6051827934,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:072eedda875b0409c5684e886fd9bb1932366a96&amp;dn=Volkswagen+2006-2008+Jetta+and+Passat+MFD2+v.8B+Map+Update+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"htarrant","files":-1,"time":1387372662,"description":"This new DVD map update contains coverage across the continental United States and Canada as well as Alaska, Hawaii and Puerto Rico. It contains over 6.1 million miles of updated roads and features over 1.87 million updated points of interest including: Restaurants: 484,516 ATMs: 126,084 Gasoline/Petrol Stations: 106,107 Hotels: 71,756\n\nCompatibility:\nCompatible with Originally Equipped Volkswagen navigation systems. NOT compatible with AFTER MARKET Navigation Systems\nJetta (2006 -2008)\nPassat (2006 -2008)\nNorth American VW MFD2 Navigation System\n\nInstructions:\nTested with ImgBurn\nBurn at slowest possible speed for everything\nBurn SW50_MFD2.iso and U-lockDVDMFD2.iso to separate CD's(DVD's should also work)\nInsert SW50_MFD2 Update CD into MFD2 DVD Drive(Navigation DVD Slot) and run update, may take nearly an hour, do not interrupt or turn off power\nInsert U-lockDVDMFD2 CD into MFD2 DVD Drive, it will appear to repeatedly load, let cycle a few times and remove\nMake sure your DVD burner is set to DVD-ROM under BookType\nSelect dvd2-VX_NAR_2013 v3.mds and burn to DL DVD(Most DL DVD's are incompatible, use Verbatim brand disks)\nInsert DVD into Navigation system and let run\n\nTroubleshooting:\nIf the Navigation drive says shows the disk as invalid: \nMake sure your DVD burner was set to DVD-ROM booktype(not all support this)\nMake sure your DVD burner actually burned it as a DVD-ROM\nMake sure update and unlock ran successfully-In menu got to Band-Settings-Syst. settings-Factory set.(hold until Service menu comes up)-System Info-Down Arrow(on right)-HW-HU(last 2 digits are Software Version which should be 50)\nMake sure your MFD2 is a North American variant\nTry a different DVD burner\nTry using different disks\nMake sure the .mds file was used when burning the Navigation DVD, burning the ISO without it will not work\nTry the older single layer Navigation DVD download with a regular single layer DVD thepiratebay.org/torrent/9363362/ if that works your dual layer disks are likely bad or your burner can't properly burn to dual layer disks, buy Verbatim brand disks, if the older disk doesn't work your booktype is likely wrong and you need to set it to DVD-ROM or get a new burner\n\nTested and Confirmed working with Samsung SE-208DB USB DVD Burner\nTested and Confirmed working with Verbatim DL DVD SKU:95310 other Verbatim SKU's may not work\n","torrent":{"xt":"urn:btih:072eedda875b0409c5684e886fd9bb1932366a96","amp;dn":"Volkswagen+2006-2008+Jetta+and+Passat+MFD2+v.8B+Map+Update+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"072eedda875b0409c5684e886fd9bb1932366a96","infoHashBuffer":{"type":"Buffer","data":[7,46,237,218,135,91,4,9,197,104,78,136,111,217,187,25,50,54,106,150]},"announce":[],"urlList":[]}}