{"title":"Batman Arkham Origins ALL DLC PACK v5 + Bruce Wayne DLC","uid":9306523,"size":144015,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:08b5a227b8dce4282ba1986a20d50ef57013a156&amp;dn=Batman+Arkham+Origins+ALL+DLC+PACK+v5+%2B+Bruce+Wayne+DLC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dududus","files":1,"time":1386322372,"description":"KNIGHTFALL BUNDLE PACK\n- 5 exclusive challenge maps: Azrael Does Not Protect, City On Fire, Venom Connection, Turning Point, No Rest For The Wicked\n- 2 skins: KnightFall Batman, Classic TV Series Batman\n\nDEATHSTROKE CHALLENGE PACK\n- Take control of Deathstroke - the world's deadliest assassin and guide him through Arkham Origin's challenge maps.\n- Two brand new Challenge maps: No Money Down and 100-to-1. Take on enemies armed with unique gadgets and special moves.\n- Access to Special Challenge Campaign.\n- 2 bonus skins: Judas Contract Deathstroke, Injustice Deathstroke, plus Classic Deathstroke Skin.\n\nBLACK MASK PACK\n- Awarded two more challenges: Lot Full, Hidden Facility\n\nINITIATION PACK\n- Travel back to the days before there was a Batman and take control of a young Bruce Wayne as he completes his martial arts training.\n- Experience exotic locales including a bamboo forest and mountain-top monastery.\n- New challenge campaign &quot;RITE TO PASSAGE&quot; with 5 new challenge maps: TOGAKURE-RYU, SHINOBI-IRI, TAIJUTSU, BORYAKU, SEISHINTEKI KYOYO.\n- 2 new skins: Bruce Wayne Skin and Vigilante Skin.\n\nNEW MILLENIUM SKINS PACK\n- Skins Unlocked: 1st Appearance Batman, Batman: Noel, New 52 Graphic Batman, Red Son Batman, Blackest Night Batman\n- One Year Later Robin Batman (online only)\n\nINFINITE EARTHS SKINS PACK\n- Skins Unlocked: Earth 2 Batman, Earth 2 Dark Knight, Dark Knight Of The Round Table, ThrillKiller Batman, Long Halloween Batman\n- Classic Tim Drake Robin Batman (online only)\n\nLEGENDS BATMAN SKINS PACK\n- Skins already included in other two big packs. This is just for reference. (We dont need this pack anymore)\n- 4 awesome Batman skins: Earth 2 Batman, ThrillKiller Batman, Long Halloween Batman, Dark Knight Of The Round Table.\n\nEXCLUSIVE SKINS PACK\n- 2 exclusive skins: Brightest Day Batman, Gotham By GasLight Batman\n- 4 additional skins: Injustice Batman, Batman The Dark Knight, Batman One Million, New 52 Metallic Batman\n\nONLINE SUPPLY DROP 1 &amp; 2 PACK\n- These packs will give you an advantage in Online no matter what team you're on.\n- Get 2 additional clothing items for Bane and Joker Characters with gameplay enhancing features.\n- All-new weapon: Sawn-Off Shotgun complete with additional weapon progression and skins.\n\nNote: All Skins are available from start for use in the challenge maps (except Robin costumes online only).","torrent":{"xt":"urn:btih:08b5a227b8dce4282ba1986a20d50ef57013a156","amp;dn":"Batman+Arkham+Origins+ALL+DLC+PACK+v5+%2B+Bruce+Wayne+DLC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08b5a227b8dce4282ba1986a20d50ef57013a156","infoHashBuffer":{"type":"Buffer","data":[8,181,162,39,184,220,228,40,43,161,152,106,32,213,14,245,112,19,161,86]},"announce":[],"urlList":[]}}