{"title":"Epson L800 Utility","uid":9406499,"size":1200094,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0ab956e40a8e1af93bfb3e6ac48422075cc98a00&amp;dn=Epson+L800+Utility&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"I.C.B.M.","files":1,"time":1388170096,"description":"Greetings,\nThis is my first time for uploading, i will do my best.\n\nPlease read a wile, it is important.\n\nFor those who have L 800 Epson printer, i am giving this utility.\nWhen we pay the printer NO ONE told us that we need to pay for waste ink pad reset.\n\nOK, i am skilled and i do not need the Epson technician to change the cotton pads, with a screw driver and a small quantity of brain, i can change the cotton, so...\n\nWhy i need to pay the Epson to unlock the printer that i have PAY!\nDID I SIGN ANY CONTRACT TO ENGAGE ME TO PAY ALL THE TIME THE PIMPING? EH????\n\nThere are many scums who try to charge your credit card to reset YOUR OWN PRINTER, ONE OF THOSE SCUMS ARE THOSE WHO MADE THE &quot;WICRESET&quot;, they giving you free their program and they asking you to by &quot;key&quot; for 10$ each time you change the cotton pads.\n\nI have search the web and i have found this tool, i want to share it and i will seed it for 5 years.\n\nI will not issue the Epson, i have record them in my nuts!\nAs for the wicreset team??\nOne day i will contact them personally, then we will talk about traditional Greek &quot;massage&quot;.\n\nNow download the tool and share it with the people, lets make the human's pain lesser.\n\nThank you.","torrent":{"xt":"urn:btih:0ab956e40a8e1af93bfb3e6ac48422075cc98a00","amp;dn":"Epson+L800+Utility","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ab956e40a8e1af93bfb3e6ac48422075cc98a00","infoHashBuffer":{"type":"Buffer","data":[10,185,86,228,10,142,26,249,59,251,62,106,196,132,34,7,92,201,138,0]},"announce":[],"urlList":[]}}