{"title":"Dot Complicated by Randi Zuckerberg","uid":9313421,"size":3340729,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0cf7800e6cd588685a5a9b647b896e6ac809ed1f&amp;dn=Dot+Complicated+by+Randi+Zuckerberg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"420weedman","files":6,"time":1386437079,"description":"From Randi Zuckerberg, social media and technology expert and former marketing executive at Facebook, comes a welcome, essential guide to understanding social media and technology, and how they influence and inform our lives online and off. Technology and social media have changed, enhanced, and complicated every facet of our lives - from how we interact with our friends to how we elect presidents, from how we manage our careers to how we support important causes, from how we find love to how we raise our children. The technology revolution is not going away. We can't hide from it or pretend that it's not changing our lives in a thousand different ways. So how do we deal with it? In Dot Complicated, Randi Zuckerberg shows us how. Through first hand accounts of her time at Facebook and beyond, where Zuckerberg witnessed this remarkable shift, she details the opportunities and obstacles, problems and solutions, presented by this new online reality. In the process, she establishes rules to bring some much-needed order and clarity to our connected, complicated, and constantly changing lives online. Invaluable, timely, and engaging, Dot Complicated reveals how to make it through your life online in one piece - from the etiquette of unfriending and the power of crowdsourcing to the perils of photo tags and the importance of teaching your kids how to be tech-savvy. ","torrent":{"xt":"urn:btih:0cf7800e6cd588685a5a9b647b896e6ac809ed1f","amp;dn":"Dot+Complicated+by+Randi+Zuckerberg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cf7800e6cd588685a5a9b647b896e6ac809ed1f","infoHashBuffer":{"type":"Buffer","data":[12,247,128,14,108,213,136,104,90,90,155,100,123,137,110,106,200,9,237,31]},"announce":[],"urlList":[]}}