{"title":"Pixeljunk Shooter v1.0.0 (Native)","uid":9370266,"size":272995262,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:1070fee0a53de79fe169f27fd5beb1c7791ed7ae&amp;dn=Pixeljunk+Shooter+v1.0.0+%28Native%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pazazz","files":-1,"time":1387509487,"description":"Torrent has been tested on osx 10.9 and works perfect.  Just wanna note my conection is crap so first few of you to DL this please seed for a bit atleast untill this torrent get established....thanks, enjoy.\n\nSummary: In PixelJunk Shooter, players pilot a subterranean vehicle to explore the interior of diverse cave-like complexes. The player must affect the surrounding and dynamic terrain to progress. The goal is to safely navigate through each vivid stage and rescue survivors scattered about the cavernous environment. Each stage is in-effect a flow simulation whereby the player attempts to control various types of liquid (water, magma, etc) and solid matter (rock, earth) either by destroying it, manipulating it or moving it. These dynamic fluid effects are at the heart of the games visuals. Strategy is paramount in PixelJunk Shooter. The piloted craft is susceptible to extremes of heat, so the player must be careful about the craft's proximity to magma. If the craft becomes too hot, the player can regain a comfortable temperature by plunging into the nearest water source. Additionally, each stage presents a puzzle scenario for the player to solve in order to safely rescue as many survivors as possible. Both environmental elements and enemies, including Bosses, will attempt to hamper the player's progress. ","torrent":{"xt":"urn:btih:1070fee0a53de79fe169f27fd5beb1c7791ed7ae","amp;dn":"Pixeljunk+Shooter+v1.0.0+%28Native%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1070fee0a53de79fe169f27fd5beb1c7791ed7ae","infoHashBuffer":{"type":"Buffer","data":[16,112,254,224,165,61,231,159,225,105,242,127,213,190,177,199,121,30,215,174]},"announce":[],"urlList":[]}}