{"title":"[PS3] Folklore","uid":9296601,"size":8401077401,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:11d2aa8c8ccbba879f4bca1ec99ad7698ae900f6&amp;dn=%5BPS3%5D+Folklore&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"fuckface69","files":-1,"time":1386168595,"description":"Travel through a mysterious gateway to the Netherworld.\n\nThe vision of legendary game creator Yoshiki Okamoto (executive producer for Onimushaâ„¢, Devil May Cryâ„¢ and Resident Evilâ„¢), Folklore is a brand new action adventure title for PS3.\n\nA letter from a dead mother, a mysterious phone call and a forgotten childhood lead Ellen, a young woman, and Keats, a journalist working for a paranormal magazine, to Doolin - a sleepy Irish village that hides a gateway to the Netherworld and the answers to a 17-year-old mystery.\n\nYou play as either of the lead characters as you venture into a series of seven outlandish realms, each packed with nightmarish creatures. Your goal is to speak with the dead, whose memories hold the key to unravelling the past.\n\nThe key to progressing in the game is to capture the various Folks - the nightmarish creatures that inhabit the Netherworld - harnessing and combining their powers to defeat strong enemies.\n\n* Play as either Ellen or Keats, each with their own play styles and individual storylines.\n* Over 100 unique creatures - the Folks - each with unique powers and abilities to capture and create your own combat strategy.\n* Capture enemies using the unique functionality of the SIXAXIS Wireless Controller - latch onto creatures and reel them in by flicking the Wireless Controller at the right moment.","torrent":{"xt":"urn:btih:11d2aa8c8ccbba879f4bca1ec99ad7698ae900f6","amp;dn":"%5BPS3%5D+Folklore","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11d2aa8c8ccbba879f4bca1ec99ad7698ae900f6","infoHashBuffer":{"type":"Buffer","data":[17,210,170,140,140,203,186,135,159,75,202,30,201,154,215,105,138,233,0,246]},"announce":[],"urlList":[]}}