{"title":"Megan Reilly - Let Your Ghost Go [2006][EAC/FLAC]","uid":10235720,"size":257040484,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:15c41f62d8f46d5addc74f020523a8e875e49ec5&amp;dn=Megan+Reilly+-+Let+Your+Ghost+Go+%5B2006%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":14,"time":1401175084,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Carrot Top #SAKI 038CD\nCountry: USA\nYear: March 21, 2006\nGenre: Americana,Country\nFormat: CD,Album\n\n\n01. On a Plane (4:46)\n02. Nighttime (4:01)\n03. Boy as a Bird (5:02)\n04. Tropic of Cancer (4:13)\n05. Little Girl in Bloom (4:38)\n06. Let Your Ghost Go (3:07)\n07. Blackhearted (3:52)\n08. Wedding Song (4:22)\n09. Ringing a Bell (3:53)\n10. The Husband (4:12)\n\n\n\nEven though Megan Reilly's second album, Let Your Ghost Go, was recorded in New York City, it's clear that the singer is much more connected and inspired by her Memphis roots than by what her new northern home has to offer her. Strummed acoustic chords and slide guitars dominate the record and act as the perfect backdrop to Reilly's airy, sometimes quavering voice. But that shakiness is just a technique she uses when she wants to accent the emotion of the music, like in the title cut, a kind of love song, in which Reilly sports a vibrato that would make Dolly Parton proud. Though she generally chooses to exercise her soft, gentle Tennessee twang in most of the tracks, when she wants to -- or needs to -- Reilly can project strength as well as any of her louder contemporaries. In the most rock-oriented piece on the record, &quot;Tropic of Cancer,&quot; her voice has a subtle force that propels the song more than the bass-heavy drums do, and as she sings &quot;Well, I said yeah, a good man is hard to find,&quot; quoting a line from author Flannery O'Connor, there's a sense of forlornness, despair, and wisdom that's almost chilling. That feeling of dark melancholy pervades the entire album, even during the more cheerful songs, as if Reilly is not convinced that happiness could actually exist, or at least she's hesitant to admit it. The music reflects this sentiment, with a talented band whose skill and delicacy show in the soft layering of guitars and piano chords, the gentle click of the hi-hat, and the low melodic roll of the bass. It's an atmospheric record, but it's also direct and the songs can and deserve to be listened to individually. The two covers she includes, Bob Dylan's &quot;Wedding Song&quot; and a fantastic version of Thin Lizzy's &quot;Little Girl in Bloom,&quot; both sound good, and she changes them enough to make them her own without mutilating them, so they work well with the rest of the album. Let Your Ghost Go is short, just ten tracks, but it's lovely, with just the right mix of country and rock. And when added to Megan Reilly's provocative voice, it should be appealing to fans of either genre.","torrent":{"xt":"urn:btih:15c41f62d8f46d5addc74f020523a8e875e49ec5","amp;dn":"Megan+Reilly+-+Let+Your+Ghost+Go+%5B2006%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15c41f62d8f46d5addc74f020523a8e875e49ec5","infoHashBuffer":{"type":"Buffer","data":[21,196,31,98,216,244,109,90,221,199,79,2,5,35,168,232,117,228,158,197]},"announce":[],"urlList":[]}}