{"title":"VA - Original Soul Christmas (Atlantic 1968)","uid":9366500,"size":100712758,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1aa1ce3ca30e6eddea254d01a258244da0367738&amp;dn=VA+-+Original+Soul+Christmas+%28Atlantic+1968%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"23skido","files":17,"time":1387428577,"description":"&quot;Originally issued as an Atlantic compilation back in 1968, Soul Christmas is just what is says: a collection of songs featuring R&amp;B legends such as Otis Redding, Carla Thomas, Solomon Burke, Joe Tex, Clarence Carter, William Bell, King Curtis, and Booker T. &amp; the MG's. But if you're looking for a compilation of mostly traditional Christmas tunes, this is not the record to buy. Apart from nods to time-honored classics like &quot;White Christmas&quot; (gloriously reinterpreted by Redding), Booker T.'s perky &quot;Jingle Bells,&quot; and the R&amp;B favorite &quot;What Are You Doing New Year's Eve&quot; (featuring sax man King Curtis at his bluesy best, along with a guitar solo by Duane Allman), the songs are all tailor-made originals that fit the style of the respective artists. Thus, Carter's &quot;Back Door Santa&quot; is a hilariously salacious cut; Tex gives us a preacherlike &quot;I'll Make Everyday Christmas (For My Woman)&quot;; and Thomas is at her most cute and innocent with &quot;Gee Whiz, It's Christmas.&quot; Redding's version of &quot;Merry Christmas Baby&quot; (a hit for Johnny Moore's Three Blazers) is an obvious standout, while Bell's &quot;Everyday Will Be Like a Holiday&quot; is the only bona fide charted single (albeit back in January 1968). For added value, Rhino has included three bonus tracks, including a 1978 recording by Ray Charles of &quot;Christmas Time.&quot;&quot;\n\n--David Nathan","torrent":{"xt":"urn:btih:1aa1ce3ca30e6eddea254d01a258244da0367738","amp;dn":"VA+-+Original+Soul+Christmas+%28Atlantic+1968%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1aa1ce3ca30e6eddea254d01a258244da0367738","infoHashBuffer":{"type":"Buffer","data":[26,161,206,60,163,14,110,221,234,37,77,1,162,88,36,77,160,54,119,56]},"announce":[],"urlList":[]}}