{"title":"If Tomorrow Never Comes by Emjai Colbert","uid":9343102,"size":368314,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1aa297a2ddfd233a900672fafce712e2f8f67959&amp;dn=If+Tomorrow+Never+Comes+by+Emjai+Colbert&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"420weedman","files":4,"time":1386971758,"description":"After high school, Tara Jenkins followed her dreams to New York where she became a plus-size catalog model. Ten years later, she longs for the college education she passed up. When her mother becomes ill, Tara chucks her career and returns to her hometown. She buys a rundown house and begins the process of restoring the house and her life. Then in walks trouble. Brent Chambliss is a contractor. He's thrown himself into his work to forget about his wife Kelly and daughter Betsy, whom he lost three years ago. When he finds out Tara wants to remodel the grand old house he jumps at the chance to resurrect it, knowing he'll be spending his free time with his neighbor Tara, to whom he is attracted. He just needs to forget about vowing to love and honor his wife until he dies. Kelly Chambliss has plans of her own. Cursed to spend eternity in the house next door, she can only watch Brent from a distance. Kelly is delighted when he again enters her life. If only she can convince Tara to help her right the wrongs she did in life.","torrent":{"xt":"urn:btih:1aa297a2ddfd233a900672fafce712e2f8f67959","amp;dn":"If+Tomorrow+Never+Comes+by+Emjai+Colbert","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1aa297a2ddfd233a900672fafce712e2f8f67959","infoHashBuffer":{"type":"Buffer","data":[26,162,151,162,221,253,35,58,144,6,114,250,252,231,18,226,248,246,121,89]},"announce":[],"urlList":[]}}