{"title":"Hot Wet And Sexy - BTS - Ebony and Interracial Porn XXX","uid":9422676,"size":727749313,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:1d704cc3fbd29e8ddbb46f8639d1f98c15f660d6&amp;dn=Hot+Wet+And+Sexy+-+BTS+-+Ebony+and+Interracial+Porn+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"KidAtomic","files":-1,"time":1388618607,"description":"\nHot Wet And Sexy - Behind The Scenes (32 minutes)\n\nHot and wet = sexy! Now, there's an equation that everyone can agree about! Starring Helen, Capri Styles, Vanessa Cruz, Katie Cummings, Toni Sweets and more.\n\nLength 3 hrs. 1 mins.\nRating XXX\nReleased Jan 29 2009\nProduction Year 2008\nStudio  Justin Slayer International\n\n    Scene 1. Kapri Styles, guy\n    Scene 2. Hellen Cielo, guy\n    Scene 3. Vanessa Cruz, guy\n    Scene 4. Toni Sweets, guy\n    Scene 5. Katie Cummings, guy\n\nActresses:\n    Hellen Cielo (as Helen) [Facial]\n    Kapri Styles [Facial]\n    Katie Cummings [IR]\n    Toni Sweets\n    Vanessa Cruz\n\nActors:\n    Justin Slayer\n\nThe Hot Wet &amp; Sexy is a hell of a flick. The title pretty much describes the whole thing. The standouts are Kapri Styles(yo ain't never seen ass like this on such a small woman), and Katie Cummings who both turn in stellar performances. Not to waste time here are the facts:\n\nKapri Styles--She does a walking tease showing off what has to be the biggest ass on a little frame in history. You will not believe it!!!!!! She does a nice ass shake tease as well. She gets her coochie eaten, b4 giving up a hot bj. She gets a mild face fucking which I pretty much skipped over. The sex starts in mish, and side mish. It picks up in doggy but becomes volcanic when she does a sidesaddle squatting cowgirl!!!!!!!! OFF THE FUCKING HOOK!!!!!!!!!!!!!! Regular cowgirl follows. She shows her flexibility by locking her legs behind her head for a mish pounding. They move into regular mish b4 the pop. Hot way to open.\n\nHellen--She does a nice tease showing off her nice ass. She then gives up a nice bj. They get straight into doggy, b4 moving into mish. Side mish follows as well as flat doggy, legs pinned back mish, cowgirl, reverse cowgirl, doggy and back into mish for the pop. Damn 2 for 2!!!\n\nVanessa Cruz--Another nice lil slim thing with a hot ass. She does a nice tease before giving up a hot bj. She climbs on in reverse cowgirl, mish, and a scorching cowgirl ride that left me speechless. They move into doggy, mish, side mish and then the pop. General Moe is doing a hell of a job!!!\n\nToni Sweets--This little chocolate number has been burning it up since she stepped on the scene. One look at that ass and you'll see why. She does an extended tease b4 getting into a hot blow job. She climbs on in cowgirl and the screen melts!!!!!!!! Ass all over the place. They move into doggy, and a hot standing doggy. Side mish follows as well as flat doggy and then the pop. I don't really care for Nat Turner as a performer(really paint by numbers you ask me) but Toni was worth watching.\n\nDisc 2\n-------\nKatie Cummings--Last scene of the film lasts a shocking 54 minutes!!!!!!!!!!! Katie Cummings is worth every minute though. She does a really long(maybe a lil too long) and hot tease. She gives up a smoking bj. A really hot standing doggy follows. Her ass residence must be Jiggle St.!!!!! They do a regular doggy, reverse cowgirl, cowgirl, mish, reverse spoon, and the pop. Hell of a way to end things!!!!!!!!!!\n\n","torrent":{"xt":"urn:btih:1d704cc3fbd29e8ddbb46f8639d1f98c15f660d6","amp;dn":"Hot+Wet+And+Sexy+-+BTS+-+Ebony+and+Interracial+Porn+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d704cc3fbd29e8ddbb46f8639d1f98c15f660d6","infoHashBuffer":{"type":"Buffer","data":[29,112,76,195,251,210,158,141,219,180,111,134,57,209,249,140,21,246,96,214]},"announce":[],"urlList":[]}}