{"title":"Anal Starlets 2 (NEW 2013 Evil Angel) [DVDRip]","uid":9271494,"size":2793698096,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:21dd11392475d037e833060ea6dfcf93661a7672&amp;dn=Anal+Starlets+2+%28NEW+2013+Evil+Angel%29+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":"chkm8te","files":1,"time":1385787089,"description":"Anal Starlets 2 (NEW 2013 Evil Angel) [DVDRip]\n\nAdriana Chechik, Bailey Blue, Hope Howell, Juelz Ventura, Mike Adriano\n\nIf a hot girl wants to enter the smut business through the back door, theres no better place to start than on the eternally busy casting couch of ass-crazed director Mike Adriano. He offers aspiring performers a guiding hand and a hard cock, helping mold their butt banging careers with his patented, intimate POV-style booty perversions. In Mikes Anal Starlets #2, four stunning, young sodomites get the chance to refine their rectal skills through his patented asshole-stretching techniques. First is sexy Juelz Ventura wearing a shiny gold dress and matching stiletto heels that show off her shapely legs. She gags wetly on the directors dick. Rudely reamed until her battered butthole gapes and prolapses, Juelz receives a shower of hot cum. Next is petite, black-haired beauty Adriana Chechik. She slurps Mikes balls and swallows his throbbing boner in a drooling blow job. He relentlessly drills her sweet behind; Adriana sucks dick ass-to-mouth and opens wide for a tasty cum shot. All-natural blonde brat Bailey Blue unveils her small, perfect tits. After a nasty face fuck, the petite slut takes a butthole-stretching speculum and a hard anal dicking. Lastly, fresh-faced Hope Howell enjoys Mikes oral and anal hospitality. She gags and gurgles as he invades her throat, and Hope gets anally rammed while buzzing her clit with a vibrator. She obediently rims Mikes bunghole until he fills her mouth with creamy jism. Working their way up the show-biz ladder, the hardworking girls of Anal Starlets #2 will see their asses in lights.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=aj0sq8y2gm3paioh2dxu.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=aj0sq8y2gm3paioh2dxu.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=0xsw68swjwy31cl1rlv2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=0xsw68swjwy31cl1rlv2.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:21dd11392475d037e833060ea6dfcf93661a7672","amp;dn":"Anal+Starlets+2+%28NEW+2013+Evil+Angel%29+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21dd11392475d037e833060ea6dfcf93661a7672","infoHashBuffer":{"type":"Buffer","data":[33,221,17,57,36,117,208,55,232,51,6,14,166,223,207,147,102,26,118,114]},"announce":[],"urlList":[]}}