{"title":"Cast - All Change [1995]","uid":9364641,"size":347460087,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2388b8d597a3ba9d1a9b067483eb690839b54952&amp;dn=Cast+-+All+Change+%5B1995%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GenXRock","files":-1,"time":1387388946,"description":"Cast's All Change serves as the perfect antidote to the inner rage fueling much American alternative rock -- it would be hard to imagine a more gloriously upbeat backbeat of a guitar pop record, one that appeals to the eternal adolescent in each of us. The group's pedigree derives from good stock, founder John Power having served time with another fine Mersey combo the La's. But Cast transcends the hackneyed expectations of its environment, structure, and genetics through sheer, relentless quality of songcraft and performance. No sooner has one wide-eyed, hook-infested injection stormed the synapses demanding total capitulation than another of equal potency lines up to take its place. Cast vocals recall Small Faces-era Steve Marriott fused, in places, to Suede's Brett Anderson. There's a soft-psych feel to several tracks (try &quot;Sandstorm&quot;) that calls to mind &quot;Pictures of Matchstick Men&quot;-era Status Quo; Cast has clearly assimilated several volumes of Bam Caruso's Rubble and A.I.P.'s Electric Sugarcube Flashbacks series, without sacrificing its power-Mod backbone. Production is brittle and uncluttered. On the lyrics front, all is positively cheery, anthemic stuff about truth, honor, living well, having fun and getting the girl, delivered exuberantly enough to strip away several coats of accumulated cynicism and almost make you believe it's possible. Two favorites are the shifting falsetto angst anthem &quot;Tell It Like Is&quot; and the ballad &quot;Walk Away&quot; -- a clue to how Mott the Hoople's &quot;Roll Away the Stone&quot; would have come out recorded in 1967. (4/5)","torrent":{"xt":"urn:btih:2388b8d597a3ba9d1a9b067483eb690839b54952","amp;dn":"Cast+-+All+Change+%5B1995%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2388b8d597a3ba9d1a9b067483eb690839b54952","infoHashBuffer":{"type":"Buffer","data":[35,136,184,213,151,163,186,157,26,155,6,116,131,235,105,8,57,181,73,82]},"announce":[],"urlList":[]}}