{"title":"Blood Oranges - The Crying Tree [1994][EAC/FLAC]","uid":10235246,"size":305330201,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:23985a121a3cfcf3f79a6db60bea583eb0635619&amp;dn=Blood+Oranges+-+The+Crying+Tree+%5B1994%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":17,"time":1401167515,"description":"1\t Halfway 'Round The World\t\n2\t Miss It All\t\n3\t Hell's Half Acre\t\n4\t Bridges\t\n5\t Crying Tree\t\n6\t Sally\t\n7\t Shadow Of You\t\n8\t Handle Breaks\t\n9\t This Old Town\t\n10\t On The Run\t\n11\t Titanic\t\n12\t Hinges\t\n13\t Shine\n\n\nBefore there was alt-country there were the Blood Oranges. Their three releases fell squarely in a genre that didn't even have a name yet; indeed, had it formed, they'd have been one of the leading names. Not only did they have a superb guitar player in Mark Spencer (check his jaw-droppingly good break on &quot;Hell's Half Acre&quot; if you need proof; they can't play that fast and cleanly outside of Nashville, can they?), but they had a wonderfully emotional writer and singer in Cheri Knight and Jimmy Ryan's mandolin, composing, and singing provided much of the country flavor. And with The Crying Tree they perhaps reached their zenith, firing on all cylinders with the slow crunch of the title track, the quiet desperation of &quot;Shadow of You,&quot; and the loneliness of &quot;This Old Town,&quot; which segues into the breakneck, guitar-driven &quot;On the Run,&quot; with its breathless vocal and utterly wild guitar. They were never afraid to mix a bit of noise with their melody, with Spencer's solo edging out past the stratosphere in true guitar-hero fashion. Everything's helped by Eric Ambel's production, capturing lovely, raw harmonies and giving the band real musical freedom, as on &quot;Hinges,&quot; which almost sounds like a Richard Thompson song gone below the Mason-Dixon line (ironic, given the fact the band was based in the Northeast). They had it all going and brought it all together in perfect fashion here. It's just a shame they were ahead of their time.","torrent":{"xt":"urn:btih:23985a121a3cfcf3f79a6db60bea583eb0635619","amp;dn":"Blood+Oranges+-+The+Crying+Tree+%5B1994%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23985a121a3cfcf3f79a6db60bea583eb0635619","infoHashBuffer":{"type":"Buffer","data":[35,152,90,18,26,60,252,243,247,154,109,182,11,234,88,62,176,99,86,25]},"announce":[],"urlList":[]}}