{"title":"POtHS - End Times - 60 - Upcoming Age of Transitions","uid":9407480,"size":14151055608,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:255eb1dc047fefdb42752262dddb915622abda35&amp;dn=POtHS+-+End+Times+-+60+-+Upcoming+Age+of+Transitions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"POtHS11","files":92,"time":1388196266,"description":" POtHS - E V I L - U T I O N - School Your Professor on The Facts\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8865248/POtHS_-_E_V_I_L_-_U_T_I_O_N_-_School_Your_Professor_on_The_Facts&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8865248/POtHS_-_E_V_I_L_-_U_T_I_O_N_-_School_Your_Professor_on_The_Facts&lt;/a&gt;\n\nreligious-christian-icons-337.gif\n\n\n\n\n PO t HS\n\nPouring Out the Holy Spirit\n\nPOtHS - End Times - 60 - Upcoming Age of Transitions\n\n\n\nPOtHS Comment: False Flag Attacks have been going on for thousands of years. Why would Government Quit them now??? They wouldn'd.\n \n\nINTRODUCTION\n\nThe Age of Transitions - TransDehumanism 2013-2020 - NWO Agenda Defined:\nThe Age of Transitions is a documentary about converging technology, transhumanism, artificial intelligence, life extension, brain implants, social science, propaganda, nanotechnology, eugenics, geopolitics, world revolution, and more.\n\nTranshumanism is man living with machine via implants, in part or complete embodiment. This is what scipture refers to in Tribulation/Wrath when those who receive them fall victim to God's warnings and suffer tremendously - wishing they could Die, but cannot die. Becuase the transhuman genetic implants prevent their death. Those same implants which are to prevent disease, cancer, and prolong life. Do not accept the Mark of the beast and do not accept these implants promoted as beneficial to our well-being. Both will only lead to suffering and eternal death.\n\nFeaturing: Bill Clinton, George W Bush, Newt Gingrich, Nick Bostrom, Aubrey de Grey, Ray Kurzweil, Anders Sandberg, Michio Kaku, Hugo de Garis, Kevin Warwick, Marvin Minsky, Charles Galton Darwin, Julian Huxley, Aldous Huxley, William Shatner, Alex Jones, Jordan Maxwell, Cathy O'Brien, Alan Watt\n\nAaron Franz - The Philosophical Roots of Transhumanism\n\nAaron Franz is an author, filmmaker, and researcher whose work covers various subjects including: technological singularity, transhumanism, public relations, propaganda, occult symbolism, esoteric religion, eugenics, geopolitics and mind control. In this program, Aaron talks about his new book,&quot;Revolve.&quot; Is technology speeding up human evolution or are we just spinning our wheels? Artificial intelligence, nanotechnology, implantable chips, and life extension and many other technologies are being promoted as the way for humanity to become something radically different. The transhumanist movement claims that by applying them to our biology, we will become posthuman. A new religion for a new age is being born, and it centers around man's scientific attainment of eternal life. Topics Discussed: Revolve, revolution, AI, TV-series, transhumanism, privacy, the mind of god, the new man, the new system, technology, manifesting yourself, dissolution, free will, manipulation of perception, eugenics movement, philosophies, telepathy, artificial revolution, people devoid of spirituality and human evolution\n\nA quick list of topics that The Age of Transitions covers:\n\nMillennial expectations\nNano, Bio, Info, and Cognitive techologies, or &quot;NBIC&quot; read the report from the NSF/DOC meeting:\nTranshumanism\nTechnological Singularity\nEugenics\nSocial control through knowledge of social science\nUK MOD Strat Trends report:\nMind Control aka Behavior Modification Programs\n-----------------------------------------------------------------------------------------------------------------\n\nChuck Missler - TransHumanism - Part Man &amp; Part Machine - This is 666 Evolution:\nHow to live forever with Satan through the 666 World System. TransHumanism. They want to put your memory into a machine then put it back into a cloned person of yourself, so you can live on forever WITHOUT Jesus. Woe to those.\n\nTranshumanism is man living with machine via implants, in part or complete embodiment. This is what scipture refers to in Tribulation/Wrath when those who receive them fall victim to God's warnings and suffer tremendously - wishing they could Die, but cannot die. Becuase the transhuman genetic implants prevent their death. Those same implants which are to prevent disease, cancer, and prolong life. Do not accept the Mark of the beast and do not accept these implants promoted as beneficial to our well-being. Both will only lead to suffering and eternal death.\n-----------------------------------------------------------------------------------------------------------------\n\n'Monsanto wants total control, covers up grave GMO dangers':\nResearcher exposes Monsanto's GMO problem.  Supermarkets are flooded with GMO products, but how safe is it to eat them? Tasty and beautiful, they are produced with intervention unprecedented in history. Gene manipulation: how appropriate is it? Does it contribute to solving the food crisis on the planet? Or will humanity have to pay a costly price for meddling with what is not theirs. We talk to Jeffrey M. Smith, GMO researcher from the Institute for Responsible Technology.  A large number of case studies show that MD's who prescribe non-GMO products to patients' diets have documented a tremendous decrease in various diseases, cancers and etc.!  (That alone should be cause of concern.)\n\nMonsanto GMO uses the new and improved FAKE SCIENCE to intentionally mislead the public and achieve their goal of global dominance and servitude. Simply utilizing proven concepts in the deceptive tactics of corporate scientific authorship learned from the Drug and Tabacco (Cigarette) Companies of the past, Monsanto increases agricultural dependence and public indocrintation. Money buys Congress and the Court Legislative System to help impose and sustain their monopoly - just as Cigarette Companies did from the 40's, 50's, 60's, 70's and 80's. While other nations, like in the UK, have banned all GMO products, the United States remains obedient and submissive to the Corporate Giant and helps censor the devasting consequences of using GMO products form public awareness.\n\nHowever unlike cigarettes, GMO poisoning is genetically passed onto the genes of our children; this is where the real problem arises. Not one of simply poisoning those in the present, but all future generations which inherit and compound the GMO mutations from their parents as they grow and will more likely cause irreversible damage in the form of much greater increase in cancers, diseases, and deformities. Nowadays after decades of overt deception, Tobacco is widely known among the public to cause cancer and other problems. How long is it going to take the public to wise up to the Monsanto GMO problem and at what cost to them and their loved ones?  The choice is yours, not one for just yourself, but all future generations!  So choose wisely and stand up against the GMO problem!!\n-----------------------------------------------------------------------------------------------------------------\n\nAncient Bible Codes, DNA and Bio Spiritual Warfare:\n(4-HOURS) Join Dr. Leonard Horowitz as he explores more than 3000 years of religious and political persecution by a secret cabal that has waged ceaseless wars, famines, plagues and propaganda campaigns against Earth's people. Includes the details about ancient musical and mathematical codes linked to creation, destruction, and miracles, including the repair frequency of DNA the genetic blueprint of life. Ancient knowledge and modern science collide in this amazing program presented back in 1999 that links modern conspiracy theories to ancient Bible Codes and their relation to End-Times events.\n\nNOW ON DVD - HEALING CODES FOR THE BIOLOGICAL APOCALYPSE - 4-HOUR 2-DVD SPECIAL EDITION, Cat# K476.  UFOTVÂ®, accept no imitations.  \nGo to http://www.UFOTV.com.\n------------------------------------------------------------------------------------------------------------------\n\nThe Vatican &amp; Aliens 2013:\n&quot;... that this holy order could be part of one of the biggest cover-ups in UFO history. . . .the church is getting ready to embrace outside of planet earth as part of creation. According to UFO theorists, the Vatican has possessed knowledge of alien life, for centuries . . . &quot;\n\nApril 8th (2005) at 6:03 AM hours before John Paul's funeral, an unidentified flying object is filmed by a security camera observing St Peter's Basilica. Could this mysterious object be evidence of a connection between the Vatican and alien life? A connection that theorists and historians believe has existed since the creation of the {RCC} church.\n\nGiordanao Bruno . . . suggesting that science dictates life on other planets. . . . in 1600, Bruno was found guilty of heresy and burned at the stake. . . . the first person in history executed by the [RCC] for belief in Extraterrestrials . . . . . . was Bruno sacrificed to cover up a secret the church has allegedly hidden for the past 1500 years?\n\nSecrets, secrets, and more secrets... prepare for the Vatican's future public release stating alien life is real and then prepare &quot;to be assimulated.&quot; All part of the &quot;new age&quot; agenda for the end-times. Coming soon to a theater near you!  Are you ready?  &quot;God forgives, Jesus saves!&quot;\n-----------------------------------------------------------------------------------------------------------------\n\nTrans-Humanism - The Genetic Modification of all Life... Nano-Technology, HAARP, and Geoengineering:\nGenetic Modification of all Life!!!  New Documentary Film...  Enslavement of the human race.  This is part of the Endgame but not all . . .MUST WATCH\nThe State of our World\n\n'Trans Formation' By Max Igan\nWhile this film exposes the current global agenda, it inadequately foresees the result which is to lead mankind into the &quot;End Times&quot;!  Christians need to remain focused when viewing these things. We should always view our world in the christian perspective to understand how it relates to scripture and end-times prophecy.\n------------------------------------------------------------------------------------------------------------------\n\nSigns - Part 38:\nA compilation of various short clips presenting recent apocalyptic signs occurring around the world today and help us identify the state of affairs ushering the end of days.  View what's been happening in our time and descern for yourself the onset of Revelations and what may lay ahead.  \n------------------------------------------------------------------------------------------------------------------\n\nProphecy Signs July 10_ 2013\n\n\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe The Above Statement and that the Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed...\n\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\n\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...hmmm sounds like some of us might be Immortal. (Ask your preacher about that)\n\n\nMay Yahweh Bless You as He has me. Seed long and Prosper from the Blessings of our Lord. I have asked the Father to Bless all those that Seed Long.  \n\nDo Not believe anything you find here, search the Scriptures daily to determine the TRUTH.  Other Torrents in this Series at\n\n\nGet info on the Take Over by The New World Order Below a\n\n &lt;a href=&quot;\nhttp://end-times-prophecy.com/blog/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://end-times-prophecy.com/blog/&lt;/a&gt;                                                                  Prophecy from Susan Davis &lt;a href=&quot;\nhttp://jesus-talks.com/blogs/blog1.php/creating-an-event-in-heaven&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://jesus-talks.com/blogs/blog1.php/creating-an-event-in-heaven&lt;/a&gt;                   A place where Jesus would feel at home. This is a new site still under construction. &lt;a href=&quot;\nhttp://www.khouse.org/topical_bible_study&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouse.org/topical_bible_study&lt;/a&gt;                                                       Free online Bible Study &lt;a href=&quot;\nhttp://www.babylonthegreatisfalling.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.babylonthegreatisfalling.net&lt;/a&gt;                                                            End Times Prophecy - Who is Babylon the Great &lt;a href=&quot;\nhttp://www.theberean.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theberean.org/&lt;/a&gt;                                                                                Daily Bible Study in Your Email &lt;a href=&quot;\nhttp://www.khouseafrica.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouseafrica.com/&lt;/a&gt;                                                                           Chuck Missler - Africa &lt;a href=&quot;\nhttp://www.store.khouse.org/store/catalog&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.store.khouse.org/store/catalog&lt;/a&gt;                                                        Chuck Missler - USA &lt;a href=&quot;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&lt;/a&gt;                                       Dehydrated Survival Food -  Excellent Taste &lt;a href=&quot;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&lt;/a&gt;          Chuck Missler - New Zealand, Australia, Pacific Rim\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n      :thankyou:    :thankyou:     Thank You JESUS  \n\n  ","torrent":{"xt":"urn:btih:255eb1dc047fefdb42752262dddb915622abda35","amp;dn":"POtHS+-+End+Times+-+60+-+Upcoming+Age+of+Transitions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"255eb1dc047fefdb42752262dddb915622abda35","infoHashBuffer":{"type":"Buffer","data":[37,94,177,220,4,127,239,219,66,117,34,98,221,219,145,86,34,171,218,53]},"announce":[],"urlList":[]}}