{"title":"Star Trek - Four Exciting All-New Action-Adventure Stories!","uid":9247995,"size":294930297,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:25f1a87c5d2924d90af0072299a780034ccc6978&amp;dn=Star+Trek+-+Four+Exciting+All-New+Action-Adventure+Stories%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"}{eywood","files":8,"time":1385407612,"description":"Star Trek\nFour exciting all-new action-adventure stories!\n\nThis is one of those children's albums that was released on Power records (which is a sister label of Peter Pan records) in 1975.  It is four roughly 15 minute stories, three of which are written by esteemed science fiction author Alan Dean Foster.  The other one (The Time Stealer) was written by Cary Bates &amp; Neal Adams.  \n\nThere is no information on the album cover other than that.  The cast and production staff is uncredited.  I just figured that someone out there who grew up with this in their record collection might be amazed to hear it again.\n\nThis was a VERY scratchy record.  Not dirty.  I cleaned it many times very well.  Scratchy.  Like it was owned and cared for by a child.  Considering the target market, that is most likely the case.  I ran it through two different programs' pop filters and then declicked what was left by hand.  There are still some scratchy noises, and there are some artifacts from the declicking, mostly low frequency bumps and a sound like percolating water in the background now and then, but you can actually hear the dialogue now, rather than primarily noise.  For some reason the right channel was quieter and tonally duller than the left, so I EQd it differently.  It's still a bit more muffled than the left, though, because to go any more trebly would have brought way too much hiss and background noise out (there is way too much as it is.  If this were a music recording I would never have accepted the amount of hiss that is left on this recording, but for something like this I thought that it wouldn't be prudent to do excessive mastering work).  After I declicked everything, and before EQing, I noise-reduced it a bit, but sparingly.  Too much just muffled it more.  The right channel EQing brought out the NR artifacts as well, a sweeping hiss sound that is noticeable some time more than others.  It is my belief that the dull right channel is caused by improperly cleaned playback equipment in the mastering phase at the studio, and that all copies of this album are like this.  If you pay close attention, you'll also hear some bad editing here and there.  This record was thrown together with haste, and the final result is flawed.\n\nI hope somebody out there enjoys this, or at least some Trekkies* find it a necessary addition to their collections.\n\n\n\n01 A Mirror for Futility  - The Enterprise encounters two massive warships heading into Federation space with potentially devestating consequences.\n\n02 The Time Stealer - The Enterprise encounters an energy cloud that causes time to slow down.\n\n03 The Logistics of Stampede - The Enterprise crew helps a Federation affiliate redirect a regualrly occurring stampede in order to save the planet's crops.\n\n04 To Starve A Fleaver - The Enterprise picks up a member of a new species who have applied for membership in the Federation.  They are soon after plagued by uncontrollable laughter.","torrent":{"xt":"urn:btih:25f1a87c5d2924d90af0072299a780034ccc6978","amp;dn":"Star+Trek+-+Four+Exciting+All-New+Action-Adventure+Stories%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25f1a87c5d2924d90af0072299a780034ccc6978","infoHashBuffer":{"type":"Buffer","data":[37,241,168,124,93,41,36,217,10,240,7,34,153,167,128,3,76,204,105,120]},"announce":[],"urlList":[]}}