{"title":"Dennis Nilsen - Conversations with a Killer (2013 - Retail)","uid":9343399,"size":5450297,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:27f4397757360432aededa8dc64cb76409837e55&amp;dn=Dennis+Nilsen+-+Conversations+with+a+Killer+%282013+-+Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Robin1966","files":5,"time":1386980887,"description":"Books : Biography : English\n\n\nRuss Coffey, &quot;Dennis Nilsen - Conversations with Britain's most evil serial killer&quot;\nEnglish | ISBN: 1782194592 | 2013 | 288 pages | EPUB | 3 MB\n\nIn February 1983, civil servant Dennis Nilsen was arrested after body parts were found to be blocking drains at the house where he lived. As the squad car drove him away, he confessed he had strangled 15 young men. It wasn't just the crimes that stunned the police, but the way Nilsen talked. He spoke as if he loved the young men he killed. His words seemed bizarre. When newspapers carried stories of how the 37-year-old lured men back to his flat and why, the nation was shocked by his sheer evil. Yet some psychiatrists considered him a man of rare, complex, and extreme psychological problems. Moreover, they had never met a killer who seemed so keen to understand his own psyche. Whilst on remand in Brixton Prison, Nilsen filled 55 exercise books with thoughts. During his subsequent thirty years in prison he has continued to write, most notably on the first draft of a multi-volume autobiography. The Home Office has now banned it, calling the work pornographic and outrageous. Only one journalist has read the book. Using exclusive access to Nilsen's writing and extensive independent research, Russ Coffey explains what Nilsen says and how much of it we can believe. This is a shocking glimpse into the mind of a killer.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:27f4397757360432aededa8dc64cb76409837e55","amp;dn":"Dennis+Nilsen+-+Conversations+with+a+Killer+%282013+-+Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27f4397757360432aededa8dc64cb76409837e55","infoHashBuffer":{"type":"Buffer","data":[39,244,57,119,87,54,4,50,174,222,218,141,198,76,183,100,9,131,126,85]},"announce":[],"urlList":[]}}