{"title":"Addons Detector v3.9.2 [Premium].apk","uid":10241617,"size":1296468,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:2e7a7600d4e906ee0ee5378911a96e1fb00e3bc8&amp;dn=Addons+Detector+v3.9.2+%5BPremium%5D.apk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ill420smoker","files":-1,"time":1401249782,"description":"Addons Detector detects addons used by your installed applications. It has all the tools to find push notification ads and icon ads.\n\nIf you are looking for the app that uses AirPush or other push notifications, you can easily find the app and uninstall.\nBesides push notifications, using this app is a great way to see what advertising agencies apps use, and what tools they have integrated.\n\nDoes the normal scan not detect the spam ads? Enable the notification monitor and you can easily see which program puts a notification in your notification area. \n\nThe current list of addons we detect: (note: addon definitions are updated from the server, so there may be more than on this list. Check the help function to see all the addons we can detect)\n\n#Push Notifications#\nAirPush, Airpush Hidden (Suspected), Appenda, Beluga Boost, Custom PushAds\n(Appbucks), Custom PushAds (Bobgame), Custom PushAds (Feelingtouch), Custom PushAds (Letang), Custom PushAds (Nulldroid), LeadBolt, Moolah Media, Senddroid, TapIt\n\n#Advertising#\nAdFonic, Adinch, AdKnowledge, Adlantis, AdMaker, Admarvel, AdMob, Admoda, AdSense, Aduru, AdWhirl, AirAd, Amobee, Appbrain, Burstly, BuzzCity, Cauly, Chartboost, Daum, Domob, Everbadge, GreyStripe, Huntmads, InMobi, Inneractive, JumpTap, Komli, Madhouse, Madvertise, MDotM, Medialets, Mediba, Millenial, MobClix, MobFox, MOcean, MoPub, Nexage, OneRiot, Papaya Offers, Pontiflex, Quattro, RevMob, Sellaring, Smaato, StartApp, Tapjoy, Vdopia, VSERV, Youmi, Zest\n\n#Analytics#\nApsalar, Claritics, Flurry, Google Analytics, InApp, Localytics, Medialets, MixPanel\n\n#Developer Tools#\naChartEngine, ACRA, ActiveAndroid, AndEngine, Android NDK, Angle, Basic4Android, BugSense, Corona, Crittercism, Dropbox, Facebook, FMOD, Fortumo, Getjar, Immersion Motiv, jMonkeyEngine, libgdx, Marmalade, MonoDroid, NullWire, OpenStreetMap, PayPal, PhoneGap, PowerVR Shell, RoboGuice, RobotMedia Android Billing, Ruboto, Titanium, Twitter4j, Unity3d, Urban Airship, Xtify, Zong\n\n#Gaming#\nBeintoo, HeyZap, OpenFeint, Papaya Social, ScoreLoop, ScoreNinja, Skiller, Swarm\n\n#Icon Ads#\nAirpush Icon, LeadBolt Icon, SendDroid Icon, StartApp Icon\n\n#Licensing#\nAmazon Licensing, Google Licensing Service, SlideMe SlideLock\n\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.denper.addonsdetector&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.denper.addonsdetector&lt;/a&gt;\n\n\n* Premium features / Livescan Monitor unlocked\n\n\nEnjoy!","torrent":{"xt":"urn:btih:2e7a7600d4e906ee0ee5378911a96e1fb00e3bc8","amp;dn":"Addons+Detector+v3.9.2+%5BPremium%5D.apk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e7a7600d4e906ee0ee5378911a96e1fb00e3bc8","infoHashBuffer":{"type":"Buffer","data":[46,122,118,0,212,233,6,238,14,229,55,137,17,169,110,31,176,14,59,200]},"announce":[],"urlList":[]}}