{"title":"I Know Not by James Daniel Ross - sam2085","uid":9339828,"size":383091,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:36f5737f6c7d3281947f33847cc591001df764e7&amp;dn=I+Know+Not+by+James+Daniel+Ross+-+sam2085&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sam2085","files":1,"time":1386907425,"description":"I Know Not by James Daniel Ross - sam2085\n\nBeing a bastard is sometimes a survival trait. I am not a bad man. Well, I must be honest with myself: I don't try to be a bad man. It just seems to... happen. I woke up in a castle populated by corpses. Devoid of past or present, bereft of even a name, so I must be honest with myself. I discovered I am a wizard with a blade, silent as the wind, and as deadly as a forest fire. When other men look and see safety, I can feel the ambush coming. When others see only smiles, I can smell the hidden plots and secreted knives. When others only see walls and guards, I can find a highway to the heart of the most imposing castle. I wish I knew what all these things mean, but I must be honest with myself and say I know not. I must be honest because I am a fantastic liar. If I begin lying to myself I will not be able to survive. And I intend to survive. A virtuoso in the symphonies of death, follow Fox Crow as he begins a journey of self discovery begun in an abbitoir, that continues through forbidding lands and the courts of the highest born, and culminates in the coldest darkness filled with temptation and murder. The first fantasy novel of award winning author, James Daniel Ross, I Know Not is a hard hitting, gritty, adventure. Welcome to a world with far more shadows than sunshine. Walk the forest paths where the faries eat human flesh. Explore a world where the heroes may wear black.\n &lt;a href=&quot;\nhttps://www.goodreads.com/book/show/11338679-i-know-not&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://www.goodreads.com/book/show/11338679-i-know-not&lt;/a&gt;\n\n--------\n\ngoogle &quot;sam2085 kickass&quot; to find my other torrents\n\nTo quicky convert between formats like MOBI, EPUB, AZW3, TXT or PDF\nuse http://calibre-ebook.com/download or http://www.online-convert.com/\n\nComment if you cannot find seeds! I'm always seeding my uploads unless my pc is off.","torrent":{"xt":"urn:btih:36f5737f6c7d3281947f33847cc591001df764e7","amp;dn":"I+Know+Not+by+James+Daniel+Ross+-+sam2085","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36f5737f6c7d3281947f33847cc591001df764e7","infoHashBuffer":{"type":"Buffer","data":[54,245,115,127,108,125,50,129,148,127,51,132,124,197,145,0,29,247,100,231]},"announce":[],"urlList":[]}}