{"title":"Alex Jones Show - 2013 Dec 12 TH [sebaygo1]","uid":9339725,"size":70269382,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:39b415bf7147b5c65d44c46c6fe98aa58e46c450&amp;dn=Alex+Jones+Show+-+2013+Dec+12+TH+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":5,"time":1386905304,"description":"\nThe Alex Jones Show \nThursday, 12 December 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the PrisonPlanet.tv web site :: The Great Congressional Budget Compromise Of 2013 And Other Fiscal Insanities. Plus, Dr. Ron Paul Joins Us To Discuss Rise Of The Liberty Movement and The Potential To Turn The Tide.\n\nOn the Thursday, December 12 edition of The Alex Jones Show, Jones examines the unprecedented police state rollout in New York City in the run up to the Super Bowl, and takes a look at Homeland Security's decision to finally fire the man that advocated a genocidal race war. \n\nAlex also analyzes the great &quot;congressional budget compromise&quot; and how it still ends up screwing the American taxpayer, and continues outlining the ill effects stemming with the Obamacare train wreck. \n\nJoining Alex today is former Congressman Ron Paul. The stalwart libertarian and three time presidential contender will discuss Obama's actions becoming more and more dictatorial, the Republican budget sellout, the out-of-control rise of police corruption and the slow motion implosion of the American dollar.\n\nThis upload is the Prison Planet &quot;members' edit&quot; -- the whole broadcast in one .MP3 with scheduled commercial breaks taken out. I hope to be back to doing my normal edit tomorrow.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n\n It is my opinion that in this time it is virtually\n essential to seek information from a variety of sources, \n to listen to a spectrum of voices in order to better \n understand the &quot;big picture.&quot; A reliance solely upon\n mainstream corporate media for news and info is a \n prescription for ignorance. I try to share information\n that counters the monotone of mainstream corporate media.\n \n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents. \n\n Think for yourself!\n To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n\n !! please try some of the other shows I upload too !!\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.","torrent":{"xt":"urn:btih:39b415bf7147b5c65d44c46c6fe98aa58e46c450","amp;dn":"Alex+Jones+Show+-+2013+Dec+12+TH+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39b415bf7147b5c65d44c46c6fe98aa58e46c450","infoHashBuffer":{"type":"Buffer","data":[57,180,21,191,113,71,181,198,93,68,196,108,111,233,138,165,142,70,196,80]},"announce":[],"urlList":[]}}