{"title":"Game Center CX - Near Perfect Complete English Collection","uid":9302634,"size":96850952695,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3e6527beda2f104e37c8a6cbea3918bf8b5d15d8&amp;dn=Game+Center+CX+-+Near+Perfect+Complete+English+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"PiebaldX","files":-1,"time":1386267941,"description":"GAME CENTER CX: NEAR PERFECT COMPLETE ENGLISH COLLECTION\nDecember 5th, 2013 Edition\n\n===\n\nHello!\n\n\nThis torrent comprises &gt;what I believe&lt; to be the most current \n\nand complete collection of Game Center CX videos released on the \n\ninternet by English fan subbing groups as of December 5th, 2013.\n\nI decided to put this collection together to demonstrate my love \n\nfor the series, and to help as many people as possible get in \n\ntouch with GCCX without having to struggle to find the episodes. \n\nCurrently, it can be a real pain to track down all the episodes \n\nin decent quality (it has taken me a year to gather all this \n\nmaterial). I hope this collection sets a new standard in getting \n\nthe show out to the people and the confusion of the past few \n\nyears can be left behind!\n\n---\n\nWhat is Game Center CX (GCCX)?\n\nGCCX is a live-action, unscripted video game show that revolves \n\naround the trials and tribulations of our host, middle-aged \n\nJapanese comedian Chief Arino, as he marathon plays through some \n\nof the most difficult and challenging video games on consoles \n\nranging the NES, Super Nintendo, Playstation, and everything in-\n\nbetween. Arino's goal is to simply beat the game challenge of the \n\nday and become a champion, or go home an abject failure... \n\nOftentimes, he's a little bit of both!\n\n\nHowever, GCCX isn't just a gaming show. It has a wide appeal and \n\nwill entertain all, whether you're a hardcore gamer or the type \n\nof person that mispronounces Mario's name. Side-splitting humor, \n\nintense gaming, triumphant comebacks, memorable miracle moments \n\nand detailed peeks into the whole other world that is Japanese \n\ngaming are just a few of the highlights GCCX has to offer as \n\nArino struggles through multiple games spanning many consoles and \n\ngenres. Truly, this is a magnificent comedygamingplain ole' \n\nhuman show, and you now have hours of material to pore through \n\nwaiting at your fingertips. \n\n\nTo put it in the purest terms: GCCX is one of those TV shows that \n\nyou need in your life. I guarantee you will come to love GCCX for \n\nprobably the rest of your life. Yeah, it's THAT good.\n\n---\n\nWHAT'S IN THE TORRENT?:\nAll current English translated episodes of GCCX, seasons 1-17 in \n\ntheir best available quality, including all currently translated \n\nspecials, live events, advertisements, Nintendo Channel episodes, \n\nextra Arino appearances on Japanese TV, and much more.\n\n\nAll of this is neatly organized and arranged for ease of viewing. \n\nIn interest of presenting all available subbed material, there \n\nare some episodes that overlap content from other episodes where \n\nsub groups have gone above and beyond and translated episodes \n\nbeyond previous subbed releases. I have named these episodes to \n\nlessen confusion as &quot;Full Coverage.&quot;\n\n\nI have also included an episode guide that was last current in \n\nAugust 2013. I used it as a guide for tracking down the truly \n\nobscure bits of Arino-nalia out there. I also followed the naming \n\nscheme for the specialslive events and other material presented \n\nthere, as well, to avoid confusion. Hopefully my efforts are good \n\nenough!\n\n\nIt's safe to say not many people have a collection of GCCX this \n\ncomplete, but sharing this show and getting the word out is more \n\nimportant than claiming to be a master collector.\n\n---\n\nWHAT ISN'T IN THE TORRENT? (AND WHY...):\nIn the interests of promoting the series without detracting from \n\nits Retro Game Master US DVD sales, I have not included the 14 Hi-\n\nDef English subbed episodes contained on said US DVD. \n\nFor now, you'll have to endure the Kotaku dubbed releases. \n\nHowever, if you want to find the original Japanese audio \n\nepisodes, and you like the show and want to support more high-\n\nquality, official subbed episodes being released in the future, \n\nplease look up the Retro Game Master DVD at Amazon \n\nand \n\nsimilar sellers. \n\n\nBy buying this relatively cheap DVD boxset (buy it from 1st party \n\nsellers, not from used sellers!), not only will you help GCCX \n\nout, you'll show that we want more Game Center CX material \n\nofficially translated and presented in Hi-Def quality. Also, \n\nyou'll get a previously unsubbed episode: Shiren the Wanderer. \n\nIt's a great episode and you're missing out if you don't have it! \n\nThe DVD is the only place to see it while also helping out our \n\nfavorite beleaguered gamer, Chief Arino!\n\n---\n\nThat should be all. If I am missing something, please let me know \n\nin the comments and I'll update my release. I may periodically update this pack \n\nwith new files if the demand is there.\n\n---\n\nSpecial thanks to: SomethingAwful for subbing most of the \n\nepisodes and working hard to spread the word; TV-Nihon for their \n\nefforts; Last Continue GCCX for their subbing; Kotaku for \n\nbridging the gap between shores; To anyone who subbed anything \n\nGame Center CX, ever; MaskedTai for organizing and creating \n\ntorrents of the main folders before I refined them, you saved me \n\na ton of work; To anyone who downloads and enjoys the show; To \n\nthose who buy the Retro Game Master DVD and support the show; \n\nMost importantly, to Kacho Arino and all of the Game Center CX \n\nstaff. Thank you for all your years of hard work and good luck on \n\nyour future endeavors!! \n\nEnjoy!","torrent":{"xt":"urn:btih:3e6527beda2f104e37c8a6cbea3918bf8b5d15d8","amp;dn":"Game+Center+CX+-+Near+Perfect+Complete+English+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e6527beda2f104e37c8a6cbea3918bf8b5d15d8","infoHashBuffer":{"type":"Buffer","data":[62,101,39,190,218,47,16,78,55,200,166,203,234,57,24,191,139,93,21,216]},"announce":[],"urlList":[]}}