{"title":"KISS Ultimate Lossless Audio Collection Additions Part 8 - Mick","uid":10340172,"size":424936371,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:463281c6ebdeebdf90edc4ff2aaeaa05ff8bc310&amp;dn=KISS+Ultimate+Lossless+Audio+Collection+Additions+Part+8+-+Mick+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Flyfisher61","files":17,"time":1402532292,"description":"8th AND FINAL (maybe?) run of additions to this project. Many more to come.\n\nThe Goal?\n\nTo fit all KISS audio onto one (or 2) 64gb usb stick(s) in LOSSLESS wave format (16/44100).\n\nTo find the best possible quality sources for material.\n\nTo present the material as close as possible to it's original, natural intent.\n\nTo make sure all songs are uniform in volume, left to right stereo panning perfectly even, and all tracks speed and pitch corrected.\n\nThe Ultimate Goal? THE definitve KISS audio collection.\n\nThe idea for this project came about 3 years ago when I was fed up with brickwalled cd's and scratched, skipping cdr's in my car, and the constant changing of discs. Now that usb ports are possible in almost every thing we use elctronically, including our vehicles, the project was a no brainer for me. With that said, I know it is not perfect. But, please enjoy.\n\nI've included all cover scans where possible.\n\n\nI enjoyed listening to part 1 of this project very much. What made it most enjoyable for me, was having uniform volume throughout, with the ability to flip from track to track in any random order. \nSo I figured, why not start adding the most popular, and/or best sounding KISS bootlegs? \nIt's not the easiest task balancing random bootlegs, spanning a 40 year career, with their studio album counterparts.\n\nI &quot;tweaked&quot; ALL shows to MY LIKING and I feel many of these shows sound better than ever!!!!.\n\n\n\n\n-Hot In The Shade Mick E. Gee &quot;remaster&quot;\n \nEveryone complains about this album, whether it's the sound or the songs. The new vinyl reissue is very quiet and very little, if any, remastering.\nSo I figured I'd take a shot at it. I used the original cd because 1) the new reissue is so low, and any raising of the volume brings up the noise 2)the original cd is not brickwalled and more natural 3)it's cleaner than any vinyl rip available. \nI think this turned out really well. Enjoy!","torrent":{"xt":"urn:btih:463281c6ebdeebdf90edc4ff2aaeaa05ff8bc310","amp;dn":"KISS+Ultimate+Lossless+Audio+Collection+Additions+Part+8+-+Mick+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"463281c6ebdeebdf90edc4ff2aaeaa05ff8bc310","infoHashBuffer":{"type":"Buffer","data":[70,50,129,198,235,222,235,223,144,237,196,255,42,174,170,5,255,139,195,16]},"announce":[],"urlList":[]}}