{"title":"Alex Jones Show - 2013 Dec 19 TH [sebaygo1]","uid":9369388,"size":66457266,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:49a13c0227e5c61c5ab21e538e2e2be2996271c8&amp;dn=Alex+Jones+Show+-+2013+Dec+19+TH+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":12,"time":1387496253,"description":"\nThe Alex Jones Show \nThursday, 19 December 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On this Thursday, December 19 edition of The Alex Jones Show, Alex examines the latest frightening move towards capital controls as a White House review panel report suggests the government used the NSA to launch cyber attacks against financial institutions and manipulate bank accounts, and as retail outlet Target reports over 40 million of their Black Friday shoppers' information could be compromised. \n\nOn today's show, Jones welcomes Paul Jenkins, the President and CEO of Veteran Beer Company, an American business founded by veterans and operated by a 100% veteran employee force that crafts, sells, and delivers beers of superior quality. \n\nAlex also invites actor Glenn Jacobs to give his take on the clamp down on freedom via the TSA, Internet sales tax and attack on states' rights. \n\nAnd Infowars reporter David Knight joins Alex in studio to discuss the Glenn Greenwald book deal controversy and the journalist's partnership with Paypal.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n\n It is my opinion that in this time it is virtually\n essential to seek information from a variety of sources, \n to listen to a spectrum of voices in order to better \n understand the &quot;big picture.&quot; A reliance solely upon\n mainstream corporate media for news and info is a \n prescription for ignorance. I try to share information\n that counters the monotone of mainstream corporate media.\n \n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents. \n\n Think for yourself!\n To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n\n !! please try some of the other shows I upload too !!\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.","torrent":{"xt":"urn:btih:49a13c0227e5c61c5ab21e538e2e2be2996271c8","amp;dn":"Alex+Jones+Show+-+2013+Dec+19+TH+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49a13c0227e5c61c5ab21e538e2e2be2996271c8","infoHashBuffer":{"type":"Buffer","data":[73,161,60,2,39,229,198,28,90,178,30,83,142,46,43,226,153,98,113,200]},"announce":[],"urlList":[]}}