{"title":"Naruto Shippuden 339 Sub Indo","uid":9236693,"size":156681484,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4a58b1f57df0a96518659836ffb28233d370371b&amp;dn=Naruto+Shippuden+339+Sub+Indo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"D4SH4","files":1,"time":1385190162,"description":"Kembali di depan, kelima Kage berjuang untuk menahan mereka sendiri terhadap klon kayu Susano'o berpakaian Madara. Namun, sekutu ÅŒhnoki melawan, mencatat bahwa mereka butuhkan untuk memenuhi sebuah tugas yang tidak dapat gagal. Madara menyadari bahwa ÅŒhnoki adalah masalah dan bahwa ia harus mematahkan kehendak-Nya. Dengan itu, Kage pergi pada serangan terhadap klon Madara sekali lagi. Namun, situasi segera mengambil giliran untuk yang terburuk sebagai Madara pada gilirannya menanggapi dengan kekuatan penuh juga dengan mengaktifkan Susano'o terakhirnya dan hasil untuk menggunakan pedangnya untuk menyerang mereka. Di tempat lain di gua, Itachi perintah Kabuto untuk mengakhiri Dunia Reinkarnasi Najis. Sasuke menyatakan tekadnya bahwa ia akan menghancurkan desa yang membuat saudaranya menderita begitu lama sementara mengucapkan selamat tinggal kepada Itachi sama sekali. Seperti lampu mulai turun di medan perang dan shinobi reinkarnasi mulai memudar menjadi pilar cahaya, Itachi mendekati Sasuke dan menggunakan Sharingan untuk menunjukkan Sasuke segala sesuatu tentang pembantaian klan Uchiha. Dengan kebenaran mengungkapkan kepada Sasuke akhirnya, Itachi kemudian menanamkan kata-kata terakhirnya kepada saudaranya, yang menyatakan bahwa apa pun yang terjadi dan terlepas dari apa yang dia lakukan pada keluar dari sini, ia akan selalu mencintainya.","torrent":{"xt":"urn:btih:4a58b1f57df0a96518659836ffb28233d370371b","amp;dn":"Naruto+Shippuden+339+Sub+Indo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a58b1f57df0a96518659836ffb28233d370371b","infoHashBuffer":{"type":"Buffer","data":[74,88,177,245,125,240,169,101,24,101,152,54,255,178,130,51,211,112,55,27]},"announce":[],"urlList":[]}}