{"title":"Two Men In Manhattan directed by Jean-Pierre Melville (1959) FR ","uid":9359291,"size":167732351,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4a701c679871588bd2f067653f8419d85aff0d75&amp;dn=Two+Men+In+Manhattan+directed+by+Jean-Pierre+Melville+%281959%29+FR+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"loninappleton","files":2,"time":1387277634,"description":"Two Men In Manhattan (1959) directed by Jean Pierre Melville - French with Eng hard subtitles\n\nruntime 1 hr 25 mins\n\nCast \n\nJean-Pierre Melville,\nPierre Grasset, \nChristiane Eudes, \nGinger Hall.\n\n\nDirectors of photography; Nicolas Hayer, Jean-Pierre Melville ; \nMusic; Christian Chevalier, Martial Solal.\n\nSummary from my source\n\n&quot;The dark shadows of New York come to life in this rarely-seen, moody, jazz-soaked noir classic. A film by the great Jean-Pierre Melville, who cast himself as a journalist on an ethically fraught mission to track down a missing French diplomat.&quot;\n\nMy notes\n\nThe film is from a current release dvd.  But I was very surprised to see it only available in a very large size torrent.\n\nIt has a sub theme concurrent with this release which will become obvious.  I am torrenting this title because of its apparent lack of availablility and because I am enjoying it so much. My thanks to the torrent community for many things I have found from others.\n\nHaving recently seen the original 1950's series for television with John Cassavettes titled &quot;Johnny Staccato&quot;,\n\n\n &quot;Two Men In Manahattan&quot; gives even more of a feel for the New York City of the late 1950s.  \n\nYou can read more about the director and the film elsewhere:\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Two_Men_in_Manhattan&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Two_Men_in_Manhattan&lt;/a&gt;\n\nFor me, the location work on the street and at places like Capitol Records recording studios plus the sound track by Martial Solal (not to mention the automobiles) was a major part of the enjoyment. Solal's score also reminded me of the jazz influence on French culture asrecorded by Mimi Perrin's The Double Six Of Paris.  This is all nostalgia for something I never knew first-hand but collected on LP records.\n\n\nThe film is available from The Cohen Collection in full DVD box with book on the director, cast and production, and interviews.  Libraries should get it for their noir collections.\n\n\nEnjoy Two Men In Manhattan on all these levels-- it is worth many viewings.\n\nNotes written December 16th 2013","torrent":{"xt":"urn:btih:4a701c679871588bd2f067653f8419d85aff0d75","amp;dn":"Two+Men+In+Manhattan+directed+by+Jean-Pierre+Melville+%281959%29+FR+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a701c679871588bd2f067653f8419d85aff0d75","infoHashBuffer":{"type":"Buffer","data":[74,112,28,103,152,113,88,139,210,240,103,101,63,132,25,216,90,255,13,117]},"announce":[],"urlList":[]}}