{"title":"Valentina Nappi (Scene from Raw 16) [.mp4]","uid":9289918,"size":1050927329,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:4a82795e58093c43ca006e8d7d68f53f089ad978&amp;dn=Valentina+Nappi+%28Scene+from+Raw+16%29+%5B.mp4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1386071421,"description":"Director Manuel Ferrara infuses new excitement and flavor into his reality-based smut, revealing the naked human passion that often escapes the adult industry's formatted fuck scenes. In 'Raw 16,' the legendary French-American superstud shows private footage of his intimate dates with porn girls more driven by lust than fame. Gorgeous Italian bombshell Valentina Nappi greets him wearing a skintight red dress that shows off her naturally voluptuous body... and no panties. Before they even reach their destination, the young beauty is swallowing the director's massive, uncut dick in the car. Valentina takes a ferocious anal reaming topped off with a load of hot sperm!\n\nBusty blonde Kayden Kross services the director in two separate, passionate encounters, lovingly sucking his huge cock and riding it to ecstasy. Manuel enters his hotel room to find super-busty MILF Ava Addams waiting in bed, her enormous, round boobs fully exposed. He eats Ava's sweet pussy and stuffs her tight yet elastic rectum full of thick, throbbing meat. Top-heavy, tattooed bimbo Romi Rain meets our man for a bit of extracurricular fucking in the shower and elsewhere. Manuel fingers Romi to a squirting ejaculation; she eagerly laps up her own juices mixed with Manuel's splooge from a glass tabletop! 'Raw 16' is an intimate view of what real (albeit sexually attractive) people look like having real sex in real life. Gritty verite trumps cinematic visuals for those more aroused by peeking in on animal instincts than watching staged sex stunts!\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=66239536207703000212.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=66239536207703000212.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=77263733234999366059.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=77263733234999366059.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:4a82795e58093c43ca006e8d7d68f53f089ad978","amp;dn":"Valentina+Nappi+%28Scene+from+Raw+16%29+%5B.mp4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a82795e58093c43ca006e8d7d68f53f089ad978","infoHashBuffer":{"type":"Buffer","data":[74,130,121,94,88,9,60,67,202,0,110,141,125,104,245,63,8,154,217,120]},"announce":[],"urlList":[]}}