{"title":"2014 - The Year In Christian Music (Bundle 26)","uid":10253452,"size":2167136478,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4c5d960613c3bdd6a7e19a2f0c393e4da6c016f0&amp;dn=2014+-+The+Year+In+Christian+Music+%28Bundle+26%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"TorrentTracts","files":271,"time":1401384305,"description":"-----------------------------------------------------------------------\n2014 - THE YEAR IN CHRISTIAN MUSIC\n-----------------------------------------------------------------------\n\nSo I was out taking a drive this past weekend.  Going nowhere in particular.  Killing time.  Just enjoying a nice summer day.  Listening to some of this music.  Sipping on a cold pepsi.  Eating some peanuts.\n\nSaw a hitchhiker.  Rough looking guy.  Not very well dressed.  Messy appearance.  Lots of facial hair.  Decided to pull over to give him a ride.  Normally, my biggest fear in picking up hitchhikers isn't being knifed or jacked.  Instead it's whether or not they speak English.  What can I say?  It would be a long and awkward trip for both of us if we couldn't communicate.\n\nBut this guy did in fact speak English.  Although French appeared to be his first language.  Turns out he was traveling about three hours north of where I picked him up.  So since I had a free day, and a tank full of gasoline, I offered to drive him to his destination.  And I'm glad I did.\n\nWe got to talking when he saw a cross hanging from my rear view mirror.  In a thick French accent, he pointed to the cross and sarcastically said something like, &quot;you believe in this?&quot;  I think I responded by saying something like, &quot;It doesn't matter what I believe in.  The truth doesn't depend on my acceptance of it.  The truth is the truth whether I believe it or not.&quot;\n\nWhen you're in a vehicle with a stranger for three hours, you get to learn a lot.  Not only about the other person, but you learn a lot about yourself as well.  For instance, I learned that in that particular situation, I had no immediate answer when this guy told me he grew up in a Christian home, and was given every opportunity to succeed as a Believer in Christ.  But instead he strayed from the Lord.  Why?  His Father drank way too much and was abusive towards his Mother.  And as a young boy, he couldn't understand how God would allow such a thing to happen.  And he was angry at his Mother for remaining there.\n\nNow I know there are a lot of people who download this music.  Probably far more than I even realize.  But I have had private conversations with two of you who come to mind.  Individuals who are living in, let's call it &quot;less than a 50/50 marriage.&quot;  And one of you in particular told me that, in a small way, you use this music to keep yourself focused on God during those difficult times.\n\nSo I am dedicating this bundle today to any and all of you who have had to live in less than ideal situations.  Be it living with an abusive spouse, putting up with hurtful family, condescending friends, atheist colleagues at work, etc.  I don't need to remind any of you that God's reward is far greater than any punishment we endure here.  But just like that hitchhiker who is now in my prayers, I also pray for strength, endurance, and direction for all of you as well.  After all, we are, and we remain brothers and sisters through He whom we call Father.  Amen?\n\nPRAISE &amp; WORSHIP: ALC Worship, Guy Penrod, Jesus Culture, Zach Malm.  ROCK: Artifex Pereo, Forever The Fallen, Mountains And The Seas, Relentless Flood.  HARDCORE/METAL: Betraying The Martyrs, Survive The Storm.  ONTEMPORARY: David Crowder Band, Trev Conkey, Vineyard.  HIP-HOP/RAP: DJ I Rock Jesus, Gideonz Army, Kai, KB, Kre8tor, Ozay Moore, StreetRevival, Tedashii.  SINGER-SONGWRITER: Eric Kilgore.  ALTERNATIVE: Jason Eaton, Paradox Music, Sojourn.  INDIE: Let There Be Hope.  POP: Lynn Yang.  INSTRUMENTAL: The Piano Guys.\n\nWe are sharing 33 releases today, including...\n\n * ALC Worship - 2014 - Burning In My Soul - Single\n * Artifex Pereo - 2014 - Time In Place\n * Betraying The Martyrs - 2014 - Where The World Ends - Single\n * David Crowder Band - 2014 - Neon Steeple - Deluxe Edition\n * DJ I Rock Jesus - 2014 - Bangin Leaks 2\n * DJ I Rock Jesus - 2014 - DJ I Rock Jesus Presents\n * DJ I Rock Jesus - 2014 - Knowledge Music, Vol 2\n * DJ I Rock Jesus - 2014 - Memorial Day Weekend Mix\n * Eric Kilgore - 2014 - The Focus And Forbearance\n * Forever The Fallen - 2014 - Left Behind - Single\n * Gideonz Army - 2014 - Hedges And Highways\n * Guy Penrod - 2014 - Worship\n * Jason Eaton - 2014 - Satellites - Single\n * Jesus Culture - 2014 - Unstoppable Love\n * Kai - 2014 - Sting Of Tears\n * KB - 2014 - One Hundred EP - Acapellas\n * KB - 2014 - One Hundred EP - Instrumentals\n * Kre8tor - 2014 - C.R.I.D\n * Let There Be Hope - 2014 - 7Song - The Acoustic Sessions\n * Lynn Yang - 2014 - All You Give Is Love\n * Mountains And The Seas - 2014 - Create In Me - Single\n * Ozay Moore - 2014 - Taking Ls\n * Paradox Music - 2014 - Let Your Hands Be Strong - Single\n * Paradox Music - 2014 - The Glory Archives, Vol 1\n * Piano Guys, The - 2014 - The Story Of My Life - Single\n * Relentless Flood - 2014 - The Time Is Now\n * Sojourn - 2014 - Proof EP\n * StreetRevival - 2014 - Ridin - Single\n * Survive The Storm - 2014 - Beginning Of Man's End - Single\n * Tedashii - 2014 - Below Paradise - Deluxe Edition\n * Trev Conkey - 2014 - Everlasting Hope EP\n * Vineyard - 2014 - Rooftops - The Sound Of Vineyard Youth\n * Zach Malm - 2014 - Anchor Hymns\n\nFor Him,\nTorrentTracts, May 2014\t","torrent":{"xt":"urn:btih:4c5d960613c3bdd6a7e19a2f0c393e4da6c016f0","amp;dn":"2014+-+The+Year+In+Christian+Music+%28Bundle+26%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c5d960613c3bdd6a7e19a2f0c393e4da6c016f0","infoHashBuffer":{"type":"Buffer","data":[76,93,150,6,19,195,189,214,167,225,154,47,12,57,62,77,166,192,22,240]},"announce":[],"urlList":[]}}