{"title":"Hank Mobley - 1958 - Peckin Time (2008) FLAC","uid":9332344,"size":526289295,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4c858d71b4bc33da293cd55698a8f437e0720cd4&amp;dn=Hank+Mobley+-+1958+-+Peckin+Time+%282008%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"eika256","files":-1,"time":1386791580,"description":"Hank Mobley - 1958 - Peckin Time (2008)\n\nTenor saxophonist Hank Mobley was overshadowed by more influential tenors such as Sonny Rollins and John Coltrane during his career, but although he wasn't deliberately flashy or particularly innovative, his concisely measured, round sax tone made him the perfect ensemble player and he was a fine writer, as well, a talent who has often been undervalued and overlooked. The Peckin' Time session was recorded February 9, 1958 (the LP was issued a year later) and came in the midst of what was a period of whirlwind creativity for Mobley, who recorded work for the Savoy and Prestige imprints as well as six full albums for Blue Note (two were never released -- it was not that uncommon for Blue Note to stockpile sessions at the time) in a little more than a year's time (later Blue Note albums like Soul Station and Roll Call were still well in the future). For this session, Mobley found himself working with a young Lee Morgan on trumpet and in front of a fluid rhythm section that included pianist Wynton Kelly, bassist Paul Chambers, and drummer Charlie Persip, and it's solid stuff, bright and always energetic. All but one of the tracks, a rendering of Kurt Weill's &quot;Speak Low,&quot; were written by Mobley, and again, his hidden strength was always his writing, and it should probably come as no surprise that the best two tracks here, the title tune &quot;Peckin' Time&quot; and the wonderful &quot;Stretchin' Out,&quot; were both penned by Mobley. It all adds up to a fine program, and if Mobley didn't push the envelope a whole lot, his lyrical and economical playing was always appropriate and graceful, and that's certainly the case here. (AllMusic)\n\nTrack list:\n01 - High And Flighty\n02 - Speak Low\n03 - Peckin' Time\n04 - Stretchin' Out\n05 - Git-Go Blues\n06 - High And Flighty (Alternate Take)\n07 - Speak Low (Alternate Take)\n08 - Stretchin' Out (Alternate Take)\n\nPersonnel:\nHank Mobley - tenor saxophone\nLee Morgan - trumpet\nWynton Kelly - piano\nPaul Chambers - bass\nCharlie Persip - drums\n\nEnjoy and share!","torrent":{"xt":"urn:btih:4c858d71b4bc33da293cd55698a8f437e0720cd4","amp;dn":"Hank+Mobley+-+1958+-+Peckin+Time+%282008%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c858d71b4bc33da293cd55698a8f437e0720cd4","infoHashBuffer":{"type":"Buffer","data":[76,133,141,113,180,188,51,218,41,60,213,86,152,168,244,55,224,114,12,212]},"announce":[],"urlList":[]}}