{"title":"Thomas Becket: Warrior, Priest, Rebel, Victim (2012 - Retail)","uid":9368472,"size":8915733,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4e983a6ebe847e3f3ba5ce80476d0bebcad61591&amp;dn=Thomas+Becket%3A+Warrior%2C+Priest%2C+Rebel%2C+Victim+%282012+-+Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Robin1966","files":5,"time":1387477044,"description":"Books : Biography : English\n\nIn 1120 the wife of a Norman draper's merchant gave birth to a baby boy in London's bustling Cheapside. Despite his sickly constitution, middle-class background and unremarkable abilities, he rose within the space of thirty-five years to become the most powerful man in the kingdom, second only to Henry II himself.\n\nAt his height, he led seven hundred knights into battle, brokered peace between nations, held the ear of the Pope and brought one of the strongest rulers in Christendom to his knees. And within three years of his bloody assassination, he was a saint whose cult had spread the length and breadth of Europe, and a legend who remains as controversial and compelling today as he was during his life.\n\nThe story of Thomas Becket is the story of an enigma, as well as of one of the most tumultuous periods in English history. Drawing on a vast array of contemporary records, personal letters and first-hand accounts, John Guy has reconstructed a psychologically compelling, stunningly nuanced and utterly convincing account of this most remarkable man, the dramatic times in which he lived and the pivotal role he played in his nation's history.\n\n\n'Lively, effortlessly readable, superb. A triumph' The Times\n\n'Suspenseful, meticulously researched . . . however well you think you know the story, it is well worth the read' Financial Times\n\n'Wonderfully moving and subtle. Reading of the assassination is almost unbearably intense and brings tears to one's eye' Daily Express\n\n'Compelling, marvellously measured, entertainingly astute, and in places positively moving' The Independent\n\n'A beautifully layered portrait of one of the most complex characters in English history . . . not only corrects many historical errors and uncertainties, but merits reading more than once, for the sheer joy of its superb storytelling' The Times\n\n'Scintillates with energetic scene-setting, giving us a tactile, visual feel for early medieval England . . . breathes new life into an oft-told tale' Financial Times\n\n'Vivid and extremely readable. The most accessible Life of Thomas Becket to be published in recent years' The Times Literary Supplement\n\n\nJohn Guy is an award-winning historian, accomplished broadcaster and a Fellow of Clare College, Cambridge. His previous books include My Heart is My Own: The Life of Mary Queen of Scots, winner of the 2004 Whitbread Biography Award and the Marsh Biography Award, the highly acclaimed dual biography A Daughter's Love: Thomas and Margaret More and a history, Tudor England, which has sold over 250,000 copies worldwide.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:4e983a6ebe847e3f3ba5ce80476d0bebcad61591","amp;dn":"Thomas+Becket%3A+Warrior%2C+Priest%2C+Rebel%2C+Victim+%282012+-+Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e983a6ebe847e3f3ba5ce80476d0bebcad61591","infoHashBuffer":{"type":"Buffer","data":[78,152,58,110,190,132,126,63,59,165,206,128,71,109,11,235,202,214,21,145]},"announce":[],"urlList":[]}}