{"title":"Total Uninstall Pro 6.3.4 PORTABLE","uid":9254087,"size":18158278,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5090fa610aa35311413d17a5c617cb8c2310edf1&amp;dn=Total+Uninstall+Pro+6.3.4+PORTABLE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Tom_Da_Man","files":1,"time":1385520520,"description":" [image=M7PpioVaRS]\n\nTotal Uninstall helps you monitor any changes that are made to your system during installation of a new software product allowing you to perform a complete uninstall without having to rely on the supplied uninstall program (which may leave files or changes behind).\n\nTo use it, you simply launch the installation program from the Total Uninstall interface and select the system areas to be monitored.\n\nThe program will then create a snapshot of your system before it installs the new software and an additional snapshot after install completes.\n\nIt then compares the two snapshots and displays all changes in a graphical tree view, marking all values and/or files that have been added or changed as well as some before/after details.\n\nTotal Uninstall will save these changes and if you decide to uninstall the application, it will reverse all changes to the previous state.\n\nThe aplication has support for several languages: English, French, German, Italian, Spanish, Arabic, Brazilian-Portuguese, Greek, Polish, Norwegian, Russian, Czech, Romanian, Korean, Serbian, Slovak, Turkish, Ukrainian, Bulgarian. \n\nHOW TO USE \n\nÂ· Start the Total Uninstall wizard before installing a new application, enter a friendly name for monitored application and scan the system.\nÂ· Run the application(s)/program setup.\nÂ· Start the wizard again or continue if it's still active to re-scan the system and detect the system changes.\nÂ· View the changes. Close the wizard.\nÂ· Run the Total Uninstall when you want to view or restore the changes made by monitored application(s)/installing process.\n\nHere are some key features of &quot;Total Uninstall&quot;:\nÂ· Accurate analyze existing installations and create a log with installation changes.\nÂ· Monitor changes from registry and file system for new installations.\nÂ· Uninstall completely and thoroughly analyzed or monitored programs.\nÂ· Create a backup for a program and restore the program from backup.\nÂ· Organize in groups installed or monitored programs.\nÂ· Find the program to uninstall by keyword quickly and easily.\nÂ· Summary and detailed information for each installed or monitored program.\nÂ· User configurable views of the detected changes.\nÂ· It shows a detailed uninstall log.\nÂ· Powerful search in detected changes.\nÂ· Standalone program agent for notification of running installation programs.\nÂ· Export registry changes for install or uninstall.\nÂ· Export installed or monitored programs list to file.\nÂ· Export to file or print detected changes.\n\n[size=180][color=blue]\nMade it portable, so just click and run, no need for installation.\n\nGrtz, Tom_Da_Man[/color][/size]","torrent":{"xt":"urn:btih:5090fa610aa35311413d17a5c617cb8c2310edf1","amp;dn":"Total+Uninstall+Pro+6.3.4+PORTABLE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5090fa610aa35311413d17a5c617cb8c2310edf1","infoHashBuffer":{"type":"Buffer","data":[80,144,250,97,10,163,83,17,65,61,23,165,198,23,203,140,35,16,237,241]},"announce":[],"urlList":[]}}