{"title":"Hallelujah (1929) Xvid 1cd - Classic All Black Musical [DDR]","uid":9299359,"size":1038229504,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:510a8cac70df4a0fadb842582dd126aa6b50106e&amp;dn=Hallelujah+%281929%29+Xvid+1cd+-+Classic+All+Black+Musical+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":-1,"time":1386216751,"description":"Hallelujah (1929) Xvid 1cd - Classic All Black Musical [DDR]\n\nHallelujah (1929) is a Metro-Goldwyn-Mayer musical directed by King Vidor, and starring Daniel L. Haynes and the then unknown Nina Mae McKinney.\n\nFilmed in Tennessee and Arkansas and chronicling the troubled quest of a sharecropper, Zeke Johnson (Haynes), and his relationship with the seductive Chick (McKinney), Hallelujah was one of the first all-black films by a major studio. It was intended for a general audience and was considered so risky a venture by MGM that they required King Vidor to invest his own salary in the production. Vidor's vision was to attempt to present a relatively non-stereotyped view of African-American life.\n\nHallelujah was King Vidor's first sound film, and combined sound recorded on location and sound recorded post-production in Hollywood.[1] King Vidor was nominated for a Best Director Oscar for the film.\n\nIn 2008, Hallelujah was selected for preservation in the United States National Film Registry by the Library of Congress as being &quot;culturally, historically, or aesthetically significant.&quot;\n\nCAST:-\nDaniel L. Haynes........Zeke\nNina Mae McKinney.......Chick\nWilliam Fountaine.......Hot Shot\nHarry Gray..............Parson\nFanny Belle DeKnight....Mammy\nEverett McGarrity.......Spunk\nVictoria Spivey.........Missy Rose\nMilton Dickerson........Johnson Kid\nRobert Couch ...........Johnson Kid\nWalter Tait.............Johnson Kid\nDixie Jubilee Singers\n\nDirected by King Vidor\nProduced by King Vidor, Irving Thalberg\nWritten by King Vidor, Ransom Rideout, Richard Schayer, Wanda Tuchock\nMusic by \tIrving Berlin\n\nMOVIE REVIEW:- Hallelujah (1929)\nSharecroppers Zeke and Spunk Johnson sell their part of the cotton crop for $100. Cheated out of the money by Zeke's girlfriend Chick (sixteen-year-old Nina Mae McKinney, in possibly her greatest role), in collusion with her gambling-hustler friends, Spunk is murdered in the ensuing brawl. Zeke runs away and reforms his life, becoming a minister.\n\nSometime later, he returns and preaches a rousing revival. Now engaged to a virtuous maiden named Missy (Victoria Spivey), he finds that Chick is still interested in him. She asks for baptism but is clearly not truly repentant. Tragically, Zeke throws away his new life for her. The film then cuts to Zeke's new life; he is working at a log mill and is married to Chick, who is secretly cheating on him with her old flame, Hot Shot (William Fountaine).\n\nWhen Chick and Hot Shot decide to cut and run just as Zeke finds out about the affair, Zeke follows after them. The carriage carrying both Hot Shot and Chick overturns, and Zeke catches up to them. Holding her in his arms, he watches Chick die as she apologizes to him for being unable to change her ways. Zeke then chases Hot Shot on foot. He stalks slowly through the woods and swamp while Hot Shot tries to run but continues to stumble until Zeke finally kills him. The film ends with Zeke returning to his family at the cotton crop after serving time in prison. His family is more than happy to welcome him back into the flock.\n\nHallelujah! was, for its time, an impressive achievement. Director King Vidor, anxious to make a &quot;personal&quot; project for the impersonal MGM studios, proposed to film a spiritual story set in the deep South with blacks as the main characters. The Texas-born Vidor was familiar with certain particulars of African-American life, having witnessed the mass baptisms and religious ceremonies of the employees of his father's lumber mills. MGM, concerned that it would lose the &quot;bigot trade,&quot; balked until Vidor offered to direct Hallelujah without salary. The decision to film on location was problematic: talking pictures had just come in, and the existing equipment was not ideally suited for exterior scenes. Vidor elected to film most of the picture silent, then post-dub the sound once he returned to the studio; with very few exceptions, the resulting synchronization (a &quot;maddening&quot; process, according to Vidor) was quite convincing. The plot may seem a trifle condescending in the light of heightened racial sensitivities (even the director admitted this), but in 1929 it was considered the ultimate in realism. Nina Mae McKinney plays a voluptuous young woman who disrupts the stability of a black sharecroppers' community. Daniel L. Haynes co-stars as an impressionable young man who is moved to manslaughter for the sake of McKinney. He is saved from himself when he embraces religion (hence the title). True to MGM's predictions, Hallelujah ran into resistance from southern exhibitors (and not a few northern ones), who were fearful that &quot;too many&quot; blacks would be attracted to their theatres. This problem was solved by a loose network of independent exhibitors who were willing to give the film a try; once the big-time theatre chain owners realized that the film would draw a mixed, rather than exclusively black, clientele, they were more receptive to the film. Still, Hallelujah was more a critical than a financial success\n\nTHE MUSIC of Hallelujah (1929)\nThe film gives, in some sections, a remarkably authentic representation of black entertainment and religious music in the 1920s, which no other film achieves. Unfortunately some of the sequences are rather Europeanised and over-arranged. For example, the outdoor revival meeting, with the preacher singing and acting out the 'Train to hell', is entirely authentic in style until the end, where he launches into the popular song 'Waiting at the End of the Road'. Similarly, an outdoor group of workers singing near the beginning of the film are saddled with a choral arrangement of 'Way Down upon the Swanee River' (written by Stephen Foster, who never went anywhere near the South) - no black workers would sing that!.\n\nThe best sequence (and one which is of vital importance in the history of classic jazz) is in the dancehall, where Nina Mae McKinney gives a stunning performance of Irving Berlin's 'Swanee Shuffle' - just the right sort of popular song; although actually filmed in a New York studio using black actors, the sequence gives an accurate representation of a low-life black dance-hall - part of the roots of classic jazz. Nothing else on film comes near this: most Hollywood films sanitized black music out of all recognition; and later, in the 1930s, when black artists began to show their real styles, jazz had moved on to become more sophisticated and the whole style of behaviour had changed. All this makes the film a unique document: and it's worth adding that the soundtrack throughout the film is a remarkable achievement, given the primitive equipment available at the time, with a much wider range of editing and mixing techniques than is generally thought to have been used so early on in talkies.\n\nSYNOPSIS:- Hallelujah (1929)\nZeke, a black tenant farmer, takes the family cotton crop to market and sells it for nearly one hundred dollars. Chick, a dance hall temptress, then uses her wiles to lure Zeke into a crap game with her lover, Hot Shot, who cheats Zeke out of his money with loaded dice. Zeke and Hot Shot fight, and Zeke gets possession of Hot Shot's gun, firing point blank into the crowd. The shot accidentally kills his younger brother, Spunk, and in repentance, Zeke becomes a preacher. He again meets Chick, and she gets religion, deserting Hot Shot to go with him. Zeke falls for Chick and jilts Missy Rose. Hot Shot returns, and the fickle Chick goes off with him. Zeke gives chase, and Chick is killed when Hot Shot's buggy overturns. Zeke then kills Hot Shot in a swamp, and, after serving time on the chain gang, returns home to the faithful Missy Rose.  \n\nTECHNICAL SPECIFICATIONS\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime 100 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 100 mins","torrent":{"xt":"urn:btih:510a8cac70df4a0fadb842582dd126aa6b50106e","amp;dn":"Hallelujah+%281929%29+Xvid+1cd+-+Classic+All+Black+Musical+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"510a8cac70df4a0fadb842582dd126aa6b50106e","infoHashBuffer":{"type":"Buffer","data":[81,10,140,172,112,223,74,15,173,184,66,88,45,209,38,170,107,80,16,110]},"announce":[],"urlList":[]}}