{"title":"John Mellencamp - Lonely Ol' Night [promo].VOB","uid":9340056,"size":268451840,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:54d3c79af927153bf14e234fc62ac24eaeaf68ae&amp;dn=John+Mellencamp+-+Lonely+Ol%27+Night+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1386913323,"description":"John Mellencamp - Lonely Ol' Night [promo].VOB\n\n\nHQ rare promo music video from a promo DVD. &quot;Lonely Ol' Night&quot; is a rock song written and performed by singer-songwriter John Mellencamp as John Cougar Mellencamp. It appeared on his 1985 album Scarecrow, and was released as a single, peaking at number 6 on the Billboard Hot 100. It also reached number 1 on the Top Rock Tracks chart, staying at the top spot for five weeks. \n\nThe title of &quot;Lonely Ol' Night&quot; was inspired by the 1963 film Hud starring Paul Newman, based on a book by Larry McMurtry. Mellencamp had seen the film many times as a young man, and its portrayal of Newman's character's strained relationship with his father affected Mellencamp deeply, inspiring many of his song ideas.\n\nThe video for &quot;Lonely Ol' Night&quot; was shot in and around Bloomington, Indiana. The wife of lyricist George Green, friend of Mellencamp's and co-writer of &quot;Hurts So Good&quot;, &quot;Crumblin' Down&quot; and &quot;Rain on the Scarecrow&quot;, appeared as Mellencamp's girlfriend in the video. According to the Mellencamp biography Born in a Small Town, Green's wife had told Mellencamp not to put &quot;pretty girls&quot; in the video, as it would be unrealistic to suggest their nights would be lonely; Mellencamp replied by offering her a role in the video.\n\nJohn Mellencamp, previously known by the stage names Johnny Cougar, John Cougar, and John Cougar Mellencamp, (born October 7, 1951) is an American rock singer-songwriter, musician, painter and occasional actor known for his catchy, populist brand of heartland rock that eschews synthesizers and other artificial sounds in favor of organic instrumentation. He has sold over 40 million albums worldwide and has amassed 22 Top 40 hits in the United States. In addition, he holds the record for the most tracks by a solo artist to hit number-one on the Hot Mainstream Rock Tracks chart, with seven, and has been nominated for 13 Grammy Awards, winning one. His latest album, No Better Than This, was released on August 17, 2010 to widespread critical acclaim.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Lonely_Ol'_Night&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Lonely_Ol'_Night&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/KaENCaaFd&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/KaENCaaFd&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 8000kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD LPCM, 16 bit]\n   Duration: 00:03:41\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.1\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:54d3c79af927153bf14e234fc62ac24eaeaf68ae","amp;dn":"John+Mellencamp+-+Lonely+Ol%27+Night+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54d3c79af927153bf14e234fc62ac24eaeaf68ae","infoHashBuffer":{"type":"Buffer","data":[84,211,199,154,249,39,21,59,241,78,35,79,198,42,194,78,174,175,104,174]},"announce":[],"urlList":[]}}