{"title":"TSSeduction--TS-34535 TS Jessy Dubai and Patrick Knight","uid":9300519,"size":2939518447,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:577f4e5c22e31db1a93ccf7e01b3f72f4b204bd9&amp;dn=TSSeduction--TS-34535+TS+Jessy+Dubai+and+Patrick+Knight&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1386232101,"description":"TsSeduction Bondage Switch Scene: First Him, Then Her, Then Him Again!\n\nDec 4, 2013 - Performers: TS Jessy Dubai   and  Patrick Knight \n\n\nMP4 and WMV + Pics.\n\n\nJessy Dubai is unstoppable. She is smokin hot, unbelievable seductive and so good at fucking she can cum and get hard again and fuck some more! \n\nIn this seduction scene, Jessy teases her co-worker getting him so riled up he obeys and follows her home after work. \n\nThey get to bed fast, clothes flying off, wild kissing, his hard cock out and in her hot mouth within minutes. She's so good at turning him on, it's like a steep slide with no return. Patrick lets Jessy tie him up because the way she is sucking his cock is like a trust tree hand shake. What could possibly go wrong with letting a total stranger tie you up? Nothing, expect now you must obey and take her cock in every hole she wants. \n\nJessy fucks her tied up man while he screams. She gags him with the pillow, she grinds deeply into his ass making him whale until his ass relaxes into her pounding. \n\nThe sex is so hot, Jessy decides to let Patrick tie her up. In a rare switch scene, Jessy tops from the bottom and cums all over herself and the rope as he fucks her ass. But it AIN'T over yet! Jessy is hard again within minutes and back fucking Patrick's ass until he explodes.\n\nScreens &lt;a href=&quot;\nhttp://www.tsseduction.com/site/shoot.jsp?shootId=34535&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tsseduction.com/site/shoot.jsp?shootId=34535&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:577f4e5c22e31db1a93ccf7e01b3f72f4b204bd9","amp;dn":"TSSeduction--TS-34535+TS+Jessy+Dubai+and+Patrick+Knight","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"577f4e5c22e31db1a93ccf7e01b3f72f4b204bd9","infoHashBuffer":{"type":"Buffer","data":[87,127,78,92,34,227,29,177,169,60,207,126,1,179,247,47,75,32,75,217]},"announce":[],"urlList":[]}}