{"title":"PC World USA 2013","uid":9311551,"size":246917944,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5a99f0b29ecc3037165adf2609660c0228035998&amp;dn=PC+World+USA+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sidmal","files":-1,"time":1386409712,"description":"PC World USA - Full Year 2013 Issues Collection\nEnglish | 12 Issues | All True PDF | 176.50 Mb\n\nPC World, stylized PCWorld, is a global computer magazine published monthly by IDG. It offers advice on various aspects of PCs and related items, the Internet, and other personal-technology products and services. In each publication, PC World reviews and tests hardware and software products from a variety of manufacturers, as well as other technology related devices such as still and video cameras, audio devices and televisions.\n\nThe current editor of PC World is Jon Phillips, formerly of Wired. In August 2012, he replaced Steve Fox, who had been editorial director since the December 2008 issue of the magazine. Fox replaced the magazine's veteran editor Harry McCracken, who resigned that spring, after some rocky times, including quitting and being rehired over editorial control issues in 2007.\n\nPC World is published under other names such as PC Advisor and PC Welt in some countries. PC World's company name is IDG Consumer &amp; SMB, and it is headquartered in San Francisco\n","torrent":{"xt":"urn:btih:5a99f0b29ecc3037165adf2609660c0228035998","amp;dn":"PC+World+USA+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a99f0b29ecc3037165adf2609660c0228035998","infoHashBuffer":{"type":"Buffer","data":[90,153,240,178,158,204,48,55,22,90,223,38,9,102,12,2,40,3,89,152]},"announce":[],"urlList":[]}}