{"title":"Shirley Hazzard - 3 Novels","uid":9351084,"size":1098298,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5ce4a9b83e0b9a6244498ef810401190fe337311&amp;dn=Shirley+Hazzard+-+3+Novels&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ZamKhan","files":-1,"time":1387123077,"description":"About Shirley Hazzard\n\nAuthor of fiction and non-fiction. Born in Australia, Shirley Hazzard now holds citizenship in Great Britain and the United States.\n\nHazzard was born in Sydney, Australia. In 1947 she traveled through Southeast Asia with her parents.\nHer diplomat father took her to Hong Kong, and then to New Zealand where her father was Australian Trade Commissioner. She travelled to Italy in 1956, and worked for a year in Naples. In 1963, Hazzard married the writer Francis Steegmuller, who died in 1994. As of 2006, she lives in New York City, frequently travelling to her Italian residence in Capri.\n\nShirley Hazzard won the National Book Critics Circle Award in 1980 for The Transit of Venus. In 2003 she won the National Book Award for The Great Fire.\n\n\nThe Transit of Venus\nThe Transit of Venus is considered Shirley Hazzard's most brilliant novel. It tells the story of two orphan sisters, Caroline and Grace Bell, as they leave Australia to start a new life in post-war England. What happens to these young women -- seduction and abandonment, marriage and widowhood, love and betrayal -- becomes as moving and wonderful and yet as predestined as the transits of the planets themselves. Gorgeously written and intricately constructed, Hazzard's novel is a story of place: Sydney, London, New York, Stockholm; of time: from the fifties to the eighties; and above all, of women and men in their passage through the displacements and absurdities of modern life.\n\nThe Great Fire\nThe year is 1947. The great fire of the Second World War has convulsed Europe and Asia. In its wake, Aldred Leith, an acclaimed hero of the conflict, has spent two years in China at work on an account of world-transforming change there. Son of a famed and sexually ruthless novelist, Leith begins to resist his own self-sufficiency, nurtured by war. Peter Exley, another veteran and an art historian by training, is prosecuting war crimes committed by the Japanese. Both men have narrowly escaped death in battle, and Leith saved Exley's life. The men have maintained long-distance friendship in a postwar loneliness that haunts them both, and which has swallowed Exley whole. Now in their thirties, with their youth behind them and their world in ruins, both must invent the future and retrieve a private humanity.\n\nArriving in Occupied Japan to record the effects of the bomb at Hiroshima, Leith meets Benedict and Helen Driscoll, the Australian son and daughter of a tyrannical medical administrator. Benedict, at twenty, is doomed by a rare degenerative disease. Helen, still younger, is inseparable from her brother. Precocious, brilliant, sensitive, at home in the books they read together, these two have been, in Leith's words, delivered by literature. The young people capture Leith's sympathy; indeed, he finds himself struggling with his attraction to this girl whose feelings are as intense as his own and from whom he will soon be fatefully parted.\n\nPeople in Glass Houses\nOnly those who keep their wit and affections about them will survive the mass conditioning of the Organization, where confusion solemnly rules and conformity is king. As in our world itself, humanity prevails in the courage, love, and laughter of singular spirits--of men and women for whom life is an adventure no Organization can quell, and whose souls remain their own.","torrent":{"xt":"urn:btih:5ce4a9b83e0b9a6244498ef810401190fe337311","amp;dn":"Shirley+Hazzard+-+3+Novels","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ce4a9b83e0b9a6244498ef810401190fe337311","infoHashBuffer":{"type":"Buffer","data":[92,228,169,184,62,11,154,98,68,73,142,248,16,64,17,144,254,51,115,17]},"announce":[],"urlList":[]}}