{"title":"EnigmaT Set Rips { Cuts } - December 10th, 2013","uid":9333350,"size":781469348,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5df53b64c4746bbaed8d45d9900297ff7f5fe91b&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+December+10th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"EnigmaT","files":90,"time":1386805559,"description":"Abhishek Y2v - Alistonia (Cut From Pledger Set)-enTc.mp3\nAfrojack - Musician (Original Mix) (Cut From Vegas Set)-enTc.mp3\nAimoon - The Light Side (Original Mix) (Cut From OzzyXPM Set)-enTc.mp3\nAlan Morris - Flashback 2003 (Original Mix) (Cut From A&amp;F Set)-enTc.mp3\nAlejandro Cesar &amp; Fher Vizzuett - Striking Life (Original Mix) (Cut From tranzLift Set)-enTc.mp3\nAlex Shevchenko - Dancing In The Rain (Original Mix) (Cut From Sty Set)-enTc.mp3\nAllen &amp; Envy vs Adam Deane - Anarchy (Cut From Devine Set)-enTc.mp3\nAllen &amp; Envy vs Adam Deane - Anarchy (Cut From Pledger Set)-enTc.mp3\nAllion - Seven Virtues (Original Mix) (Cut From Anna Lee Set)-enTc.mp3\nAllion - Seven Virtues (Original Mix) (Cut From Shah Set)-enTc.mp3\nAlpha Duo - Imperium (Set Rip)-enTc.mp3\nAPD &amp; Johnny Norberg - Ride Of Your Life (Cut From Tritonal Set)-enTc.mp3\nAPD &amp; Johnny Norberg - Ride Of Your Life (Original Mix) (Cut From Tritonal Set)-enTc.mp3\nArthur Volt - Broken Heart (Mike Rodas Rise Remix) (Cut From Sty Set)-enTc.mp3\nAspir - Clouds Float Away (Original Mix) (Cut From A&amp;F Set)-enTc.mp3\nAstral Projection - Mahadeva (Subtara Remix) (Cut From Katadunkass Set)-enTc.mp3\nAstuni - Before You Go (Original Mix) (Cut From Saux Set)-enTc.mp3\nAstuni - Follow Me (Original Mix) (Cut From Saux Set)-enTc.mp3\nAudiko - The Aeon (Original Mix) (Cut From Anna Lee Set)-enTc.mp3\nAzotti vs MalYar - Dew Point (Original Summer Mix) (Cut From Anna Lee Set)-enTc.mp3\nBeatsole - Air (Original Mix) (Cut From Saux Set)-enTc.mp3\nBorealnight - Frozen in a Blue Night (Intro Power Mix) (Cut From Edu NRG Set)-enTc.mp3\nCryostate - Believe (Festival Mix) (Cut From Del Mar Set)-enTc.mp3\nDave Leyrock - High Stakes (Original Mix) (Cut From Saux Set)-enTc.mp3\nDavey Asprey - Causality (Cut From Genix Set)-enTc.mp3\nDimitri Vegas &amp; Like Mike Vs. DVBBS &amp; Borgeous - Stampede (Salvatore Ganacci &amp; Garmiani Remix) (Cut From Vegas Set)-enTc.mp3\nDr. K &amp; NII VS. Shiha feat. Jan Johnston - Dangerous (Andres Sanchez &amp; Omar Sherif Uplifting Remix) (Cut From A&amp;F Set)-enTc.mp3\nElectribe - Trancemigration (David Surok Remix) (Cut From Sty Set)-enTc.mp3\nEleven.Five - Remind Me Again (meHiLove Remix) (Cut From Pledger Set)-enTc.mp3\nEstiva - Koalastrike (Original Mix) (Cut From Tritonal Set)-enTc.mp3\nEstiva - Tunababies (Cut From Tritonal Set)-enTc.mp3\nFrench Skies &amp; Stephane Badey - Imperium (Original Mix) (Cut From Edu NRG Set)-enTc.mp3\nGhost Stars - Stars Will Shine (Maison &amp; Dragen Remix) (Cut From Oakenfold Set)-enTc.mp3\nGTA - Bola (Original Mix) (Cut From R3HAB Set)-enTc.mp3\nHazem Beltagui Pres. Dark Sahara - Sirens (Original Mix) (Cut From A&amp;F Set)-enTc.mp3\nHolbrook &amp; Skykeeper - Mistigris (Cut From Pledger Set)-enTc.mp3\nI Am Legion - Choosing For You (Nightwatch Remix) (Cut From Vegas Set)-enTc.mp3\nIgor Dyachkov &amp; U-Jeen - Millenium (Original Mix) (Cut From Extravagance Set)-enTc.mp3\nIntomek - Tocame (Ally Brown Remix) (Cut From Saux Set)-enTc.mp3\nJaroslav Light - Soaring (Cut From Devine Set)-enTc.mp3\nJaroslav Light - Soaring (Original Mix) (Cut From Anna Lee Set)-enTc.mp3\nJesser - Celebrate The Life (Cut From Z3ke Set)-enTc.mp3\nJimi Frew - Jungle Khat (Original Mix) (Cut From R3HAB Set)-enTc.mp3\nJohan Vilborg - Mai Tai (Original Mix) (Cut From Tritonal Set)-enTc.mp3\nKyau &amp; Albert with Stoneface &amp; Terminal - We Own The Night (Aimoon Remix) (Cut From MORPH Set)-enTc.mp3\nLance Mathard &amp; DJ T.H. - Smile As A Gift (Original Mix) (Cut From D&amp;E Set)-enTc.mp3\nLekSin - Only You (Araya Remix) (Cut From A&amp;F Set)-enTc.mp3\nLence &amp; Pluton - Maybe Day (Cut From Pledger Set)-enTc.mp3\nLence &amp; Pluton - Maybe Day (Original Mix) (Cut From Oxide Set)-enTc.mp3\nLive City - Chakra (Cut From Bolier Set)-enTc.mp3\nLost Witness feat Danielle Simeone - Fall (Orbion Dub Mix) (Cut From Anna Lee Set)-enTc.mp3\nLost Witness feat. Danielle Simeone - Fall (Orbion Remix) (Cut From Pledger Set)-enTc.mp3\nMaas - Jaded (Original Mix) (Cut From Extravagance Set)-enTc.mp3\nMatt Darey &amp; MuseArtic - Reach For the Sun (Cut From Tritonal Set)-enTc.mp3\nMea Culpa - Spiritual Light (You Are My Salvation Remix) (Cut From Katadunkass Set)-enTc.mp3\nMell Tierra - Recipe (Original Mix) (Cut From Vegas Set)-enTc.mp3\nMERCER - Turn It Up (Tchami Remix) (Cut From Vegas Set)-enTc.mp3\nMike van Fabio - Complicity (Dave Cold Remix) (Cut From Saux Set)-enTc.mp3\nMiss Cortex &amp; Chryss Ruff - Lucky Strike (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nNianaro &amp; Upfly - Lifebuoy (Cut From Z3ke Set)-enTc.mp3\nNianaro &amp; Upfly - Lifebuoy (Original Mix) (Cut From Anna Lee Set)-enTc.mp3\nNicolaz feat. Angelika Vee - Riot (Wolfpack Remix) (Cut From Oakenfold Set)-enTc.mp3\nNom De Strip - I Can't Believe (Original Mix) (Cut From R3HAB Set)-enTc.mp3\nP.E.M vs Rafael Osmo - Drops (Original Mix) (Cut From Sherry Set)-enTc.mp3\nPaul Hided - In Search Of Serenity (Brian Flinn Remix) (Cut From Saux Set)-enTc.mp3\nPaul Hided - In Search Of Serenity (Brian Flinn Remix) (Cut From Sty Set)-enTc.mp3\nPaul Oakenfold &amp; Danny Howard feat. TC - Ready For Love (Carl Noren &amp; Swedish Egil Remix) (Cut From Oakenfold Set)-enTc.mp3\nRinkadink - Technology 2013 (Zyce &amp; Flegma Remix) (Cut From Bostock Set)-enTc.mp3\nRunning Man Pres. Inca - Till Your Heart Beats (Original Mix) (Cut From OzzyXPM Set)-enTc.mp3\nRyan Signett - Unity (Original Mix) (Cut From ReeVe Set)-enTc.mp3\nSebastien Benett - Diablo (Original Mix) (Cut From R3HAB Set)-enTc.mp3\nShowtek - We Like To Party (Original Mix) (Cut From Vegas Set)-enTc.mp3\nSimon Lee &amp; Alvin - SLAM (Cut From Tritonal Set)-enTc.mp3\nSteve Aoki &amp; R3hab - Flight (Original Mix) (Cut From R3HAB Set)-enTc.mp3\nSteve Aoki &amp; R3hab - Flight (Original Mix) (Cut From Vegas Set)-enTc.mp3\nStoneface &amp; Terminal &amp; Ana Criado - One Heart (Gal Abutbul Starlight Remix) (Cut From Criado Set)-enTc.mp3\nSunset &amp; Myk Bee - Summer Breeze (Manuel Rocca Remix) (Cut From OzzyXPM Set)-enTc.mp3\nSwanky Tunes - Jump, Shout, Make It Loud (Original Mix) (Cut From Vegas Set)-enTc.mp3\nThe Thrillseekers - When All Else Fails (Thrillseekers Club Mix) (Cut From A&amp;F Set)-enTc.mp3\nThe Thrillseekers feat. Fisher - The Last Time (Las Salinas Booty Mix) (Cut From Genix Set)-enTc.mp3\nThomas Gold feat. Kaelyn Behr - Remember (Leon Bolier Remix Bootleg) (Cut From Bolier Set)-enTc.mp3\nTom - Highway Red (P.H.A.T.T. Remix) (Cut From tranzLift Set)-enTc.mp3\nTonny Nesse - Indestructable (Original Mix) (Cut From Niki Set)-enTc.mp3\nTranzLift Pres. Stellarium - Tenebris Somnia (Mark Dreamer Remix) (Cut From tranzLift Set)-enTc.mp3\nTritonal - Now Or Never feat. Phoebe Ryan (Estiva &amp; Juventa Remix) (Cut From Tritonal Set)-enTc.mp3\nTritonal feat. Phoebe Ryan - Now Or Never (Estiva vs. Juventa Remix) (Cut From Tritonal Set)-enTc.mp3\nTuomas.L - Reaper (Original Mix) (Cut From Edu NRG Set)-enTc.mp3\nVictor Orange vs. Iversoon &amp; Alex Daf - The Day Before Tomorrow (Alekzander Remix) (Cut From tranzLift Set)-enTc.mp3\nWahlstedt &amp; Hugo Navy - Destroyers (Original Mix) (Cut From R3HAB Set)-enTc.mp3\nWolfgang Gartner - Piranha (Original Mix) (Cut From R3HAB Set)-enTc.mp3\n","torrent":{"xt":"urn:btih:5df53b64c4746bbaed8d45d9900297ff7f5fe91b","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+December+10th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5df53b64c4746bbaed8d45d9900297ff7f5fe91b","infoHashBuffer":{"type":"Buffer","data":[93,245,59,100,196,116,107,186,237,141,69,217,144,2,151,255,127,95,233,27]},"announce":[],"urlList":[]}}