{"title":"Rio Rita (1929) Xvid 1cd - Classic Musical Comedy Hit [DDR]","uid":9309732,"size":733902848,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5f1fc5a6e96e1706af8e9c73483dce98eea505ca&amp;dn=Rio+Rita+%281929%29+Xvid+1cd+-+Classic+Musical+Comedy+Hit+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SaM","files":-1,"time":1386387142,"description":"Rio Rita (1929) Xvid 1cd - Classic Musical Comedy Hit [DDR]\n\nRio Rita is a 1929 RKO Pictures musical comedy starring Bebe Daniels and John Boles along with the comedy team of Wheeler &amp; Woolsey. \nThe film is based on the 1927 stage musical produced by Florenz Ziegfeld, which originally united Wheeler and Woolsey as a team and made them famous. \nThe film was the biggest and most expensive RKO production of 1929, but it was also the studio's biggest box office hit until King Kong (1933).[\nIts finale was photographed in two-color Technicolor. \nRio Rita was chosen as one of the ten best films of 1929 by Film Daily.\n\nCAST:-\nBebe Daniels as Rita Ferguson\nJohn Boles as Capt. Jim Stewart\nBert Wheeler as Chick Bean\nRobert Woolsey as Ned Lovett\nDorothy Lee as Dolly Bean\nDon Alvarado as Roberto Ferguson\nGeorges Renavent as General Ravinoff\nHelen Kaiser as Mrs. Katie Bean\n\nMOVIE REVIEW:- Rio Rita (1929)\nBert Wheeler plays a New York bootlegger who comes to the Mexican town of San Lucas to get a divorce so he can marry Dolly (Dorothy Lee). After the wedding, Wheeler's lawyer, Robert Woolsey, informs Wheeler the divorce was invalid, and advises Wheeler to stay away from his bride.\n\nThe Wheeler-Woolsey plot is actually a subplot of the film, which stars Bebe Daniels (in her first &quot;talkie&quot;) as Rita Ferguson, a south-of-the-border beauty pursued by both Texas Ranger Jim Stewart (John Boles) and local warlord General Ravenoff (Georges Renavent). Ranger Jim is pursuing the notorious bandit Kinkajou along the Rio Grande, but is reluctant to openly accuse Rita's brother, Roberto (Don Alvarado), as the Kinkajou because he is in love with Rita.\n\nRavenoff successfully convinces Rita to spurn Ranger Jim on the pretext that Jim will arrest Roberto. Rita unhappily agrees to marry Ravenoff to prevent him from exposing Roberto as the Kinkajou. Meanwhile, Wheeler's first wife, Katie (Helen Kaiser), shows up to accuse him of bigamy, but conveniently falls in love with Woolsey.\n\nAt this point, the film switches into Technicolor. During the wedding ceremony aboard Ravenoff's private barge, Ranger Jim cuts the craft's ropes so that it drifts north of the Rio Grande. The Texas Rangers storm the barge, arrest Ravenoff as the real Kinkajou just in time to prevent the wedding, and Roberto is revealed to be a member of the Mexican Secret Service. Jim takes Rita's hand in marriage and Roberto escorts Ravenoff back to Mexico for trial.\n\nPRODUCTION NOTES:-\nWheeler and Woolsey were the only principals from the stage version to appear in the film. Based on the success of this film, Wheeler &amp; Woolsey were also given contracts to star in a series of comedies for Radio Pictures.\nThe film re-launched Bebe Daniels and John Boles into stardom and both of them starred in a number of musicals in the years following. They proved to be so popular with audiences of the day that they were both hired by RCA Victor to make a number of phonograph records.\nThe 1929 Rio Rita is a faithful rendering of the stage version of the show. It is one of the few films personally supervised by legendary showman Florenz Ziegfeld, who also produced the musical onstage. It is very likely that the film gives an accurate impression of what a Ziegfeld stage presentation was like.\nThe film earned an estimated profit of $935,000.\nThe 1942 Abbott &amp; Costello &quot;remake&quot; has little in common with this version.\nThe stage version of Rio Rita was seen by famous aviator Charles Lindbergh the night before his famous 1927 flight from New York to Paris.\n\nCapt. James Stewart pursues the bandit &quot;The Kinkajou&quot; over the Mexican border and falls in love with Rita. He suspects, that her brother is the bandit. \n\nTECHNICAL SPECIFICATIONS\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime 102 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 102 mins","torrent":{"xt":"urn:btih:5f1fc5a6e96e1706af8e9c73483dce98eea505ca","amp;dn":"Rio+Rita+%281929%29+Xvid+1cd+-+Classic+Musical+Comedy+Hit+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f1fc5a6e96e1706af8e9c73483dce98eea505ca","infoHashBuffer":{"type":"Buffer","data":[95,31,197,166,233,110,23,6,175,142,156,115,72,61,206,152,238,165,5,202]},"announce":[],"urlList":[]}}