{"title":"Ludovico Ariosto - Orlando Furioso (2 verse translations)","uid":9366389,"size":14351412,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5fcc84d8fbc1e49e32777c4d7b003f9027d92afd&amp;dn=Ludovico+Ariosto+-+Orlando+Furioso+%282+verse+translations%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"workerbee","files":-1,"time":1387420711,"description":"\nORLANDO FURIOSO (The Frenzy of Orlando) is an Italian epic poem in forty-six cantos by LUDOVICO ARIOSTO (1474-1533).  It won immediate fame upon its publication in 1516 and became one of the most influential works in the whole of European literature.  The poem remains an inspiration for writers to this day, including Osip Mandelstam, Italo Calvino, Jorge Luis Borges, and Salman Rushdie.\n\nThe action takes place against the background of the war between Charlemagne's Christian paladins and the Saracen army that is attempting to invade Europe.  Ariosto has little concern for historical or geographical accuracy, and the poem wanders at will from Japan to the Hebrides, as well as including many fantastical and magical elements (such as a trip to the moon, and an array of fantastical creatures including a gigantic sea monster called the orc, and the hippogriff).  Many themes are interwoven in its complicated episodic structure, but the most important plot is the paladin Orlando's unrequited love for the pagan princess Angelica, which develops into the madness of the title.  After this comes the love between the female Christian warrior Bradamante and the Saracen Ruggiero, who are supposed to be the ancestors of Ariosto's patrons, the d'Este family of Ferrara.\n\n\nThis torrent includes two modern verse translations: the Penguin Classics edition translated by Barbara Reynolds in 1975, and the more recent (abridged) translation by David Slavitt, published in 2009:\n\n* ORLANDO FURIOSO, Part I (Penguin Classics, 1975).  Translated by Barbara Reynolds. -- EPUB + MOBI\n\n* ORLANDO FURIOSO, Part II (Penguin Classics, 1977).  Translated by Barbara Reynolds. -- EPUB + MOBI\n\n* ORLANDO FURIOSO: A New Verse Translation (Harvard University Press, 2009).  Translated by David R. Slavitt. -- PDF\n","torrent":{"xt":"urn:btih:5fcc84d8fbc1e49e32777c4d7b003f9027d92afd","amp;dn":"Ludovico+Ariosto+-+Orlando+Furioso+%282+verse+translations%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fcc84d8fbc1e49e32777c4d7b003f9027d92afd","infoHashBuffer":{"type":"Buffer","data":[95,204,132,216,251,193,228,158,50,119,124,77,123,0,63,144,39,217,42,253]},"announce":[],"urlList":[]}}