{"title":"Mourning Beloveth - 6 albums FLAC+Cue","uid":9312926,"size":3432563255,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:604339107050001d8a83e6a25acddff495dcd765&amp;dn=Mourning+Beloveth+-+6+albums+FLAC%2BCue&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sidmal","files":-1,"time":1386428791,"description":"file format: FLAC+ Cue\nbitrate: Lossless\ngenre: Heavy Metal, Doom Metal\nCountry of origin: Ireland\n\nalbum list: \n2001- Dust\n2001(2006)-Dust\n2002- The Sullen Sulcus\n2005- A murderous Circus\n2008- A Disease For The Ages\n2013- Formless\n\nMourning Beloveth is an Irish doom metal band.\n\nMourning Beloveth were formed in the winter of 1992 and recorded their first untitled demo, entitled Debut, in 1996 with Darren Moore (vocals), Frank Brennan (guitar), Brian Delany (bass), and Tim Johnson (drums). The demo was recorded in only eight hours with Adrian Butler at the mixing desk. It contains two songs and is a raw indication of where Mourning Beloveth were leading to. Butler joined on bass soon after and Delany switched to guitar. This was the line-up that recorded the second demo Autumnal Fires in 1998.\n\nThe Autumnal Fires demo can be regarded as a 40 minute piece of music as the songs were intertwined with classical piano. It shows a huge progression in the writing and recording stakes. Mainly classified as doom/death metal, this was a step into achieving their sound, and it saw the integration of clean vocals. An extensive tour of Ireland followed being topped off by a support slot to Cathedral in May 1999. Over 1,200 copies of Autumnal Fires were sold.\n\nMourning Beloveth recorded their debut album Dust in Academy studios. After seven intense days, Dust was completed; recorded was sixty six minutes of doom metal harking back to the days of the early 1990s Doom/Death scene. Dust is a mixture of old and new songs and is very heavy and melancholic. The atmosphere and originality is helped by the greater usage of clean and growling vocals and the cleaner production. The strength of the material is helped by the fact that the same lineup has been together for five years at the time of recording Dust.\n\nIn March 2001, Mourning Beloveth played concerts with Cradle of Filth, which helped expose the band. Following this Mourning Beloveth hit all four corners of Ireland and gained many new fans along the way and even managed to play in Leeds, Bradford (UK).\n\nTowards the end of the summer 2001 and into the winter the writing process began for the new album. It was now February and they had eight songs written, six of which were finally chosen and recorded at Academy studios, again with Mags at the helm, from April 20 to May 5, 2002.\n\nThe Sullen Sulcus is a long listen that requires the usual Mourning Beloveth listening patience and obedience - with six songs clocking over 65 minutes. The album was released in December 2002 by Aftermath Music.\n\nSentinel Records from Ireland have re-released Dust with new artwork, a new song from the latest recording sessions and &quot;Forever Lost Emeralds&quot; (taken from the Autumnal Fires demo), all of which was remastered by Stuart Anstis. Also released by Sentinel is a split picture 7&quot; from Mourning Beloveth with Lunar Gate with one exclusive song, titled &quot;Part 1&quot; and it is limited to 300 copies.\n\nA European tour was completed and went from February 7, 2003 to 21st titled &quot;The Doomination of Europe&quot; in support of the new album and Mourning Beloveth were joined on the tour by Morgion (USA) and The Prophecy (UK). The tour started off in Ireland, travelled to the UK, France, Spain, Portugal, Belgium, Netherlands. Shortly thereafter, an American tour has also taken place in August 2003 for 24 dates with Morgion, The Prophecy and Orodruin.\n\nTheir third studio album is named A Murderous Circus. It was released in late March 2005. A limited edition contains two bonus tracks and four live tracks recorded in Vera, Groningen on a second CD. The album contains five songs lasting 75 minutes. They have strayed somewhat from the approach taken on their previous efforts and written simpler, bleaker and longer songs.\n\nIn November 2006 it was announced that Adrian left the band (due to a relocation to Spain) and was replaced by Brendan Roche. Adrian can still be contacted via his new company Lugga Music Productions.\n\nAlbum &quot;A Disease For The Ages&quot; was released in May 2008.\n\non December 31, 2009 Brian Delaney announced he has left the band and that Pauric Gallagher of the Irish Death/Doom band Decayor has replaced him. \n\n","torrent":{"xt":"urn:btih:604339107050001d8a83e6a25acddff495dcd765","amp;dn":"Mourning+Beloveth+-+6+albums+FLAC%2BCue","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"604339107050001d8a83e6a25acddff495dcd765","infoHashBuffer":{"type":"Buffer","data":[96,67,57,16,112,80,0,29,138,131,230,162,90,205,223,244,149,220,215,101]},"announce":[],"urlList":[]}}