{"title":"Background to Danger (1943) DVD5 - Classic Spy Thriller [DDR]","uid":9332173,"size":4201605120,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:6103c1aeccd4e44e749094c787ba8a29b85d516e&amp;dn=Background+to+Danger+%281943%29+DVD5+-+Classic+Spy+Thriller+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":-1,"time":1386788820,"description":"Background to Danger (1943) DVD5 - Classic Spy Thriller [DDR]\n\nBackground to Danger is a 1943 World War II spy film starring George Raft and featuring Brenda Marshall, Sydney Greenstreet, and Peter Lorre.\n\nBased on the novel of the same title by Eric Ambler and set in politically neutral Turkey (an atmospheric studio version), the screenplay was credited to W.R. Burnett, although William Faulkner also contributed. The movie was directed by Raoul Walsh.\n\nThe film was designed to capitalize on the runaway success of Casablanca, which had also featured Lorre and Greenstreet. The Russian operative positively portrayed by Brenda Marshall shows an exaggerated degree of cooperation, and the film has a slight pro-Soviet bias akin to Warners' Mission to Moscow from the same year. \n\n    CAST:- \n    George Raft as Joe Barton\n    Brenda Marshall as Tamara Zaleshoff\n    Sydney Greenstreet as Col. Robinson\n    Peter Lorre as Nikolai Zaleshoff\n    Osa Massen as Ana Remzi\n    Turhan Bey as Hassan\n    Willard Robertson as &quot;Mac&quot; McNamara\n    Kurt Katch as Mailler\n\n    Directed by Raoul Walsh\n    Produced by Jerry Wald\n    Written by W.R. Burnett, Eric Ambler (novel)\n\nMovie REVIEW:- Background to Danger (1943)\nIn 1942, Nazi Germany attempts to bring neutral Turkey into the war on its side by staging an assassination attempt on Franz von Papen, its own ambassador to the country. Much to the annoyance of Colonel Robinson (Sydney Greenstreet), von Pappen survives and the Russians his agent provocateur was trying to frame have solid alibis, forcing him to turn to another scheme to inflame Turkey's traditional rivalry with Russia.\n\nMeanwhile, American machinery salesman Joe Barton (George Raft) boards the Baghdad-Istanbul Express train at Aleppo and is attracted to another passenger, Ana Remzi (Osa Massen). She is worried about being searched by customs agents once they reach the Turkish border; she asks Joe to hold onto an envelope containing some securities, all that remains of her inheritance. Joe obliges, but when he later examines the envelope, he finds maps of Turkey with writing on them.\n\nWhen they stop in Ankara, he goes to her hotel to return her property, only to find she has been fatally wounded. He hides when someone else approaches the room. He watches unobserved as Soviet spy Nikolai Zaleshoff (Peter Lorre) searches the dead woman's luggage. Then, Joe exits through the window. Leaving the scene, he is seen by Tamara Zaleshoff (Brenda Marshall), Nikolai's sister and partner in espionage.\n\nThe Turkish police take Joe in for questioning, only it turns out that they are German agents. They take him to their leader, Colonel Robinson. Robinson wants the maps. Joe refuses to cooperate, and is taken away to be interrogated by Mailler (Kurt Katch). Before the Germans get very far, Joe is rescued by Nikolai.\n\nWhen the Zaleshoffs reveal that they are Soviet agents, Joe agrees to fetch them the documents. Unfortunately, he finds his hotel room has been ransacked and the documents stolen.\n\nJoe, it turns out, is also a spy (for the United States). When he reports to his boss, McNamara (Willard Robertson), he is assigned an assistant, Hassan (Turhan Bey).\n\nThe pair head to Istanbul. There, Robinson has bribed a newspaper publisher to print an article claiming that the documents are secret Russian plans for the invasion of Turkey. When Joe barges in by himself, he is quickly taken prisoner. The Zaleshoffs have also been captured. Joe and Tamara get away, but Nikolai is killed during the escape.\n\nJoe kidnaps a German embassy official and learns where Robinson has gone. Joe heads to the newspaper. There he forces the Nazi ringleader at gunpoint to burn the maps. Robinson is handed over to the Turkish police and then to his greatly displeased superior. He departs by airplane, knowing he is doomed for his failure. Joe and Tamara head to Cairo for their next assignments.\n\nSYNOPSIS:- Background to Danger (1943)\nEric Ambler's intriguing novel Uncommon Danger is brought down to a Republic serial level in Warner Bros.' Background to Danger. George Raft, who always seems miscast, plays an American undercover intelligence agent operating in Turkey. Sultry Osa Massen passes on some valuable secret papers to Raft just before she is killed. Our Hero then finds himself at the mercy of enemy agent Sidney Greenstreet, who knows that the papers contain Nazi plans to invade Turkey. Despite several brutal beatings, Raft and his cohorts Peter Lorre (a good guy for a change) and Brenda Marshall turn the tables on Greenstreet. Background to Danger was the first of many Warner Bros. follow-ups to the studio's megahit Casablanca; it's also the film wherein the prankish Peter Lorre stole George Raft's hat between takes--an affront that rankled the touchy Raft to his dying day\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4999 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime 80 mins\nSubtitles: Francais\nRipped by: Trinidad [DDR]\nDuration: 80 mins","torrent":{"xt":"urn:btih:6103c1aeccd4e44e749094c787ba8a29b85d516e","amp;dn":"Background+to+Danger+%281943%29+DVD5+-+Classic+Spy+Thriller+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6103c1aeccd4e44e749094c787ba8a29b85d516e","infoHashBuffer":{"type":"Buffer","data":[97,3,193,174,204,212,228,78,116,144,148,199,135,186,138,41,184,93,81,110]},"announce":[],"urlList":[]}}