{"title":"Bhakta Tukaram (1973) Telugu - MHCe DVD5 - No Subs [DDR]","uid":9360507,"size":4388474096,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:613659b96b86134235488cd06ac79ba9924d8eef&amp;dn=Bhakta+Tukaram+%281973%29+Telugu+-+MHCe+DVD5+-+No+Subs+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SaM","files":-1,"time":1387306677,"description":"Bhakta Tukaram (1973) Telugu - MHCe DVD5 - No Subs [DDR]\n\nBhakta Tukaram (Telugu) 1973 Telugu Biographical film produced by Anjali Pictures based on the life of saint poet Tukaram. Akkineni Nageswara Rao played the title role with great \n\ndevotion. The music score of P. Adinarayana Rao and songs of Ghantasala and others is one of the highest levels in Indian films.\n\nCAST:-\nAkkineni Nageshwara Rao ... Tukaram\nRamakrishna ... Lord Vishnu\nAnjali Devi ... Avali Bai\nShivaji Ganesan ... Sivaji\nKanchana ... Rukma Bai\nC. Nagabhushanam\nDhulipala Seetharama Sastry\nVanisree\nSakshi Ranga Rao\nBaby Sridevi\n\nDirector: V. Madhusudan Rao\nAssociate Director: G. C. Sekhar\nProducer: Anjali Devi\nOriginal Music: P. Adinarayana Rao\nLyricists: Devulapalli Krishna Sastry, C. Narayana Reddy, Veturi, Dasaradhi\nPlayback singers: Ghantasala Venkateswara Rao, V. Ramakrishna, S. P. Balasubrahmanyam, P. Susheela\n\nSongs are included in MP3s\nBhakta Tukaram 1973 Telugu 00. TItle Music and Screen Credits, P. Adinarayana Rao\nBhakta Tukaram 1973 Telugu 01. Ghana Ghana Sundaraa Karuna Rasa Mandiraa, Ghantasala, Devulapalli Krishna Sastry, P. Adinarayana Rao\nBhakta Tukaram 1973 Telugu 02. Kaliyugam Kaliyugam Kalushalaku Idi Nilayam, S. P. Balasubrahmanyam, Acharya Atreya, P. Adinarayana Rao\nBhakta Tukaram 1973 Telugu 03. Sari Sari Vagalu Telisera Gadasari, P. Susheela, C. Narayana Reddy, P. Adinarayana Rao\nBhakta Tukaram 1973 Telugu 04. Bhale Bhale Andalu Srustinchavu Ila Muripinchavu, Ghantasala, Veturi, P. Adinarayana Rao\nBhakta Tukaram 1973 Telugu 05. Short Song-1, Ghantasala, Veturi, P. Adinarayana Rao\nBhakta Tukaram 1973 Telugu 06. Unnaavaa Asalunnaavaa Unte Kallu Moosukunnavaa Ghantasala, Acharya Atreya, P. Adinarayana Rao\nBhakta Tukaram 1973 Telugu 07. Short Song-2, Ghantasala, Veturi, P. Adinarayana Rao\nBhakta Tukaram 1973 Telugu 08. Syamasundaraa-1, V. Ramakrishna, Dasarathi, P. Adinarayana Rao\nBhakta Tukaram 1973 Telugu 09. Chindulu Veeyakuraa, Ghantasala, Veturi Sundararamamurthy, P. Adinarayana Rao\nBhakta Tukaram 1973 Telugu 10. Manasuna Neeve Nilachinavela, V. Ramakrishna, Susheela, Dasarathi, P. Adinarayana Rao\nBhakta Tukaram 1973 Telugu 11. Panduranga Hari Hari, V. Ramakrishna, Veturi Sundararamamurthy, P. Adinarayana Rao\nBhakta Tukaram 1973 Telugu 12. Neeve Aadhidaivamu, V. Ramakrishna, Dasarathi, P. Adinarayana Rao\nBhakta Tukaram 1973 Telugu 13. Dhanyalakshmi Vachchinndhi, Susheela, Veturi Sundararamamurthy, P. Adinarayana Rao\nBhakta Tukaram 1973 Telugu 14. Padavelli Potondira, V.Ramakrishna, Atreya, P. Adinarayana Rao\nBhakta Tukaram 1973 Telugu 15. Padyams-1, Ghantasala, Veturi Sundararamamurthy, P. Adinarayana Rao\nBhakta Tukaram 1973 Telugu 16. Padyams-2, Ghantasala, Veturi Sundararamamurthy, P. Adinarayana Rao\nBhakta Tukaram 1973 Telugu 17. Padyams-3, Ghantasala, Veturi Sundararamamurthy, P. Adinarayana Rao\nBhakta Tukaram 1973 Telugu 18. Syamasundaraa-2, Susheela, Dasarathi, P. Adinarayana Rao\nBhakta Tukaram 1973 Telugu 19. Poojaku Velayara, Susheela, C. Narayana Reddy, P. Adinarayana Rao\nBhakta Tukaram 1973 Telugu 20. Panduranga Jai Jai Hari, Susheela, C. Narayana Reddy, P. Adinarayana Rao\nBhakta Tukaram 1973 Telugu 21. Naa Pilupu Vinaga Levaa, V. Ramakrishna, Dasarathi, P. Adinarayana Rao\nBhakta Tukaram 1973 Telugu 22. Karunaamaya Devaa, V.Ramakrishna, Dasarathi, P. Adinarayana Rao\nBhakta Tukaram 1973 Telugu 23. Padyams-4, Ghantasala, Veturi Sundararamamurthy, P. Adinarayana Rao\nBhakta Tukaram 1973 Telugu 24. Panduranga Naamam, V. Ramakrishna, Veturi, P. Adinarayana Rao\n\nMOVIE REVIEW:- Bhakta Tukaram (197) Telugu\nThe movie is based on the story of Tukaram. Tukaram (ANR) is a small time trader with two wives Rukma Bai and Avali Bai (Anjali Devi). Tukaram is however not interested in worldly matters and is always immersed in God. He is a fervent devotee of Panduranga, whose praises he sings daily. He faces a lot of problems because of his devotion. People take advantage of his nature, and cheat him. His family suffers, and his first wife Rukma dies of starvation during a famine. His family falls on hard times, and he questions the very existence of God. When he tries to commit suicide in despair, he experiences Divine Enlightenment, and becomes totally devoted to God. He starts writing kirtans or Abhangs devoted to the God. This is not liked by the orthodox priests, as he belonged to a lower caste. They make him throw all his work into the Indrayani river. When the river Goddess miraculously gives him back all his work, the people of the village are convinced of his divine nature. His fame spreads to such an extent, that even the great emperor Shivaji comes down to meet him.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4514 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 448kb/s CBR 48000 Hz\nAudio Streams: 6\nAudio Languages: Telugu\nRunTime: 2:48:07\nSubtitles: None\nRipped by: Trinidad [DDR]   \nDuration: 2:48:07","torrent":{"xt":"urn:btih:613659b96b86134235488cd06ac79ba9924d8eef","amp;dn":"Bhakta+Tukaram+%281973%29+Telugu+-+MHCe+DVD5+-+No+Subs+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"613659b96b86134235488cd06ac79ba9924d8eef","infoHashBuffer":{"type":"Buffer","data":[97,54,89,185,107,134,19,66,53,72,140,208,106,199,155,169,146,77,142,239]},"announce":[],"urlList":[]}}