{"title":"Borders Of Desire XXX DVDRip NEW (2013)","uid":9278605,"size":2234378134,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:613e33b20444c3cbc1413fcc5bce224c37146c18&amp;dn=Borders+Of+Desire+XXX+DVDRip+NEW+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"xuluhulu","files":1,"time":1385898192,"description":"Feature porn for couples! Not content to stay in a comfort zone, director Dana Vespoli constantly explores the outer edges of fetishism and sexual psychology. Her movies are ongoing Experiments leading to New Avenues of research. In Dana's adult DVD Borders Of Desire, the performer Kinky Goes on A Voyage of discovery Sensual That Awakens New appetites with Dana DeArmond, Misha Cross, and more. Documenting her trip to the International Sex Venus Show in Berlin, we Scenes Get two in California and two in Germany. spans The Action A range of perversity, from SM-flavored Anal Action to Public sex to Intimate Sapphic play. Through this journey, Dana bares her most personal feelings, bringing her fans close to the soul of her desires. Clad in high-heeled pumps and lacy bustiers, Dana and all-natural blonde beauty Natasha Voya engage in a sensual session of tame lesbian erotica. That is until STRAP-on-wielding Dana DeArmond and her friend Ramon Interrupt A Glamour shoot, turning it into Group A nasty scene That includes Bondage, Foot worship and Double-Anal Penetration! Next, Dana and pale, stunning Bree Daniels Redhead Enjoy A tender, orgasmic first lesbian date. Tanned, busty Polish MILF Sexy Susi and German superstud Steve Holmes suck and fuck in the backseat of a car, then take to a Berlin park for some lewd public ass fucking and blow jobbing that leads to a creamy oral cum shot. Finally, a POV-style three-way with Steve, Dana and brunette sweetheart Misha Cross leaves the director's face showered in sperm. &quot;Borders Of Desire&quot; is an adventure in the reality of pleasure.\n\nCOVERS:\n &lt;a href=&quot;\nhttp://www.imgnip.com/viewer.php?file=80025305344922298100.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imgnip.com/viewer.php?file=80025305344922298100.jpeg&lt;/a&gt;\n\n\nTHUMBSNAIL SCREENS:\n &lt;a href=&quot;\nhttp://www.imgnip.com/viewer.php?file=53733879066391600214.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imgnip.com/viewer.php?file=53733879066391600214.jpg&lt;/a&gt;\n\n\nCAST:\n\nBree Daniels, Dana DeArmond, Dana Vespoli, Misha Cross, Natasha Voya, Ramon Nomar, Sexy Susi, Steve Holmes\n\n\nSEED &amp; ENJOY!!!","torrent":{"xt":"urn:btih:613e33b20444c3cbc1413fcc5bce224c37146c18","amp;dn":"Borders+Of+Desire+XXX+DVDRip+NEW+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"613e33b20444c3cbc1413fcc5bce224c37146c18","infoHashBuffer":{"type":"Buffer","data":[97,62,51,178,4,68,195,203,193,65,63,204,91,206,34,76,55,20,108,24]},"announce":[],"urlList":[]}}