{"title":"Disney - Christmas Favorites Vol 2","uid":9308574,"size":50993046,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6263100ea85974dfb8b3d92d05dbbd9f6009a691&amp;dn=Disney+-+Christmas+Favorites+Vol+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1386364623,"description":"Source\n-\nDisney - Christmas Favorites Vol 2 320cbr (Big Papi) 1999 Childrens Christmas Music \n-\nBy christinemm\n\nThere are a variety of singing styles on this recording. Some are fast paced and others are slow and mellow. Somehow it doesn't flow well, the collection seems jumbled and awkward.\n\n&quot;Jingle Bells&quot; opens with a chorus sung by a toddler then goes into a chorus of children singing; it has a very fast tempo and is nerve-wracking. Rudolph the Reindeer is the &quot;revised&quot; version where there are additional lyrics such as &quot;all of the other reindeers used to laugh and call you names--like silly head&quot;, etc. Adults sing some songs in a serious manner, some are young children (with not-superior singing voices) singing solo, and others are sung by choruses of children. Some songs have dialogue by Santa and children mingled inside of each song in between verses. Some songs are fast paced and almost nerve-wracking while others are slow, quiet and purely classical in nature.\n\nI find that my children prefer the songs that are a fast tempo that are sung by the children while I like the quiet more classical songs sung by adults. The kids ask me to skip over the songs I enjoy and to repeat songs such as &quot;Jingle Bells&quot; a million times. I am still looking for a recording of popular songs such as &quot;Rudolph&quot; and &quot;Jingle Bells&quot; which are sung by adults and are just &quot;normal&quot; (vs. rock stars' personally stylized versions, country versions, zydego versions, etc.).","torrent":{"xt":"urn:btih:6263100ea85974dfb8b3d92d05dbbd9f6009a691","amp;dn":"Disney+-+Christmas+Favorites+Vol+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6263100ea85974dfb8b3d92d05dbbd9f6009a691","infoHashBuffer":{"type":"Buffer","data":[98,99,16,14,168,89,116,223,184,179,217,45,5,219,189,159,96,9,166,145]},"announce":[],"urlList":[]}}