{"title":"Flamingoes - Plastic Jewels [1996]","uid":9372012,"size":345523151,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:62aae3f5daf4c3ef8fd9e520ce049a81bc67194a&amp;dn=Flamingoes+-+Plastic+Jewels+%5B1996%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GenXRock","files":-1,"time":1387550674,"description":"The Flamingoes' debut, Plastic Jewels, is probably forever going to be known as &quot;the other record that uses the cover photo from the first Fountains of Wayne album.&quot; That picture, a Nick Waplington photo of a young boy wearing a towel cape and clutching a white rabbit while striking a superhero pose, coincidentally showed up on both albums, which were released within weeks of each other in the U.S. in the fall of 1996. (For the record, Waplington had licensed the photo to the Flamingoes first, and it graced the original 1995 U.K. release of this album.) It's a shame that Plastic Jewels didn't make the splash that Fountains of Wayne did, because it's every bit as good an album. Solid guitar-based Brit-pop in the style of Supergrass, the immediately catchy songs on Plastic Jewels are memorably hooky, with plenty of cool guitar riffs and chirpy background vocals that help to make up for the fact that neither Jude nor James Cook, the identical twin brothers (with nearly identical voices) who lead the trio, is much of a lyricist. However, lyrics aren't particularly important in this style of glam-influenced guitar pop -- not many complained about how dopey the Sweet's lyrics were -- and the trio's brash, rocking pop is instantly enjoyable regardless. Plastic Jewels is what Oasis always wanted to sound like but never quite managed. (4.5/5)","torrent":{"xt":"urn:btih:62aae3f5daf4c3ef8fd9e520ce049a81bc67194a","amp;dn":"Flamingoes+-+Plastic+Jewels+%5B1996%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62aae3f5daf4c3ef8fd9e520ce049a81bc67194a","infoHashBuffer":{"type":"Buffer","data":[98,170,227,245,218,244,195,239,143,217,229,32,206,4,154,129,188,103,25,74]},"announce":[],"urlList":[]}}