{"title":"Hardtied--Pussy Punishment Payback  Jeze Belle  OT High","uid":10248618,"size":2175100783,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:63581014208fbaf6cdc77c1f42ecdd858e749c24&amp;dn=Hardtied--Pussy+Punishment+Payback++Jeze+Belle++OT+High&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"merzedes","files":-1,"time":1401323304,"description":"\nPussy Punishment Payback | Jeze Belle | OT\n\nMay 28, 2014\n\n\nHigh MP4 only.\n\n\nThey say you should do on to others as you would have them do to you. Well, Jeze Belle did a very bad thing and she is about to get an object lesson in reciprocity. She tore poor Bella Rossi's pussy up. She finger fucked her so hard that she wasn't able to go on. Well, clearly we need to torture Jeze's poor cunt for a bit to let her know exactly what is wrong with that. \n\nWe aren't just unkind, we're downright brutal. It isn't just the constant penetration. Jeze has dealt with having her pussy full before. In fact, she loves it. Having that hole worked by fingers and dildos is one of her favorite things in life. But having it caned? Feeling the sting of a thin, wooden rod cracking sharply across her labia? That's more painful than she expected. It's almost more than she can handle. The pussy caning has two effects. First, Jeze is crying in seconds. Second, she is dripping wet, and almost as quickly. That's when O.T. attacks. He fucks her pussy relentlessly with a dildo while vibrating her clit with the Hitachi. There's no way he's going to let her cum yet, though. Orgasm denial is just another level of torment for her to endure. \n\nIt gets worse in the next position. She is tied to a pole like a fresh hunt being carried back to camp, her arms and legs lashed to the thing above her, as well as her nipple clamps. Her legs aren't spread very far but there is enough room to force the rubber cock between her moist lips and slide another vibrator against her clit. Again, she hasn't suffered enough to earn a release, though. \n\nShe doesn't get to cum until after her most strenuous rope bondage position. Her arms are bound to her waist so that she can't use them for support and she is laid face down on her chest. Her legs are pulled up behind her so that her entire weight is on her tits and her legs are spread wide. That's when the pussy whipping starts. If the caning stung the whipping is like having a trail of fire crack across her pussy. That is finally enough pain that O.T. gives Jeze Belle the orgasm she's been looking for, an explosion of ecstasy that leaves her panting and cum drunk on the floor, trying to get her bearings and reflecting on the lesson she just learned.  \n \nScreens &lt;a href=&quot;\nhttp://hardtied.com/hogtied/bondage/2014/05_28jbelle/Hardtied-Jeze-Belle-OT-Pussy-Punishment-Payback.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://hardtied.com/hogtied/bondage/2014/05_28jbelle/Hardtied-Jeze-Belle-OT-Pussy-Punishment-Payback.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n\n\n","torrent":{"xt":"urn:btih:63581014208fbaf6cdc77c1f42ecdd858e749c24","amp;dn":"Hardtied--Pussy+Punishment+Payback++Jeze+Belle++OT+High","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63581014208fbaf6cdc77c1f42ecdd858e749c24","infoHashBuffer":{"type":"Buffer","data":[99,88,16,20,32,143,186,246,205,199,124,31,66,236,221,133,142,116,156,36]},"announce":[],"urlList":[]}}