{"title":"Psycho-Sensory Integration Series (1993)","uid":9348515,"size":1499837408,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:66184f1872811adf3fef6ba36b17a57070442998&amp;dn=Psycho-Sensory+Integration+Series+%281993%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mulabr","files":13,"time":1387076060,"description":"This torrent contains the files:\n\n01.Psycho-Sensory Integration #1.flac\n\n01.Psycho-Sensory Integration #2.flac\n\n01.Psycho-Sensory Integration #3.flac\n\n01.Psycho-Sensory Integration #4.flac\n\n01.Psycho-Sensory Integration #5.flac\n\n01.Psycho-Sensory Integration #6.flac\n\nPsycho-Sensory Integration Series.txt\n\nand their 6 album images\n\n\nDESCRIPTION\n\nThis series of CDs was originally created based on requests and comments from psychotherapists and clinical hypnotherapists who were using other of our CDs clinically in their practices day-to-day. Out of this was born a new type of music and a new type of approach to pushing the envelope of inner health and emotional release. This was the creation of the concept of &quot;Non-Linear&quot; Music; music which does not follow the ordinary sequence of western musical expectations of chord changes leading to anticipated musical conclusions. We developed a type of music which appeared to stay right where it is and not go to expected musical conclusions - a &quot;Musical SoundScape&quot;, a relaxing environment of sound and music. This new type of ambient music, combined with brainwave entrainment in Theta (where emotional release takes place), plus &quot;Primordial Sounds&quot; to enhance an unconscious mind response, became a powerful new tool used by healers and therapists in 26 countries.\n\nThere are six separate PSI soundtracks of &quot;Non-Linear&quot; Music with Theta brainwave entrainment sound frequencies designed for emotional release and empathic bonding. The brainwave entrainment information on all six CD's is the same. The PSI Series has six different emotional &quot;MoodScapes&quot; for a variety of ways of balancing Mind/Body/Spirit.\n\n* Contains binaural beat frequencies. Do not drive or operate machinery while listening to this recording. While not imperative, headphones recommended for optimal results.\n\n\n\n\nPSI-PRO #1. CATHARTIC, HEALING TONES AND SOUNDS.\n\nThe various organs, bones and nerves of the body vibrate at certain frequencies. It has also been shown that brainwaves resonate at certain frequency levels when in certain states such as relaxation, meditation and healing.\n\nThese states assist the body in the healing process. By introducing these frequencies into the body and mind, they become healing tones and frequencies. Other 3-D recorded sounds which help are 3-D crickets, night sounds and bird sounds processed with mind-wave stimulation sound patterns.\n\nOn this recording we have used various tones moving in stereo space to stimulate regions of the right / left brain and computerized Sampled Zither Strings played in different octaves.\n\n\n\nPSI-PRO #2. FOR LOOSENING DEEP SEATED PSYCHOLOGICAL MATERIAL FROM THE SUBCONSCIOUS MIND.\n\nUses methods to bring the mind into deep relaxation and bring about &quot;entrainment&quot;, a non-invasive method that allows the person listening to remove blocks in thinking gently and effectively. NO hypnotism or subliminal methods are involved. This CD is useful for those with &quot;Brain Chatter&quot;, or who cannot get the mind to stop its constant dialog and be quiet. There are 25 layers of 3-D sounds all moving in different 3 dimensional directions to overpower the most active mind.\n\nSome of the specially processed sounds are Saturn's Rings, Jupiter/Saturn Plasma Sounds, Neptune Sounds. Piano string computer sampled and slowed to various octaves. 3-D Nature sounds and various cuts from Egg of Time, Child of a Dream and Isle of Skye speeded up and slowed down. Saturn's Rings, Jupiter/Saturn Plasma Sounds, Neptune Sounds. Piano string computer sampled and slowed to various octaves. 3-D Nature sounds.\n\n\n\nPSI-PRO #3. BEAUTIFUL, LYRICAL MELODIES, PEACEFUL HARMONY, DEEPLY RELAXING. \n\nThe best, most comprehensive recording for training the mind to recognize your conscious desire to enter into a relaxed state. Specific frequency patterns and &quot;entrainment&quot; are combined with other methods to bring about this effective way of training your mind..\n\nSome of the sounds and tones used are: Synthesized Lyrical Sounds and Lilting Melodies, 3-D Rain and Birds with Jupiter's moon IO faintly in background. For the Heart...\n\n\n\nPSI-PRO #4. VERY DEEP PSYCHO-ACTIVE SOUNDS.\n\nThis CD has deep frequencies and tones which resonate the physical body and is good for physical healing.\n\nSome of the sounds used to carry the frequencies are: Deep Synthesized Tones as melody. Overall Modulated Hemisphere Synchronization Tone in background of the entire piece. 3-D Birds in background, computer sampled and played as &quot;melody&quot; and Neptune Space Sounds. 3-D Birds in background, computer sampled and played as &quot;melody&quot; and Neptune Space Sounds.\n\n\n\nPSI-PRO #5. DEEPLY TRANCE-INDUCING AND DREAM/VISUALIZATION ENHANCING.\n\nCombines specifically designed frequency patterns, 3-dimensional surround-sound, unique tones, nature sounds, NASA Space Sounds from planets and moons in our Solar System, and music to create mental landscapes. A specially composed &quot;score&quot; combining alpha, beta, theta, and delta wave frequencies in patterns designed to bring you into the ultimate receptive state for deep relaxation and therapy while eliciting distinct emotional responses.\n\nThe frequency patterns are not noticeable as they are &quot;woven&quot; into the fabric of the each nature sound, tones, and the music that you hear. The PSI-PRO programs use specific techniques to evoke an entrainment response for optimal results.\n\nSome of the tones and sounds used along with music are: 3-D Steel wound string, computer sampled and played in different octaves multi-tracked 3-D Nature Sounds with brain-frequency stimulating sound patterns. 3-D Ocean Sounds and Space Sounds from Miranda, moon of Uranus, 3-D Steel-wound string, computer sampled and played in different octaves multi-tracked 3-D Nature Sounds with brain-frequency stimulating sound patterns. 3-D Ocean Sounds and Space Sounds from Miranda, moon of Uranus.\n\n\n\nPSI-PRO #6. ENHANCES DEEP LEVEL RELAXATION &amp; EMOTIONAL BALANCING. \n\n3-dimensional surround-sound, unique tones, nature sounds, NASA Space Sounds from planets and moons in our Solar System, and music to create mental landscapes.\n\nSpecially composed &quot;score&quot; combining alpha, beta, theta, and delta wave frequencies in patterns designed to bring you into the ultimate receptive state for deep relaxation and therapy while eliciting distinct emotional responses.\n\nThe frequency patterns are not noticeable as they are &quot;woven&quot; into the fabric of the each nature sound, tones, and the music that you hear. 3-D recordings of stream and birds from Blue Ridge Mountains, Virginia.\n\nThis whole recording has been slowed down one octave to enhance dream-like quality. Tibetan Bowl being struck like a gong, computer sampled and played octaves slower to approximate a 25 foot diameter bowl being struck. Tibetan Bowls computer sampled and played as instrument sounds for main melody on a keyboard and Uranus Space Sounds come and go in the background.","torrent":{"xt":"urn:btih:66184f1872811adf3fef6ba36b17a57070442998","amp;dn":"Psycho-Sensory+Integration+Series+%281993%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66184f1872811adf3fef6ba36b17a57070442998","infoHashBuffer":{"type":"Buffer","data":[102,24,79,24,114,129,26,223,63,239,107,163,107,23,165,112,112,68,41,152]},"announce":[],"urlList":[]}}