{"title":"Revolution.2012.S02E09.mp4","uid":9359100,"size":215075511,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6ab80ce1972f61b06458ceba2897aee24c075e33&amp;dn=Revolution.2012.S02E09.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ziggi1000","files":1,"time":1387271836,"description":"&quot;Everyone Says I Love You&quot;   November 20, 2013 \n\nMiles, Rachel, and Charlie move to rescue Aaron. They discover all the soldiers knocked out and Aaron and Cynthia gone. Following their escape route, they look in a fog shrouded forest, with the Patriots searching too. They are eventually joined by Monroe and follow the trail to a local high school. At the high school, Aaron wakes up next to Cynthia, alive and apparently healed from her injuries. He discovers a small boy who says he lives there. After Cynthia wakes up, she notes that she does not see the boy and it becomes apparent that the boy is a manifestation of the nanotech. The nanotech says it has been helping Aaron because he woke it up. The Patriots arrive at the high school just before Miles and company. A competing search begins for Aaron. In one room, Miles collapses from his arm infection and confesses his love for Rachel as Patriots burst in. Horn discovers Aaron fleeing and holds him at gunpoint. After Horn shoots dead Cynthia, the boy reappears. In his grief, Aaron requests that the boy kill all the Patriots in the school. He complies, but wonders why Aaron did not ask for Cynthia to be healed. The boy is confused about the conflicting requests and vanishes, leaving Cynthia dead and Aaron alone. Neville boards a train bound for Washington D.C. with Jason and Commander Allenford. They are headed for the White House. His wife boards the train too, although she is newly married. After reuniting, they conspire to greater political ambitions.\n \n","torrent":{"xt":"urn:btih:6ab80ce1972f61b06458ceba2897aee24c075e33","amp;dn":"Revolution.2012.S02E09.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ab80ce1972f61b06458ceba2897aee24c075e33","infoHashBuffer":{"type":"Buffer","data":[106,184,12,225,151,47,97,176,100,88,206,186,40,151,174,226,76,7,94,51]},"announce":[],"urlList":[]}}