{"title":"Neil Lochery - Lisbon: War in the Shadows of the City of Light,","uid":9399980,"size":245022714,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6b3b439bd3db59d399928e2fcde7a4e6f085a29c&amp;dn=Neil+Lochery+-+Lisbon%3A+War+in+the+Shadows+of+the+City+of+Light%2C+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":null,"files":1,"time":1388055840,"description":"Lisbon: War in the Shadows of the City of Light, 1939 - 1945\n English | 8 hrs 35 mins | ISBN-10: 1455122009 | MP3 64 kbps | 233.67 MB\n Genre: AudioBook Throughout the Second World War, Lisbon was at the very center of the world's attention and was the only European city in which both the Allies and the Axis powers openly operated. Portugal was frantically trying to hold on to its self-proclaimed wartime neutrality but in reality was increasingly caught in the middle of the economic, and naval, wars between the Allies and the Nazis. The story is not, however, a conventional tale of World War II in that barely a shot was fired or a bomb dropped. Instead, it is a gripping tale of intrigue, betrayal, opportunism, and double-dealing, all of which took place in the Cidade da Luz and along its idyllic Atlantic coastline. It is the story of how a relatively poor European country not only survived the war physically intact but came out of it in 1945 much wealthier than it had been when war broke out in 1939. Portugal's emergence as a prosperous European Union nation would be financed in part, it turns out, by a cache of Nazi gold.\n\n During the war, Lisbon was a temporary home to much of Europe's exiled royalty, over one million refugees seeking passage to the US, and to a host of spies, secret police, captains of industry, bankers, prominent Jews, writers and artists, escaped POWs, and black marketeers. An operations officer writing in 1944 described the daily scene at Lisbon's airport as being like the movie Casablanca--but twenty-fold. In truth, Lisbon was the real Casablanca of the war, complete with refugees; British, German, Italian, and American spies; and the Portuguese secret police watching every move.\n\n In this riveting narrative, renowned historian Neill Lochery draws on his relationships with high-level Portuguese contacts, records recently uncovered from Portuguese secret police and banking archives, and other unpublished documents to offer a revelatory portrait of the war's backstage.\n &lt;a href=&quot;\nhttp://buspic.com/img/file13879922191.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://buspic.com/img/file13879922191.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:6b3b439bd3db59d399928e2fcde7a4e6f085a29c","amp;dn":"Neil+Lochery+-+Lisbon%3A+War+in+the+Shadows+of+the+City+of+Light%2C+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b3b439bd3db59d399928e2fcde7a4e6f085a29c","infoHashBuffer":{"type":"Buffer","data":[107,59,67,155,211,219,89,211,153,146,142,47,205,231,164,230,240,133,162,156]},"announce":[],"urlList":[]}}