{"title":"Robin Clark - Meaningful Games. Exploring Language with Game The","uid":10245828,"size":2505298,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6c212df881aba7e56dc84060cc70b10f64481c77&amp;dn=Robin+Clark+-+Meaningful+Games.+Exploring+Language+with+Game+The&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Anette14","files":-1,"time":1401294959,"description":"Description\nProduct Details\nBook Title: Meaningful Games: Exploring Language with Game Theory\t\nBook Author: Robin Clark\nHardcover: 376 pages\nPublisher: The MIT Press (November 18, 2011)\nLanguage: English\nISBN-10: 0262016176\nISBN-13: 978-0262016179\n\n===================================================================================\nBook Description\nPublication Date: November 18, 2011 | ISBN-10: 0262016176 | ISBN-13: 978-0262016179\nIn Meaningful Games, Robin Clark explains in an accessible manner the usefulness of game theory in thinking about a wide range of issues in linguistics. Clark argues that we use grammar strategically to signal our intended meanings: our choices as speaker are conditioned by what choices the hearer will make interpreting what we say. Game theory--according to which the outcome of a decision depends on the choices of others--provides a formal system that allows us to develop theories about the kind of decision making that is crucial to understanding linguistic behavior. Clark argues the only way to understand meaning is to grapple with its social nature--that it is the social that gives content to our mental lives. Game theory gives us a framework for working out these ideas. The resulting theory of use will allow us to account for many aspects of linguistic meaning, and the grammar itself can be simplified. The results are nevertheless precise and subject to empirical testing. Meaningful Games offers an engaging and accessible introduction to game theory and the study of linguistic meaning. No knowledge of mathematics beyond simple algebra is required; formal definitions appear in special boxes outside the main text. The book includes an extended argument in favor of the social basis of meaning; a brief introduction to game theory, with a focus on coordination games and cooperation; discussions of common knowledge and games of partial information; models of games for pronouns and politeness; and the development of a system of social coordination of reference.\n\n===================================================================================\nReviews\n&quot;Language is the glue of human interaction. This book presents language as a fairground of many interlocking games, all defined precisely, that make sense of what we say and mean. Doing so transforms linguistics as we know it.&quot; -- Johan van Benthem, University Professor of Pure and Applied Logic, University of Amsterdam, and Henry Waldgrave Stuart Professor of Philosophy, Stanford University\n\n&quot;The lack of common language between linguists and game theorists has made applying game theory thinking to pragmatics quite frustrating. Here is a linguist who has built a bridge between the two fields. A beautifully written book, a treasure of ideas for further research.&quot; -- Ariel Rubinstein, Professor of Economics, Tel Aviv University and New York University\n\n===================================================================================\nAbout the Author\nRobin Clark is Associate Professor in the Department of Linguistics at the University of Pennsylvania.\n===================================================================================","torrent":{"xt":"urn:btih:6c212df881aba7e56dc84060cc70b10f64481c77","amp;dn":"Robin+Clark+-+Meaningful+Games.+Exploring+Language+with+Game+The","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c212df881aba7e56dc84060cc70b10f64481c77","infoHashBuffer":{"type":"Buffer","data":[108,33,45,248,129,171,167,229,109,200,64,96,204,112,177,15,100,72,28,119]},"announce":[],"urlList":[]}}