{"title":"Alex Jones Show - 2013 Dec 18 WE [sebaygo1]","uid":9365726,"size":67287930,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:6d3c9af0149da5dbd106ddd820249cfae4c269e6&amp;dn=Alex+Jones+Show+-+2013+Dec+18+WE+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":12,"time":1387409555,"description":"\nThe Alex Jones Show \nWednesday, 18 December 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On this Wednesday, December 18 edition of The Alex Jones Show, Alex covers the latest effort by corporate medicine and the establishment media to discredit and disparage the efficacy of vitamin supplements as the war on the health of the American people continues. \n\nAlex takes a look at comments by a former top NSA official who recently declared the United States is now effectively a police state and said the Stasi surveillance grid is not only for political crimes of those opposed to the bankster regime in control of government, but is also designed to facilitate the wholesale prosecution of petty crimes related to drugs and taxes. \n\nGuests today include anarcho-capitalist author and editor, Lew Rockwell, who is the founder of the founder and chairman of the Ludwig von Mises Institute. \n\nAlex also talks with Pennsylvania resident Ricardo Nieves, who went before the Reading city council to complain about the constitutional abuse conducted by local cops in collaboration with a private firm financed by a number of federal agencies stopping motorists and attempting to intimidate them into surrendering a DNA swab.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n\n It is my opinion that in this time it is virtually\n essential to seek information from a variety of sources, \n to listen to a spectrum of voices in order to better \n understand the &quot;big picture.&quot; A reliance solely upon\n mainstream corporate media for news and info is a \n prescription for ignorance. I try to share information\n that counters the monotone of mainstream corporate media.\n \n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents. \n\n Think for yourself!\n To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n\n !! please try some of the other shows I upload too !!\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.","torrent":{"xt":"urn:btih:6d3c9af0149da5dbd106ddd820249cfae4c269e6","amp;dn":"Alex+Jones+Show+-+2013+Dec+18+WE+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d3c9af0149da5dbd106ddd820249cfae4c269e6","infoHashBuffer":{"type":"Buffer","data":[109,60,154,240,20,157,165,219,209,6,221,216,32,36,156,250,228,194,105,230]},"announce":[],"urlList":[]}}