{"title":"Sexually Broken--Casey Calvert bound, manhandled,by 2 big dicks ","uid":9309501,"size":1656659715,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:6d42b290f3ef9571eddd12fc9651f74fc0d39667&amp;dn=Sexually+Broken--Casey+Calvert+bound%2C+manhandled%2Cby+2+big+dicks+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"merzedes","files":-1,"time":1386381615,"description":"Casey Calvert gets bound, manhandled, worked over by 2 big dicks with rough deep throating &amp; orgasms | Casey Calvert | Matt Williams\n\nDecember 6, 2013\n\n\nHigh and Low bitrate MP4 + Pics.\n\n\nSuper adorable Casey Calvert is back and doing what she does best: Bondage and Rough sex. This amazing girl has all the right stuff, beauty, toughness, and a love of hard, nasty, punishing sex. Having a repressed gag reflex also helps.\n\nCasey starts with a blindfold, her arms tightly bound to her thighs with four strand Bavarian hemp rope. Casey's perfect natural breasts are squished with rope and she is on her knees awaitng her sexual fate. Two hard cocks are about to wreck her world and blast her brain into sub space.\n\nThe first cock to press its way into Casey's hot little mouth and down her throat happens to be 10 inches of black thunder. Casey endures some brutal face fucking from two cocks back and forth. We control when she gets air and how much with our hard cocks. It doesn't take long until Casey is dazed, coated with spit and helpless to anything we have in store for her.\n\nAfter some impressive deep throating we bend little Casey over a padded stool and fuck her upside down face. Her legs are brought up and soon Casey is getting deeply fucked from both ends while still helplessly bound. The fucking and deep throating is Brutal. We push Casey to her sexual limits and then we push her farther. From both ends, back and forth the cocks slide deep into Casey's holes, cum drips out her pussy, and deep throat spit covers her entire face. Her eyes are glazed over and empty, her brain has checked out as orgasms and lack of air turn Casey into a moaning, grunting sex Zombie. All Casey can do is cum and moan.\n\nIn the end Casey is deep in subspace, bent back, and on her tip toes, ankles tied back to her neck rope. She can't move at all, drool continues to drip from her open mouth as her eyes stare off into nothingness.... \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2013/12_06ccalvert5/SexuallyBroken-Casey-Calvert-Matt-Williams-Casey-Calvert-gets-bound-manhandled-worked-over-by-2-big-dicks-with-rough-deep-throating--orgasms.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2013/12_06ccalvert5/SexuallyBroken-Casey-Calvert-Matt-Williams-Casey-Calvert-gets-bound-manhandled-worked-over-by-2-big-dicks-with-rough-deep-throating--orgasms.php&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:6d42b290f3ef9571eddd12fc9651f74fc0d39667","amp;dn":"Sexually+Broken--Casey+Calvert+bound%2C+manhandled%2Cby+2+big+dicks+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d42b290f3ef9571eddd12fc9651f74fc0d39667","infoHashBuffer":{"type":"Buffer","data":[109,66,178,144,243,239,149,113,237,221,18,252,150,81,247,79,192,211,150,103]},"announce":[],"urlList":[]}}