{"title":"The Guardian Weekly 13/12/13 PDF","uid":9339730,"size":3915804,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6d712dde2a1c88123d207d68b22159de36c6818f&amp;dn=The+Guardian+Weekly+13%2F12%2F13+PDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sidmal","files":-1,"time":1386905557,"description":"The Guardian Weekly from Friday, 13. December 2013\n True PDF | 4 MB | 48 Pages | English\n\nThe Guardian is a British national daily newspaper. Founded in 1821, it was known as The Manchester Guardian until 1959. Throughout its history, it has grown from a local paper to a national paper associated with a complex organisational structure and an international multimedia and web presence. The Guardian is currently edited by Alan Rusbridger. Its sister papers include The Observer (a British Sunday paper) and The Guardian Weekly. It has two online outlets based outside the United Kingdom, Guardian Australia and Guardian US.\n\nIn August 2013, The Guardian in paper form had an average daily circulation of 189,000 copies, behind The Daily Telegraph and The Times, but ahead of The Independent.[3] The newspaper's online edition was the third most widely read in the world as of June 2012.[4] Its combined print and online editions reach nearly 9 million readers.[5]\n\nFounded in 1821 by John Edward Taylor in Manchester, the 11 members of the first Little Circle excluding William Cowdroy, Jnr. of the Manchester Gazette decided to advance their liberalist agenda. They helped then cotton merchant John Edward Taylor form the Manchester Guardian, which he edited for the rest of his life and they all wrote for. With backing from the non-conformist Little Circle group of local businessmen, The Manchester Guardian replaced the radical Manchester Observer, which championed the Peterloo Massacre protesters. The paper currently identifies with social liberalism. In the last UK general election in 2010, the paper supported the Liberal Democrats, who went on to form a coalition government with the Conservatives. The paper is influential in the design and publishing arena, sponsoring many awards in these areas.\n\nThe Guardian has changed format and design over the years, moving from broadsheet to Berliner. It has become an international media organisation with affiliations to other national papers with similar aims. The Guardian Weekly, which circulates worldwide, contains articles from The Guardian and its sister Sunday paper The Observer, as well as reports, features, and book reviews from The Washington Post and articles translated from Le Monde. Other projects include GuardianFilm, the current editorial director of which is Maggie O'Kane.\n\nRecent notable scoops include the newspaper's breaking of the News International phone hacking scandal in 2011, particularly with the revelation of the hacking of murdered teenager Milly Dowler's phone.[6] The investigation brought about the closure of one of the highest circulation newspapers in the world, the News of the World.[7] The newspaper also broke news of the secret collection of Verizon telephone records held by Barack Obama's administration in June 2013,[8] and subsequently revealed the existence of the PRISM surveillance program after it was leaked to the paper by NSA whistleblower Edward Snowden\n","torrent":{"xt":"urn:btih:6d712dde2a1c88123d207d68b22159de36c6818f","amp;dn":"The+Guardian+Weekly+13%2F12%2F13+PDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d712dde2a1c88123d207d68b22159de36c6818f","infoHashBuffer":{"type":"Buffer","data":[109,113,45,222,42,28,136,18,61,32,125,104,178,33,89,222,54,198,129,143]},"announce":[],"urlList":[]}}