{"title":"Bates Motel Season 2","uid":10244494,"size":10174623737,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6de8be2992bc1b009916827f8f2c2f387b8b11eb&amp;dn=Bates+Motel+Season+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rukin2","files":-1,"time":1401287099,"description":"Welcome to my torrent!\nS02E01- Gone But Not Forgotten\nNorma's anxiety builds as the bypass is ahead of\nschedule. Norman obsesses on Miss Watson's death\nand Bradley's search for father's killer leads to extremes.\nAired: 3/3/2014\n\nS02E02- Shadow Of A Doubt\nIn too deep, Bradley turns to Norman for help.\nNorma vies for Norman's attention by having him\njoin a play. Dylan is cautious of a new member.\nAired:3/10/2014\n\nS02E03- Caleb\nNorma is disappointed to learn that she didn't get\na part in the community play. She makes a new\nfriend however in Christine Heldens who was\nsupposed to direct the play but quit when Norma\ndidn't get the lead. She invites Norma to a party\nand is introduced to new people including\nChristine's brother George. She also meets Nick\nwho tells her he too is against the bypass. With\nBradley Martin now believed to have committed\nsuicide, Emma organizes a memorial at the beach\nbut things don't quite go as planned. Norma is\nshattered when her brother Caleb appears\nunannounced.\nAired:3/17/2014\n\nS02E04- Check-Out\nAfter the revelations, Dylan gets drunk and\npasses out in his car. Caleb denies being his\nfather and returns the money Dylan gave him.\nDylan again confronts Norma and she admits she\nnever told anyone, least of all Caleb, who his\nfather was. An outraged Norman, again goes into\nacting out as his mother and visits Caleb at his\nmotel. It's the morning after the night before\nfor Emma who wakes up in bed with the boy she met\nat the beach party. Sheriff Romano warns Zane to\ntake it easy or that there will be repercussions.\nSoon after, Romano finds that his house has gone\nup.\n\nAired:3/24/2014\n\nS02E05- The Escape Artist\nNorman trusts Cody with a family secret. Dylan\nfinds himself fighting for his life as Zane's\ndrug war escalates. Norma makes a deal with a\nmysterious man to help stop the bypass while\nNorman faces some of his childhood demons.\nAired:3/31/2014\n\nS02E06- Plunge\nNorma works to get appointed to the council.\nNorman tries to get a drivers license while\ndealing with an incident concerning Cody and\nEmma. Dylan finally gets to know his boss.\nAired:4/7/2014\n\nS02E07- Presumed Innocent\nNorman questions Norma's faith in him. Zane's\nthirst for revenge threatens Dylan. Romero's\npresented with new evidence that may change the\ncourse of Miss Watson's murder investigation.\nCody's friendship with Norman reaches a breaking\npoint.\nAired:4/14/2014\n\nS02E08- Meltdown\nRomero digs for the truth behind Miss Watson's\nmurder, while the war between the drug families\npresents Dylan with an impossible choice. Norman\npushes Norma away when she won't tell him the\ntruth about his blackouts.\nAired:4/21/2014\n\nS02E09- The Box\nNorma returns home in the early morning to find\nthat Norman's bed hasn't been slept in. She soon\ngets a call from Nick Ford who says that he has\nNorman and if she wants to see him alive, she has\nto get Dylan to do what he asked: kill Zane\nMorgan. When Dylan is unable to do so he decides\nto inform Ford personally. Norman meanwhile is\nbeing kept in a metal box in the middle of\nnowhere and recalls a bit of what happened the\nnight Miss Watson died. Sheriff Romero asks his\nfather's ex-partner, Declan Rogers, to conduct a\nlie detector test on Norman.\nAired:4/28/2014\n\nS02E10- The Immutable Truth\nWith Nick Ford dead, Dylan and Sheriff Romero\nrescue Norman. Together, they set a trap for Zane\nMorgan. Now safe at home, Norman tells his mother\nhe's recalled killing Miss Watson but Norma\nrefuses to believe him insisting that it can't be\ntrue. Romero has scheduled the polygraph test\nwhich nearly sends Norma over the edge. Convinced\nthat Norman will be found out, her plan is to\nflee but Dylan intervenes. Norman is\ncontemplating another way out however.\nAired:5-5-2014\n\nVideo:\nCodec: H264 - MPEG-4 AVC (part 10) (avc1)\nResolution: 1280x720\nFrame rate: 23.976023\nDecoded format: Planar 4:2:0 YUV\n\nAudio:\nChannels: 3F2R/LFE\nSample rate: 48000 Hz\n\n\nThank you for downloading my torrent!! :)\nI hope you appreciate it And love what I have for you!\nHere's my website :)\nwww.rukin1.org\nDon't be shy :) Have a good day, happy seeding!","torrent":{"xt":"urn:btih:6de8be2992bc1b009916827f8f2c2f387b8b11eb","amp;dn":"Bates+Motel+Season+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6de8be2992bc1b009916827f8f2c2f387b8b11eb","infoHashBuffer":{"type":"Buffer","data":[109,232,190,41,146,188,27,0,153,22,130,127,143,44,47,56,123,139,17,235]},"announce":[],"urlList":[]}}