{"title":"Hans Kung - Does God Exist? (pdf)","uid":10241728,"size":11708007,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:709a343f1f09bcaa3f754888a743be472e6dcedd&amp;dn=Hans+Kung+-+Does+God+Exist%3F+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pharmakate","files":-1,"time":1401250310,"description":"Hans Kung - Does God Exist? An Answer for Today (Crossroad, 1978). 839 pp. \n\nNew scan. Searchable pdf (clearscan) with contents linked in bookmarks, accurate pagination, metadata, etc. (There exists another scan of this book, but it's of poor quality and I was unable to fix it adequately. So I made a completely new scan.)\n\n\nExcellent, massive book on God's existence by the infamous liberal Catholic theologian, first published in German in 1978. It expands the discussion considerably beyond the sterile debate we see so often today.\n\n\ndescription:\n\nDoes God exist? The question implies another: Who is God? This book is meant to give an answer to both questions and to give reasons for this answer. Does God exist? Yes or no? Many are at a loss between belief and unbelief; they are undecided, skeptical. They are doubtful about their belief, but they are also doubtful about their doubting. There are still others who are proud of their doubting. Yet there remains a longing for certainty. Certainty? Whether Christians or Jews, believers in God or atheists, the discussion today runs right across old denominations and new ideologies - but the longing for certainty is unquenched. Does God exist? We are putting all our cards on the table here. The answer will be &quot;Yes, God exists.&quot; As human beings in the twentieth century, we certainly can reasonably believe in God - even more so in the Christian God - and perhaps even more easily today than a few decades or centuries ago. For, after so many crises, it is surprising how much has been clarified and how many difficulties in regard to belief in God have melted into the Light that no darkness has overcome.\n\n-----\n\n\nHans Kung's On Being a Christian is here: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8161300&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8161300&lt;/a&gt;","torrent":{"xt":"urn:btih:709a343f1f09bcaa3f754888a743be472e6dcedd","amp;dn":"Hans+Kung+-+Does+God+Exist%3F+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"709a343f1f09bcaa3f754888a743be472e6dcedd","infoHashBuffer":{"type":"Buffer","data":[112,154,52,63,31,9,188,170,63,117,72,136,167,67,190,71,46,109,206,221]},"announce":[],"urlList":[]}}