{"title":"Lord of the Rings - Extended Edition - Directors Cut","uid":9338991,"size":11182588161,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:7348aa7f54aa45cfe6b69b795742272d9a514a5e&amp;dn=Lord+of+the+Rings+-+Extended+Edition+-+Directors+Cut&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bnaron","files":-1,"time":1386896716,"description":"For the past 40 years, 'The Lord of the Rings' has been, hands-down, my absolute favorite story.  I read 'The Hobbit' for the first time back in high school during the 60's and in 1974 I found 'THE TRILOGY' at an airport book and magazine stand at Andrews Air Force Base, while on my way to my duty station in Germany. Since then I have read those three books perhaps 6 or seven times, and every time, I found them quite enjoyable. Then, in 2001, Peter Jackson released the first episode of his monumental trilogy. The Fellowship of the Ring did not quite follow the story-line of the book but was incredibly fun to watch. I was hooked again.\n\nA few years back someone gave me the 12 DVD collector's Box set of the Director's Extended Cut. It included multiple audio tracks. One of them was Peter Jackson and the other writers commenting on the film providing insight into the creative process in making the movies.  It was extremely interesting. Another audio track was of the cast members, Ian McKellen (Gandalf), Elijah Wood (Frodo), Et.al.  commenting on their experiences as the film was made. Those two additional audio tracks made this box set arguably the best release of LotR ever.\n\nNOTE: Okay, I confess, there were two additional audio tracks on the original\n      DVDs. They were special effects staff commentary as well as production staff\n      commentary. In order to reduce the footprint of this torrent, I sacrificed\n      them. Sorry, but it was my call. So no flames please.\n\nI ripped the films directly from my PERSONAL DVDs and included the director and cast member audio tracks as well.\n\nFinally, For you LotR 'super-fans', I have also included both the Audio Book as well as a PDF eBook for each, both unabridged. So, in one single torrent you get a triple dose of Tolkien; the film, the audio-book and the eBook, all at no extra charge.\n\nSo enjoy my friends!\n\n\n01 - Fellowship of the Ring (Parts 1 and 2)\n\n     Discussion: As the triumphant start of a trilogy, The Lord of the Rings: The\n                 Fellowship of the Ring leaves you begging for more. By necessity,\n                 Peter Jackson's ambitious epic compresses J.R.R. Tolkien's\n                 classic The Lord of the Rings, but this robust adaptation\n                 maintains reverent allegiance to Tolkien's creation, instantly\n                 qualifying as one of the greatest fantasy films ever made. At 178\n                 minutes, it's long enough to establish the myriad inhabitants of\n                 Middle-earth, the legendary Rings of Power, and the fellowship of\n                 hobbits, elves, dwarves, and humans--led by the wizard Gandalf\n                 (Ian McKellen) and the brave hobbit Frodo (Elijah Wood)--who must\n                 battle terrifying forces of evil on their perilous journey to\n                 destroy the One Ring in the land of Mordor. Superbly paced, the\n                 film is both epic and intimate, offering astonishing special\n                 effects and production design while emphasizing the emotional\n                 intensity of Frodo's adventure. Ending on a perfect note of\n                 heroic loyalty and rich anticipation, this wondrous fantasy\n                 continues in The Two Towers (2002).\n\n\n02 - The Two Towers (Parts 1 and 2)\n\n     Discussion: The Two Towers is a seamless continuation of Peter Jackson's epic\n                 fantasy based on the works of J.R.R. Tolkien. After the breaking\n                 of the Fellowship, Frodo (Elijah Wood) and Sam (Sean Astin)\n                 journey to Mordor to destroy the One Ring of Power with the\n                 creature Gollum as their guide. Meanwhile, Aragorn (Viggo\n                 Mortensen), Legolas (Orlando Bloom), and Gimli (John Rhys-Davies)\n                 join in the defense of the people of Rohan, who are the first\n                 target in the eradication of the race of Men by the renegade\n                 wizard Saruman (Christopher Lee) and the dark lord Sauron.\n\n                 Fantastic creatures, astounding visual effects, and a climactic\n                 battle at the fortress of Helm's Deep make The Two Towers a\n                 worthy successor to The Fellowship of the Ring, grander in scale\n                 but retaining the story's emotional intimacy. These two films are\n                 perhaps the greatest fantasy films ever made, but they're merely\n                 a prelude to the cataclysmic events of The Return of the King.\n\n\n03 - The Return of the King (Parts 1 and 2)\n\n     Discussion: With The Return of the King, the greatest fantasy epic in film\n                 history draws to a grand and glorious conclusion. Director Peter\n                 Jackson's awe-inspiring adaptation of the Tolkien classic The\n                 Lord of the Rings could never fully satisfy those who remain\n                 exclusively loyal to Tolkien's expansive literature, but as a\n                 showcase for physical and technical craftsmanship it is\n                 unsurpassed in pure scale and ambition, setting milestone after\n                 cinematic milestone as the brave yet charmingly innocent Hobbit\n                 Frodo (Elijah Wood) continues his mission to Mordor, where he is\n                 destined to destroy the soul-corrupting One Ring of Power in the\n                 molten lava of Mount Doom.\n\n                 While the heir to the kingdom of Men, Aragorn (Viggo Mortensen),\n                 endures the massive battle at Minas Tirith with the allegiance of\n                 the elf Legolas (Orlando Bloom), dwarf Gimli (John Rhys-Davies)\n                 and the great wizard Gandalf (Ian McKellen), Frodo and stalwart\n                 companion Samwise Gamgee (Sean Astin) must survive the schizoid\n                 deceptions of Gollum, who remains utterly convincing as a hybrid\n                 of performance (by Andy Serkis) and subtly nuanced computer\n                 animation.\n\n                 Jackson and co-writers Fran Walsh and Philippa Boyens have much\n                 ground to cover; that they do so with intense pacing and epic\n                 sweep is impressive enough, but by investing greater depth and\n                 consequence in the actions of fellow Hobbits Merry (Dominic\n                 Monaghan) and Pippin (Billy Boyd), they ensure that Return of the\n                 King maintains the trilogy's emphasis on intimate fellowship.\n                 While several major characters appear only briefly, and one\n                 (Christopher Lee's evil wizard, Saruman) relegated entirely to the\n                 extended version on DVD, Jackson is to be commended for his\n                 editorial acumen; like Legolas the archer, his aim as a filmmaker\n                 is consistently true, and he remains faithful to Tolkien's\n                 overall vision.\n\n                 If Return suffers from too many endings, as some critic\n                 suggested, it's only because the epic's conclusion is so loyally\n                 inclusive of the actors--most notably Astin--who gave it such\n                 strength to begin with. By ending the LOTR trilogy with noble\n                 integrity and faith in the power of imaginative storytelling, The\n                 Return of the King, like its predecessors, will stand as an\n                 adventure for the ages.\n\nNOTE: I have included the English subtitles for those of you that are hearing\n      impaired. It is for the movie track, not the additional audio.\n","torrent":{"xt":"urn:btih:7348aa7f54aa45cfe6b69b795742272d9a514a5e","amp;dn":"Lord+of+the+Rings+-+Extended+Edition+-+Directors+Cut","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7348aa7f54aa45cfe6b69b795742272d9a514a5e","infoHashBuffer":{"type":"Buffer","data":[115,72,170,127,84,170,69,207,230,182,155,121,87,66,39,45,154,81,74,94]},"announce":[],"urlList":[]}}