{"title":"Jim Henson's Muppets The Great Santa Claus Switch RESTORED Chris","uid":9348965,"size":4431057606,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:742368280bb4bb90b0975846128c1f289c0c6ac5&amp;dn=Jim+Henson%27s+Muppets+The+Great+Santa+Claus+Switch+RESTORED+Chris&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tygerbug","files":137,"time":1387087351,"description":"\n\nOn December 20, 1970, television legends Jim Henson, Art Carney and Ed Sullivan came together for one night of Christmas magic. Santa Claus (Art Carney) and his elves are ready to deliver presents to children everywhere.\n\nBut Cosmo Scam (also Carney) has hatched a plan to kidnap Santa and take his place! One by one, Cosmo abducts Santa's elves and replaces them with his evil henchmen. Can Fred the Elf (Jim Henson) save Christmas before Cosmo burglarizes the world? And will Thig and Thog (Frank Oz and Jerry Nelson), Lothar (Henson) and the Frackles ever find the Christmas spirit?\n\nFeaturing original songs by Joe Raposo (Sesame Street), this was Jim Henson's first major TV special. It introduced monsters who appear in Muppet productions to this day, like Thog, the Frackles, and the puppet that became Gonzo. This DVD has been painstakingly restored, frame by frame, and features other Muppet clips to brighten up your holiday. From the editor of The Thief and the Cobbler: Recobbled Cut.\n\nSpecial features:\n\n- The Dick Cavett Show, November 25, 1971 - A few excerpts featuring Jim Henson, Lothar, Thog and a few Frackles. Jim took over the show for the full hour.\n\n- Restoration Featurette - See how restoration improved the quality of this rare special.\n\n- The Ed Sullivan Show, December 24, 1967 - Arthur Godfrey plays Santa Claus to a gaggle of Muppet monsters.\n\n- The Ed Sullivan Show: December 22, 1968 - A sketch starring Muppet reindeer.\n\n- Saturday Night Live, December 20, 1975 - &quot;Good King Ploobislaus,&quot; a &quot;Land of Gorch&quot; Muppet sketch featuring Candice Bergen.\n\n- A Muppet Family Christmas Clips - When issued on DVD in the U.S., nearly ten minutes is cut from this fan-favorite 1987 special due to music rights issues. Here are most of the &quot;deleted&quot; scenes, sourced from the UK release, along with clips that are shortened from the rare, slightly-longer original airing of the special.\n","torrent":{"xt":"urn:btih:742368280bb4bb90b0975846128c1f289c0c6ac5","amp;dn":"Jim+Henson%27s+Muppets+The+Great+Santa+Claus+Switch+RESTORED+Chris","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"742368280bb4bb90b0975846128c1f289c0c6ac5","infoHashBuffer":{"type":"Buffer","data":[116,35,104,40,11,180,187,144,176,151,88,70,18,140,31,40,156,12,106,197]},"announce":[],"urlList":[]}}