{"title":"Replacing Truth - Kevin Scharp [PDF]","uid":10237149,"size":1694639,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:752c5dabb16d7f1064f17e1273e7e841ae6aab3f&amp;dn=Replacing+Truth+-+Kevin+Scharp+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"AtomTPB","files":1,"time":1401197931,"description":"Hardcover: 352 pages\nPublisher: OUP Oxford (11 July 2013)\nLanguage: English\nISBN-10: 0199653852\nISBN-13: 978-0199653850\n\n\n\nKevin Scharp proposes an original theory of the nature and logic of truth on which truth is an inconsistent concept that should be replaced for certain theoretical purposes. Replacing Truth opens with an overview of work on the nature of truth (e.g., correspondence theories, deflationism), work on the liar and related paradoxes, and a comprehensive scheme for combining these two literatures into a unified study of the concept truth. Scharp argues that truth is best understood as an inconsistent concept, and proposes a detailed theory of inconsistent concepts that can be applied to the case of truth. Truth also happens to be a useful concept, but its inconsistency inhibits its utility; as such, it should be replaced with consistent concepts that can do truth's job without giving rise to paradoxes. To this end, Scharp offers a pair of replacements, which he dubs ascending truth and descending truth, along with an axiomatic theory of them and a new kind of possible-worlds semantics for this theory. As for the nature of truth, he goes on to develop Davidson's idea that it is best understood as the core of a measurement system for rational phenomena (e.g., belief, desire, and meaning). The book finishes with a semantic theory that treats truth predicates as assessment-sensitive (i.e., their extension is relative to a context of assessment), and a demonstration of how this theory solves the problems posed by the liar and other paradoxes.","torrent":{"xt":"urn:btih:752c5dabb16d7f1064f17e1273e7e841ae6aab3f","amp;dn":"Replacing+Truth+-+Kevin+Scharp+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"752c5dabb16d7f1064f17e1273e7e841ae6aab3f","infoHashBuffer":{"type":"Buffer","data":[117,44,93,171,177,109,127,16,100,241,126,18,115,231,232,65,174,106,171,63]},"announce":[],"urlList":[]}}