{"title":"Roxette - Look Sharp! 320cbr (Big Papi) 1988","uid":9370789,"size":133275295,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:76587f1bc6395da5ec0cb4e89d9b8bc8e3a549ea&amp;dn=Roxette+-+Look+Sharp%21+320cbr+%28Big+Papi%29+1988&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Big-Papi","files":-1,"time":1387520667,"description":"Source: 1988 CD\n-\nBy James C\nThis was the first album I ever bought. I felt a bit naughty buying it cos my parents wouldn't let me listen to rock music. How things have changed. I even play myself now. Well anyway. I still own it and still think its an awesome album. Listen to Your Heart is still quite often heard on the radio here and now with its new dance remake. I bought it for The Look. I didn't really like the song when I first heard it. I thought it was a bit naughty but it really grew on me and I became a big fan and have been ever since. This album is like a greatest hits album. I like every song on it.\n\nThe Look has that awesome guitar riff that gets you from the beginning that noone has been able to emulate and those awesome lyrics. Its hip from the beginning and you can never tyre of it.\n\nDressed For Success - funky mixture of Per and Marie. Naughty and hip. Rebellious. Still sounds great.\n\nSleeping Single - more of a blues souly jazzy number with its sax. mixed with a bit of funk.\n\nPaint - This is one of my favourite songs off the album - &quot;I get a love shock electric from the touch of your hand, I'm getting lost in the rhythms of the modern man&quot;. Cool mixture of Per and Marie. Funky rock track.\n\nDance Away - Unleashes Marie's powerful vocals and soul. Love this line &quot;even the groove has got that bitter taste of a lie&quot;.\n\nCould have been a hit for Dirty Dancing.\n\nCry - This song has really grown on me over the years. It is a really nice ballad. Up there with all the others.\n\nChances - This was single apparently to my surprise. Has a sweeping element to it. 80s guitar. funky. It gets me singing when I am listening. A surprise element.\n\nDangerous - Well what can i say. Everyone wants a girl whose a little bit dangerous. Cool Chorus - hip. &quot;I'm not attracted to go go, Viva tonight&quot;. Love that harmonica. Not played so much on the radio these days. Sometimes you hear it at retro nights.\n\nHalf A Woman, Half A Shadow - funky, sing along track.\n\nView From A hill - Again a funky little number that gets you when you listen.\n\nI Could Never Give You Up - This was never on the cassette when I first bought it and I felt I was missing out on something and sure enough I was. This is a cool song with Per mainly at the helm. &quot;I watch your rainbow rise&quot; Nice imagery. &quot;I'll carry your heart like a bridge&quot;\n\nShadow of A Doubt - Another sweeping song with epic qualities. milking Marie's awesome voice.\n\nListen to Your Heart - When you hear that trademark opening piano on the radio you know its coming. Your favourite band being played again. Awesome ballad always has been and always will. Epic and sweeping.\n\nIt was great revisiting this album to review it. It brings back a lot of nostalgia from when I was about 12 and first bought it. And all the times that I have heard these songs since. Listening to it and trying to persuade my parents that it was good music and there was nothing bad about it. Getting hassled by my sister and brother for never growing out of Roxette. First Cut is the Deepest. This was the first band and has stuck with me ever since. I have every one of their albums and this still remains right up there with the best of them. I think a lot of Roxette fans would agree that they have taken a lot of flack for staying true to this band. People laugh when you say your favourite band is Roxette. Its always been a bit of a closet thing for me but at every opportunity I have tried to get others interested with some success. It has almost become a mission. An obsessed fan perhaps. But when you listen to these and their other albums you'll understand why! There is a bit for every part of you in Roxette. There is a Roxette song for everything. They have that dynamic duo mix of female and male that makes them appealing to every romantic. And have such versatility - funy, rocky, New Wave, dance, folk, country, soul, jazz, hip hop almost even, blues, metalish at times, 60s, 70s 80s 90s, they are an ecclectic mix of everything and that's what continues to make them interesting. Every song is different - not like toher artists where you buy one album and every song sounds the same on it. I think its the versatility of having a male and female artist who were both solo artists before. Happy listening.","torrent":{"xt":"urn:btih:76587f1bc6395da5ec0cb4e89d9b8bc8e3a549ea","amp;dn":"Roxette+-+Look+Sharp%21+320cbr+%28Big+Papi%29+1988","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76587f1bc6395da5ec0cb4e89d9b8bc8e3a549ea","infoHashBuffer":{"type":"Buffer","data":[118,88,127,27,198,57,93,165,236,12,180,232,157,155,139,200,227,165,73,234]},"announce":[],"urlList":[]}}