{"title":"Reynolds Price - A Serious Way of Wondering (pdf)","uid":10241889,"size":1352574,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:76a478af32d045c01e68f4393277434b3c5857c2&amp;dn=Reynolds+Price+-+A+Serious+Way+of+Wondering+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pharmakate","files":-1,"time":1401251045,"description":"Reynolds Price - A Serious Way of Wondering: The Ethics of Jesus Imagined (Scribner, 2003). 146 pp.\n\nNew scan. Searchable pdf (clearscan) with contents linked in bookmarks, accurate pagination, metadata, etc.\n\n\nWhen renowned novelist and poet Reynolds Price, one of Christianity's most eloquent outlaws, was invited to deliver the annual Peabody Lecture at Harvard University Memorial Church in 2001, he chose to explore a subject of fierce debate and timeless relevance: the ethics of Jesus.\n\nIn two succeeding lectures at the National Cathedral and at Auburn Seminary, Price continued to explore the apparently contradictory ethics that Jesus articulates in the Gospels; and in a controversial act of artistic license, Price reimagined the historical Jesus. In A Serious Way of Wondering, Price expands these lectures to present Jesus with three problems of burning moral concern -- suicide, homosexuality, and the plight of women in male-dominated cultures and faiths. A sweeping view of the inescapable implications of Jesus' merciful life and all-embracing thought -- and of the benefits of enlarging our notions of humanity, community, and equality -- A Serious Way of Wondering is a significant contribution to Price's penetrating works of religious inquiry.\n\n\nReview\n\n&quot;Price may be the best living religious writer.&quot; -- The Boston Globe\n\n&quot;An insightful work combining thoughtful erudition with Price's obvious love for the Gospel stories . . . [to] help readers see anew Jesus of Nazareth.&quot; -- Los Angeles Times\n\n&quot;[An] insightful, challenging, and moving reflection.&quot; -- Elaine Pagels, author of Beyond Belief\n\n&quot;Brilliant.&quot; -- Publishers Weekly, starred review\n\n&quot;It is good to have an outlaw storyteller like Reynolds Price turn up from time to time to help us reimagine Gospel truth.&quot; -- The Christian Century\n\nAbout the Author\n\nReynolds Price (1933-2011) was born in Macon, North Carolina. Educated at Duke University and, as a Rhodes Scholar, at Merton College, Oxford University, he taught at Duke beginning in 1958 and was the James B. Duke Professor of English at the time of his death. His first short stories, and many later ones, are published in his Collected Stories. A Long and Happy Life was published in 1962 and won the William Faulkner Award for a best first novel. Kate Vaiden was published in 1986 and won the National Book Critics Circle Award. The Good Priest's Son in 2005 was his fourteenth novel. Among his thirty-seven volumes are further collections of fiction, poetry, plays, essays, and translations. Price is a member of both the American Academy of Arts and Letters and the American Academy of Arts and Sciences, and his work has been translated into seventeen languages.\n\n-----\n\nmore Reynolds Price:\n\nKate Vaiden - http://thepiratebay.se/torrent/10144851\n\nA Long and Happy Life is one book among many in this torrent - http://thepiratebay.se/torrent/9086820\n","torrent":{"xt":"urn:btih:76a478af32d045c01e68f4393277434b3c5857c2","amp;dn":"Reynolds+Price+-+A+Serious+Way+of+Wondering+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76a478af32d045c01e68f4393277434b3c5857c2","infoHashBuffer":{"type":"Buffer","data":[118,164,120,175,50,208,69,192,30,104,244,57,50,119,67,75,60,88,87,194]},"announce":[],"urlList":[]}}