{"title":"Johnny Mack Brown {1950-52 Complete Series - Golden Age}","uid":10355505,"size":186309747,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7890d2718d00a83b144f5eb71bdbfdf4aa81e6fe&amp;dn=Johnny+Mack+Brown+%7B1950-52+Complete+Series+-+Golden+Age%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nasty_llama","files":-1,"time":1402723334,"description":"Early life\n\nBorn and raised in Dothan, Alabama, Brown was a star of the high school football team, earning a football scholarship to the University of Alabama. Playing the halfback position on his university's Crimson Tide football team, he earned the nickname &quot;The Dothan Antelope&quot; and helped his team to become the 1926 NCAA Division I-A national football champions. In that year's Rose Bowl Game, he earned Most Valuable Player honors after scoring two of his team's three touchdowns in an upset win over the heavily favored Washington Huskies. While at The University of Alabama, Brown became an initiated member of the Kappa Sigma Fraternity.\nFilm career\n\nHis good looks and powerful physique saw him portrayed on Wheaties cereal boxes and in 1927, brought an offer for motion picture screen tests that resulted in a long and successful career in Hollywood. He played silent film star Mary Pickford's love interest in her first talkie, Coquette (1929), for which Pickford won an Oscar.\n\nHe appeared in minor roles until 1930 when he was cast as the star in a Western entitled Billy the Kid and directed by King Vidor. An early widescreen film (along with Raoul Walsh's The Big Trail with John Wayne, produced the same year), the movie also features Wallace Beery as Pat Garrett. Brown was billed over Beery, who would become MGM's highest paid actor within the next three years. Also in 1930, Brown played Joan Crawford's love interest in Montana Moon. Brown went on to make several more top-flight movies under the name John Mack Brown, including The Secret Six (1931) with Wallace Beery, Jean Harlow, and Clark Gable, as well as the legendary Lost Generation celebration of alcohol, The Last Flight (1931), and was being groomed by MGM as a leading man until being abruptly replaced on Laughing Sinners in 1931, with all his scenes reshot, substituting rising star Clark Gable in his place.\n\nRechristened &quot;Johnny Mack Brown&quot; in the wake of this extremely serious career downturn, he made exclusively low budget westerns and eventually became one of the screen's top B-movie cowboy stars, making 127 western films during his career, including Ride 'Em Cowboy with Abbott and Costello. A fan of Mexican music, he showcased the talents of guitarist Francisco Mayorga and The Guadalajara Trio in films like Boss of Bullion City and The Masked Rider. Brown also starred in four serials for Universal Studios (Rustlers of Red Dog, Wild West Days, Flaming Frontiers and The Oregon Trail) and was a hero to millions of young children at movie theaters and on their television screens.\n\nWhen the B-Western genre dropped sharply in box office popularity, Johnny Mack Brown went into retirement in 1953. He returned more than ten years later to appear in secondary roles in a few Western films. Altogether, Brown appeared in over 160 movies between 1927 and 1966, as well as a smattering of television shows, in a career spanning almost forty years.\n\n\n\nPublished by Dell Comics:\n\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Dell_Comics&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Dell_Comics&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:7890d2718d00a83b144f5eb71bdbfdf4aa81e6fe","amp;dn":"Johnny+Mack+Brown+%7B1950-52+Complete+Series+-+Golden+Age%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7890d2718d00a83b144f5eb71bdbfdf4aa81e6fe","infoHashBuffer":{"type":"Buffer","data":[120,144,210,113,141,0,168,59,20,79,94,183,27,219,253,244,170,129,230,254]},"announce":[],"urlList":[]}}