{"title":"EnigmaT Set Rips { Cuts } - December 17th, 2013","uid":9359258,"size":644130570,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:78a93ff9a19892f0ebc16178e0b6237aec03d1b2&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+December+17th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"EnigmaT","files":84,"time":1387277170,"description":"Aiera - Visionary (Original Mix) (Cut From Shadows Set)-enTc.mp3\nAllen Watts - Lifelines (UDM Remix) (Cut From tranzLift Set)-enTc.mp3\nAngelique - Overcome (Original Mix) (Cut From Alpha Duo Set)-enTc.mp3\nAngelique - Overcome (Original Mix) (Cut From GO Set)-enTc.mp3\nBertello Mucho - Feelings (Cut From Pravda Set)-enTc.mp3\nBjorn Akesson - Slam! (Cut From A&amp;F Set)-enTc.mp3\nBOOSTEDKIDS - Burned (Original Mix) (Cut From Vegas Set)-enTc.mp3\nBorgeous - Invicible (Original Mix) (Cut From Vegas Set)-enTc.mp3\nCern - The Message (John Newall Remix) (Set Rip)-enTc.mp3\nChain Gang - Sleepwalking (Juventa Remix) (Cut From Tritonal Set)-enTc.mp3\nClaus Backslash - Empire (Original Mix) (Cut From Bowden Set)-enTc.mp3\nCLMD - Farder (Original Mix) (Cut From Davies Set)-enTc.mp3\nCorti Organ - Freak Show (Original Mix) (Set Rip)-enTc.mp3\nCorti Organ - Freak Show (Woody van Eyden - WvE - Remix) (Set Rip)-enTc.mp3\nCurtis Young - Activation (Reaky Remix) (Cut From Summerville Set)-enTc.mp3\nD.B.J - Acid Technics (Original Mix) (Cut From Summerville Set)-enTc.mp3\nDaniel Wanrooy feat. Jordan Kashin - Nothing To Lose (Paul Vitinsky Remix) (Cut From Coastline Set)-enTc.mp3\nDJ Husband - Aries Rising (Cut From Lynam Set)-enTc.mp3\nDJ T.H. feat. Alisha Nauth - Make You Better (Mostfa &amp; Mostfa Remix) (Cut From Summerville Set)-enTc.mp3\nDJ Tiesto - Adagio For Strings (James Dymond Rework) (Cut From Dymond Set)-enTc.mp3\nEddie Lung - Meteor (Orbion Remix) (Cut From tranzLift Set)-enTc.mp3\nEssonita feat. Love Dimension - All We Need (Alex Blest pres. Soundbreeze Remix) (Cut From Gibson Set)-enTc.mp3\nEssonita feat. Love Dimension - All We Need (Alex Blest pres. Soundbreeze Remix) (Cut From Shadows Set)-enTc.mp3\nEstiva - Boxmeister (Original Mix) (Cut From Tritonal Set)-enTc.mp3\nEstiva - Shoesham (Original Mix) (Cut From Tritonal Set)-enTc.mp3\nFatboy Slim - Eat Sleep Rave Repeat (Dimitri Vegas &amp; Like Mike &amp; Ummet Ozcan Tomorrowland Remix) (Cut From W&amp;W Set)-enTc.mp3\nFon.Leman - Hypnotise (Original Mix) (Cut From Davies Set)-enTc.mp3\nFrank Dattilo - 753 B.C. (O.B.M Notion Remix) (Cut From tranzLift Set)-enTc.mp3\nFUNK D &amp; Massive Tune - Rock The House (Original Mix) (Cut From Vegas Set)-enTc.mp3\nGabi 2B - Doctor Mephisto (Cut From J00F Set)-enTc.mp3\nGuess What - Nebulae (Jakhira's Dusty Recreation) (Cut From Config Set)-enTc.mp3\nJay Cosmic - Fire Rhythm (ABGT 057 - Sample -)-enTc.mp3\nJayB &amp; Sandra Wagner - Keep Running (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nJoey Suki &amp; Kill The Buzz - Life Is Calling (Cut From Page Set)-enTc.mp3\nJuventa - SHWDWN (ABGT 057 Rip)-enTc.mp3\nKerry Lava - Proud (Steve Kaetzel Remix) (Cut From Tydi Set)-enTc.mp3\nKodaline - All I Want (Twelve Monkeys Festival Remix) (Cut From Oakenfold Set)-enTc.mp3\nLiam Shachar - Cry (Original Mix) (Cut From Bowden Set)-enTc.mp3\nLost Witness feat. Danielle Simeone - Fall (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nLost Witness feat. Danielle Simeone - Fall (Part 1) (Anxess Uplifting Vocal Mix) (Cut From Alpha Duo Set)-enTc.mp3\nMaddix - Rampant (Original Mix) (Cut From Vegas Set)-enTc.mp3\nManuel Le Saux - One (Ferry Tayle Remix) (Cut From A&amp;F Set)-enTc.mp3\nMarcel van Eyck, Dj T.H. &amp; Three Faces - Afterglow (Vasily Goodkov Remix) (Cut From Shah Set)-enTc.mp3\nMike Van Fabio - Complicity (Cut From A&amp;F Set)-enTc.mp3\nMiley Cirus - Wrecking Ball (Afrojack Remix) (Cut From W&amp;W Set)-enTc.mp3\nMostfa &amp; Mostfa - Sunset On The Beach (C-Systems Remix) (Cut From Photographer Set)-enTc.mp3\nMostfa &amp; Mostfa - Sunset On The Beach (Original Mix) (Cut From Cold Set)-enTc.mp3\nMoxa - Abiding Bliss (Original Mix) (Cut From Jerom Set)-enTc.mp3\nNari &amp; Milani - Patriots (Execute Remix) (Cut From Vegas Set)-enTc.mp3\nNianaro - In The Beginning (Original Mix) (Cut From Echelon Set)-enTc.mp3\nNivaya - I Miss You (Cut From A&amp;F Set)-enTc.mp3\nNoadja - Come To You (Original Mix) (Cut From Coastline Set)-enTc.mp3\nO.B.M Notion &amp; Airzoom - After Rain (Original Mix) (Cut From tranzLift Set)-enTc.mp3\nOmniks - Wisp (Abandoned Rainbow Remix) (Cut From El Jay Set)-enTc.mp3\nOrbion &amp; MF feat. Polina Tkachenko - Thoughts Of You (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nPara X - Skytunes 2.0 (Cut From A&amp;F Set)-enTc.mp3\nPaul Gibson - Monkey Puzzle (Original Mix) (Cut From Gibson Set)-enTc.mp3\nPeter Kontor - Lost In Music (Spark7 Remix) (Cut From GO Set)-enTc.mp3\nPlastic Boy  Twixt (Fernie Remix) (Cut From Fernie Set)-enTc.mp3\nPvR - High Frequencies (SettleR Remix) (Cut From Tero A Set)-enTc.mp3\nQuintino &amp; Alvaro - World In Our Hands (Blasterjaxx Remix) (Cut From Vegas Set)-enTc.mp3\nRiva Starr &amp; Fatboy Slim - Eat Sleep Rave Repeat (Dimitri Vegas &amp; Like Mike Remix) (Cut From Vegas Set)-enTc.mp3\nSaman &amp; Farzam - Archer (Hypaethrame Remix) (Cut From Del Mar Set)-enTc.mp3\nSaman &amp; Farzam - Archer (Hypaethrame Remix) (Cut From Tero A Set)-enTc.mp3\nSaman &amp; Farzam - Archer (Hypaethrame Remix) (Cut From tranzLift Set)-enTc.mp3\nSensitive and Jackson Sttauder - Missing (Original Mix) (Cut From GO Set)-enTc.mp3\nSkyknock - Mykonos (Davoud Remix) (Set Rip)-enTc.mp3\nSneijder - Remember Me (Cut From A&amp;F Set)-enTc.mp3\nStardust - Music Sounds Better With You (Panda Under The Influence Remix) -w- Daft Punk One More Time (ABGT 057 Rip)-enTc.mp3\nSteve Forest - Tatanka (Original Mix) (Cut From Vegas Set)-enTc.mp3\nSteve Sanders feat. MK - Sunrise (Dreamy Energetic Mix) (Cut From El Jay Set)-enTc.mp3\nSteve Sanders feat. MK - Sunrise (Dreamy Energetic Mix) (Cut From tranzLift Set)-enTc.mp3\nSug J feat. 227 - Lodestar (Andre Berger Remix) (Cut 2 From Echelon Set)-enTc.mp3\nSug J feat. 227 - Lodestar (Andre Berger Remix) (Cut From Echelon Set)-enTc.mp3\nSunset Slave - Moments Of Forever (Original Mix) (Cut From First Effect Set)-enTc.mp3\nTempo Giusto pres. ToneArts - American Dream (Original Mix) (Cut 2 From Echelon Set)-enTc.mp3\nTempo Giusto pres. ToneArts - American Dream (Original Mix) (Cut From Echelon Set)-enTc.mp3\nThe Digital Devil - Magnetic (Calvin Logue Remix) (Cut From Lynam Set)-enTc.mp3\nTiesto feat. Kyler England - Take Me (Nifra Remix) (Cut From Nifta Set)-enTc.mp3\nTolga Uzulmez - Jerbera (Manuel Rocca Remix) (Cut From Shadows Set)-enTc.mp3\nTommy Baynen - TomB Raider (Original Mix) (Cut From Tritonal Set)-enTc.mp3\nTyler Sherritt - Spring (High 5 Remix) (Cut From Sunny Lax Set)-enTc.mp3\nWayne &amp; Woods - Favela (Cut From W&amp;W Set)-enTc.mp3\nWragg - Entity (Cut From Lynam Set)-enTc.mp3","torrent":{"xt":"urn:btih:78a93ff9a19892f0ebc16178e0b6237aec03d1b2","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+December+17th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78a93ff9a19892f0ebc16178e0b6237aec03d1b2","infoHashBuffer":{"type":"Buffer","data":[120,169,63,249,161,152,146,240,235,193,97,120,224,182,35,122,236,3,209,178]},"announce":[],"urlList":[]}}