{"title":"The Pirate Bay Android v1.6.3","uid":9343562,"size":2704877,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:79d5f45fdfe283bc5de8a504f3808cfdec6afff6&amp;dn=The+Pirate+Bay+Android+v1.6.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"devhum","files":1,"time":1386985140,"description":"What's New:\nv1.6.3 [December 13, 2013]\n- Default URL now uses the new PE domain.\n\nv1.6.2 [December 11, 2013]\n- Default URL now uses the new AC domain.\n\nv1.6.1 [October 31, 2013]\n- Added some more proxies since the existing ones were mostly blocked by some carriers.\n- Removed End. label in search results.\n\nv1.6.0 [May 25, 2013]\n- Search history added with ability to enable/disable and clear in settings.\n- The application can now be launched when clicking a thepiratebay.se torrent/user URL.\n- Changing the base URL from the error screen will now be used when trying again without re-performing the search.\n- Re-sorting search results no longer have an extra appended slash at the end of the URL.\n- Text in torrent info and comments now linkify email addresses. The Pirate Bay links using the .sx domain are now linkified.\n- Fixed bug with skull icon types in results screen.\n- Fixed white screen when trying to re-load the next page of a search result when an error occurred.\n\nPlease view the What's New in the app for full change logs.\n\n------------------------------------------\n\nThis app was removed from the Play Store so I will be providing this application for free with no ads. Therefore, please contact me for any general inquiries, problems or suggestions.\n\nScreenshots:      &lt;a href=&quot;\nhttp://imgur.com/a/8Fqov&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgur.com/a/8Fqov&lt;/a&gt;\n\n------------------------------------------\n\nSearch and browse torrents from The Pirate Bay with ease and download them using your favourite torrent application.\n\nMain Features:\n- Search torrents with any category and a default sort\n- Browse torrents in any category (including Top 100s)\n- View the most recent torrents\n- Favourite any of your search results or torrents for later use. (Backup + Restore capability)\n- Sort your search results\n- Download a torrent using your default torrent application (must handle magnet links)\n- Share or open browser for any search results and torrent links\n- Choose proxy URLs if The Pirate Bay is blocked or down.\n- Holo common look and feel from 2.2 and up\n\nThe application and I, the developer, are not affiliated with The Pirate Bay.\n\nThe application is optimized for large screens in landscape orientation for the search results and torrent info screens. Let me know if there are any issues with this since I don't actually have a tablet, only tested on emulators.\n\nLimitations/Known Issues:\n- Cannot go directly to a Pirate Bay user through the search. You can however access the torrents of a user through the link of one of their torrents\n- The comments in the torrent info is limited the the last/most current page\n- The search results will load a maximum of 10 pages at the moment\n- Cannot edit the name of your favourites. At the moment, they match either your search criteria or the torrent name. Also cannot re-order them.\n\nIMPORTANT: I am one developer that worked on this on my free time. This app is quite useful for myself and I thought I would share. Therefore, please contact me if there are ANY issues.\n\nI tested this app on my Nexus 4 (4.3) and on emulators from 2.2 and up.\n\nThis application uses The Pirate Bay website. Please make sure that The Pirate Bay website is working if you encounter any issues. The application does not track any usage.\n\nPermissions:\n- INTERNET: Internet connection only for The Pirate Bay website\n- WRITE_EXTERNAL_STORAGE: For backing up and restoring your favourites\n\nThanks to:\n- ActionBarSherlock\n- HoloEverywhere\n- ViewPagerIndicator\n\nEnjoy!\t\t","torrent":{"xt":"urn:btih:79d5f45fdfe283bc5de8a504f3808cfdec6afff6","amp;dn":"The+Pirate+Bay+Android+v1.6.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79d5f45fdfe283bc5de8a504f3808cfdec6afff6","infoHashBuffer":{"type":"Buffer","data":[121,213,244,95,223,226,131,188,93,232,165,4,243,128,140,253,236,106,255,246]},"announce":[],"urlList":[]}}