{"title":"[Coursera] Dino 101 - Dinosaur Paleobiology","uid":10262393,"size":1107657280,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:7a8bb26d928b1a734d10f7bf47d1809ca1598026&amp;dn=%5BCoursera%5D+Dino+101+-+Dinosaur+Paleobiology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"rndNbr","files":171,"time":1401480418,"description":"DINO 101: DINOSAUR PALEOBIOLOGY\n******************************************************\nTaught by Philip John Currie and Victoria Megan Arbour\nPublished by the University of Alberta and Coursera\nCompiled by the Free Library and Uploaded by rndNbr in April 2014\n\n======================================================\n\nThank you for downloading this educational resource. If you are satisfied with it, I only ask you to seed its torrent or pass it on in some way for someone else's use.\n\nIf you have any comments, questions, or suggestions, if you would like information on other free educational resources, or if you would like to contribute, please contact us at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;caacb8afafa6a3a8b8abb8b38aafa7aba3a6e4a9a5a7e4&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nIf you would like to donate, support free education by donating to Khan Academy:\n &lt;a href=&quot;\nhttp://khanacademy.org/donate&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://khanacademy.org/donate&lt;/a&gt;\n\nThank you.\n\nThe Free Library\n\n======================================================\n\nThis course includes the video lectures (MP4), their subtitles (SRT), transcripts (TXT), and any lecture resources that were provided by the professor(s).\n\n======================================================\n\nThis is version 002 of this course. It ended in March 2014.\n\nDino 101: Dinosaur Paleobiology is a 12-lesson course teaching a comprehensive overview of non-avian dinosaurs. Topics covered: anatomy, eating, locomotion, growth, environmental and behavioral adaptations, origins and extinction. Lessons are delivered from museums, fossil-preparation labs and dig sites. Estimated workload: 3-5 hrs/wk for non-credit; 7-10 hrs/wk for credit\n\nn Dino 101: Dinosaur Paleobiology, students will learn about the many kinds of non-avian dinosaurs that roamed the earth during the Mesozoic Era, from 250 to 65 million years ago. Numerous topics are covered in order to deliver a comprehensive survey of this important group of animals. These include adaptations for attack and defence, anatomy,  appearances, behaviors, birth, deep time, evolutionary theory, feeding, fossilization, growth, integumentary structures, locomotion, major groupings, origins, paleogeography, plate tectonics, reproduction, species definition, stratigraphy, and the extinction event that brought their dominance to an end.\n\nCourse material is delivered in a student-friendly short-form fashion, with numerous formative feedback sections. Many lessons are delivered from actual dinosaur dig sites. Students will gain access to a number of special interactive modules designed specifically for this course. These modules will grant users access to their very own virtual fossil collection, allow them to build dinosaur skeletons and provide them with an interactive visual representation of geologic time. This course's unique lesson delivery, combined with a classic quiz structure, will enable students to quickly gain a solid foundation for understanding dinosaurs, their adaptations and behaviours, and their place in the long history of earth.\n\nDino 101 is part of an ongoing program of research into digital learning conducted by the University of Alberta and therefore anonymized data provided by Coursera and survey information can be made accessible to the researchers.\n\nMore information about this course is available at https://coursera.org/course/dino101","torrent":{"xt":"urn:btih:7a8bb26d928b1a734d10f7bf47d1809ca1598026","amp;dn":"%5BCoursera%5D+Dino+101+-+Dinosaur+Paleobiology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a8bb26d928b1a734d10f7bf47d1809ca1598026","infoHashBuffer":{"type":"Buffer","data":[122,139,178,109,146,139,26,115,77,16,247,191,71,209,128,156,161,89,128,38]},"announce":[],"urlList":[]}}