{"title":"Happily Ever After - Harriet Evans.epub","uid":9364095,"size":553895,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7b494ea9efb71c6218b599bb3ff9f70b8b44022c&amp;dn=Happily+Ever+After+-+Harriet+Evans.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1387380799,"description":"In her blockbuster international bestsellers, Harriet Evans perfectly captures the complex lives of young twenty-first-century career women with an effortlessly readable . . . comic style and loveable character.\nAt twenty-two, Eleanor Bee is sure about three things: she wants to move to London and become a literary superstar; she wants to be able to afford to buy a coffee and croissant every morning; and after seeing what divorce did to her parents; especially her mum; she doesn't believe in happy endings. Elle moves to London. She gets a job at Bluebird Books, a charmingly old-fashioned publisher. She falls out of bars, wears too-short skirts, makes lots of mistakes, and feels like she's learning nothing and everything at the same time. And then, out of the blue, she falls in love, and that's when she realises just how much growing up she has to do.\nTen years on, Elle lives in New York, and you could say she has found success; certainly her life has changed in ways she could never have predicted. But no matter where you go and how much you try to run away, the past has a funny way of catching up with you. . . .","torrent":{"xt":"urn:btih:7b494ea9efb71c6218b599bb3ff9f70b8b44022c","amp;dn":"Happily+Ever+After+-+Harriet+Evans.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b494ea9efb71c6218b599bb3ff9f70b8b44022c","infoHashBuffer":{"type":"Buffer","data":[123,73,78,169,239,183,28,98,24,181,153,187,63,249,247,11,139,68,2,44]},"announce":[],"urlList":[]}}