{"title":"Charles W. Calomiris - Fragile by Design. The Political Origins ","uid":10249650,"size":9288246,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7c16cc870be9e31403500711e9acc95449f11f0e&amp;dn=Charles+W.+Calomiris+-+Fragile+by+Design.+The+Political+Origins+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Anette14","files":-1,"time":1401332698,"description":"Description\nProduct Details\nBook Title: Fragile by Design: The Political Origins of Banking Crises and Scarce Credit (The Princeton Economic History of the Western World)\t\nBook Author: Charles W. Calomiris (Author), Stephen H. Haber (Author)\nSeries: The Princeton Economic History of the Western World\nHardcover: 624 pages\nPublisher: Princeton University Press (February 23, 2014)\nLanguage: English\nISBN-10: 0691155240\nISBN-13: 978-0691155241\n\n===================================================================================\nBook Description\nPublication Date: February 23, 2014\nWhy are banking systems unstable in so many countries--but not in others? The United States has had twelve systemic banking crises since 1840, while Canada has had none. The banking systems of Mexico and Brazil have not only been crisis prone but have provided miniscule amounts of credit to business enterprises and households. Analyzing the political and banking history of the United Kingdom, the United States, Canada, Mexico, and Brazil through several centuries, Fragile by Design demonstrates that chronic banking crises and scarce credit are not accidents due to unforeseen circumstances. Rather, these fluctuations result from the complex bargains made between politicians, bankers, bank shareholders, depositors, debtors, and taxpayers. The well-being of banking systems depends on the abilities of political institutions to balance and limit how coalitions of these various groups influence government regulations.\nFragile by Design is a revealing exploration of the ways that politics inevitably intrudes into bank regulation. Charles Calomiris and Stephen Haber combine political history and economics to examine how coalitions of politicians, bankers, and other interest groups form, why some endure while others are undermined, and how they generate policies that determine who gets to be a banker, who has access to credit, and who pays for bank bailouts and rescues.\n\n===================================================================================\nReviews\n&quot;Brilliant. . . . If you are looking for a rich history of banking over the last couple of centuries and the role played by politics in that evolution, there is no better study. It deserves to become a classic.&quot;--Liaquat Ahamed, New York Times Book Review\n\n&quot;Business economists Calomiris and Haber explain how imperfectly politics and commercial banks intersect, and the consequences for the rest of us. . . . This learned inquiry deserves ample attention from scholars, regulators, and bankers themselves.&quot;--Publishers Weekly\n\n&quot;Calomiris and Haber offer a thoughtful counter-argument to the current received wisdom.&quot;--Howard Davies, Times Higher Education\n\n&quot;Readable, erudite, myth-busting. . . . The authors' clear and well-documented discussion of what happened should dissuade anyone of the myth that the economic crisis of 2007-09 was caused by the profit-and-loss system of unfettered capitalism.&quot;--Gene Epstein, Barron's\n\n&quot;Charles Calomiris and Stephen Haber make the compelling argument that a country's propensity for frequent banking crises is linked to the ability of populist elements to hold the banking sector to ransom.&quot;--Louise Bennetts, American Banker\n\n&quot;This is a great history of political interference in bank regulation . . &quot;--James Ferguson, Money Week\n\n&quot;One reason why economists did not see the financial crisis coming is that the models most macro and financial economists deal in are free of politics. Fragile by Design offers a much-needed supplement.&quot;--Martin Sandbu, Financial Times\n\n&quot;Will a next crisis be averted? Perhaps, if our regulators read this book.&quot;--Vicky Pryce, The Independent\n\n&quot;Fragile by Design . . . is a great book. . . . [E]normously illuminating, and contains the most powerful and concise account of the causes of the 2008 crisis that I have seen.&quot;--Eric Posner, EricPosner.com\n\n&quot;If you have time to read only one book about the causes of the 2008 financial collapse, read this one. . . . Charles W. Calomiris and Stephen H. Haber . . . have written an exhaustively researched and readable volume. . . . With great literary sensibility uncommon to economists, Calomiris and Haber have performed a public service by painstakingly identifying these root causes.&quot;--Diana Furchtgott-Roth, National Review\n\n===================================================================================\nFrom the Inside Flap\n&quot;A seminal political economy analysis of why banking varies so much across countries, with such profound consequences for economic development and social welfare. Not just fascinating and original, but also right.&quot;--James Robinson, author of Why Nations Fail\n\n&quot;A monumental intellectual and scholarly achievement that will shape thinking on finance and politics for decades to come. A book for the ages, whose insights are delivered in a lively, punchy, and nontechnical narrative.&quot;--Ross Levine, University of California, Berkeley\n\n&quot;A major contribution to our understanding of banking, showing why nations need banks, why banks need the state, and how the quality of banking depends on how the 'Game of Bank Bargains' is played between politicians, bankers, and a penumbra of key protagonists.&quot;--Charles Goodhart, London School of Economics and Political Science\n\n&quot;What explains the dramatic variation across countries in the extent, structure, regulation, and fragility of banking? Calomiris and Haber provide a tour de force resolution of the question. Their answer: politics. Fragile by Design's synthesis is shockingly original and convincing.&quot;--Darrell Duffie, Stanford University\n\n&quot;A remarkably detailed account of the sources of banking and financial failure under different institutional rules. A masterful achievement and a must-read for banking scholars, analysts, and regulators.&quot;--Allan Meltzer, author of A History of the Federal Reserve\n\n&quot;Fragile by Design bristles with insights about how conflicting private interests, intermediated through political institutions, have sometimes produced banking and social insurance arrangements that make financial crises much more likely than they should be.&quot;--Thomas Sargent, Nobel Laureate in Economics\n\n&quot;Why do America's banks go bust so often? Fragile by Design draws back the veil that hides the murky world where politics and big money meet, and exposes the surprising truth--that the banks were built to fail. Read, learn, and keep your cash close at hand!&quot;--Ian Morris, author of Why the West Rules--for Now\n\n&quot;Fragile by Design explains why the U.S. banking crisis of 2007-2009 is no aberration, but only the latest episode of a populist bargain gone awry. This is a powerful entry in the debate on how to fix the postcrisis world.&quot;--Raghuram Rajan, author of Fault Lines\n\n===================================================================================\nAbout the Author\nCharles W. Calomiris is the Henry Kaufman Professor of Financial Institutions at Columbia Business School and a professor at Columbia's School of International and Public Affairs. His many books include &quot;U.S. Bank Deregulation in Historical Perspective&quot;. Stephen H. Haber is the A. A. and Jeanne Welch Milligan Professor in the School of Humanities and Sciences and the Peter and Helen Bing Senior Fellow at the Hoover Institution at Stanford University. His many books include &quot;The Politics of Property Rights&quot;.\n===================================================================================","torrent":{"xt":"urn:btih:7c16cc870be9e31403500711e9acc95449f11f0e","amp;dn":"Charles+W.+Calomiris+-+Fragile+by+Design.+The+Political+Origins+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c16cc870be9e31403500711e9acc95449f11f0e","infoHashBuffer":{"type":"Buffer","data":[124,22,204,135,11,233,227,20,3,80,7,17,233,172,201,84,73,241,31,14]},"announce":[],"urlList":[]}}