{"title":"windows 8 recovery partition","uid":9339933,"size":9903323467,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7d67e5f99d2038e0a53f34eac218c07cfc1c93e1&amp;dn=windows+8+recovery+partition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cube10025","files":108,"time":1386909431,"description":"This is the .wim image from the recovery partition from asus G750JW.\n\nWith this you will be able to install Windows 8 oem on at least an asus computer. Good if you have accidentally deleted the recovery partition or as i did try to install windows 7 and deleted them.\n\nNote! I am not sure the Windows repair in this torrent will boot, try it first!!! best try to download or create one yourself, dont know if the windows 7 one works... One option is to download and install a Windows 8 iso and create a repair disc or stick.\n\nGuide. This is how I did it and got it up and running. It worked and it takes the oem key coded on the motherboard. I am a moron so this guide is in moranish!\n\n1. Make a partition you want to install windows 8 on I used the program in this torrent.\n\n2. Run GlmageX v2, its in the x64 folder. Choose Apply, Source the install.wim, Destination the new partition. Hit apply and wait.\n\n3. Burn the Windows 8 repair disc also provided in this torrent.\n\n4. Boot the cd choose advanced and command prompt. type bootrec  /rebuildbcd when promt hit Y (Yes)\n\n5. Restart and you have the option to boot windows 8 do it, you will get an error massage its damaged.\n\n6. Boot the windows 8 repair cd go advanced and pic try to automatic repair windows \n\n8. Restart and boot windows 8. Done\n\nNow this dose not install all drivers so be sure to have lan drivers on a usb stic or similar.\n\nAtleast you have now saved your OEM.\n\nYou can comment on the torrent and I will try to answer.","torrent":{"xt":"urn:btih:7d67e5f99d2038e0a53f34eac218c07cfc1c93e1","amp;dn":"windows+8+recovery+partition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d67e5f99d2038e0a53f34eac218c07cfc1c93e1","infoHashBuffer":{"type":"Buffer","data":[125,103,229,249,157,32,56,224,165,63,52,234,194,24,192,124,252,28,147,225]},"announce":[],"urlList":[]}}