{"title":"Revolution in the Air The Songs of Bob Dylan, 1957-1973 by Clint","uid":9367947,"size":4118571,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7f221ca4fc3fb1713495b6ac3bb7de5ce63857cf&amp;dn=Revolution+in+the+Air+The+Songs+of+Bob+Dylan%2C+1957-1973+by+Clint&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"420weedman","files":4,"time":1387467480,"description":"Bob Dylan has always regarded himself as a songwriter: 'I am my words', he wrote in 1964. Distilling a lifetime's passion and study, leading Dylan author, Clinton Heylin charts the development and first moments of genius of this unique artist whose songs changed the world. From his first attempts at writing, &quot;Song to Bridget&quot;, in 1957, (apparently for Brigitte Bardot) Bob Dylan always aspired to poetry, yet his role as a writer rather than a performer of his own songs is often overlooked. In over fifty years of creativity he had penned some of the most iconic, and perfect, songs in popular history. Arriving in New York in 1961, the city had an enormous impact on the young artist and, as he established himself amongst the folk clubs and artists, he would produce songs that spoke for a whole generation: &quot;Blowing in the Wind&quot;, &quot;A Hard Rain's Gonna Fall&quot;, &quot;The Times They Are a Changin&quot;, &quot;Like a Rolling Stone&quot;, and &quot;Forever Young&quot;. In &quot;Revolution in the Air&quot;, Clinton Heylin recounts the story of each song as it is written, giving a full appreciation of the songs themselves as well as Dylan the emerging artist. Unlike any other book on Dylan, it charts his rise as a writer, where he gained his inspiration, the burst of energy which produced some of his most famous songs as well as the lesser known stories behind the more iconic verses. This is an essential book for anyone interested in Dylan and his place in literature. Informative, opinionated, packed with new insights and revelations, this is an instant classic. Praise for Clinton Heylin: 'The only Dylanologist worth reading' - &quot;The New York Times'. 'Arguably the world's greatest rock biographer' - &quot;The Irish Independent&quot;.","torrent":{"xt":"urn:btih:7f221ca4fc3fb1713495b6ac3bb7de5ce63857cf","amp;dn":"Revolution+in+the+Air+The+Songs+of+Bob+Dylan%2C+1957-1973+by+Clint","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f221ca4fc3fb1713495b6ac3bb7de5ce63857cf","infoHashBuffer":{"type":"Buffer","data":[127,34,28,164,252,63,177,113,52,149,182,172,59,183,222,92,230,56,87,207]},"announce":[],"urlList":[]}}