{"title":"Henny Thijssing-Boer - Zwijgen hoeft niet meer (Trilogie). NL Eb","uid":9368249,"size":905724,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:809ab8e923943777f6ed95906b441aecca579bcb&amp;dn=Henny+Thijssing-Boer+-+Zwijgen+hoeft+niet+meer+%28Trilogie%29.+NL+Eb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BiWild","files":-1,"time":1387473058,"description":"Henny Thijssing-Boer - Zwijgen hoeft niet meer (Trilogie). NL Ebook. DMT \n\nAfbeelding\n\nAuteur: Henny Thijssing-Boer \nPagina's: 544\nTaal: Dutch/Nederlands\nGenre: Roman\n\nSamenvating\n\nDeel 1 - Verzwegen verleden\n\nAnno Diekman is als baby verwisseld met het dood geboren kind van een arbeidersmeisje. Dit werd zo geregeld in een tijd \ndat zulke dingen nog konden, om de schande van zijn moeder, de ongetrouwde dochter van een rijke boer, te verbergen.\nHoewel Anno in het arme milieu van zijn nieuwe moeder met veel liefde wordt groot gebracht, is hij niet tevreden. Zijn trotse \nboerenbloed doet hem verlangen naar rijkdom en macht. Deze onverklaarbare drang bezorgt hem veel ellende, t\not de waarheid van zijn afkomst eindelijk aan het licht komt. \n\n\nDeel 2 - Dat wat voorbij is\n\nHet verleden is nooit voorbij. Dat beseft Riek je als ze te weten komt welk drama zich heeft afgespeeld in het leven \nvan haar grootmoeder, Dineke Diekman. Grootmoeder woont in bij haar en haar vader, Anno. Riekje ziet haar elke dag, \nmaar grootmoeder heeft altijd gezwegen. Het verdriet is zo groot dat zij er niet over kan praten. Riekje houdt heel veel van \ngrootmoeder, daarom wil zij haar helpen. Ze bedenkt een plan dat wel heel ver gaat, zover dat haar eigen hart \ner halverwege niet meer in mee kan gaan, zeker niet als er liefde in het spel komt... \n\nDeel 3 - Een stem in de stilte\n\nRiekje is inmiddels een volwassen vrouw. Ze heeft onder dramatische omstandigheden haar man Sacco verloren en woont nu, \nmet haar dochtertje Didi, in de voorname herenboerderij waar ook haar vader, haar tweede moeder en enige aangetrouwde \nfamilieleden huizen. Het is er warm en knus en Riekje is er gelukkig. Toch wil ze er hal s over kop weg wanneer liefde voor \nFriggo Vriezema haar overrompelt. Als blijkt dat Friggo haar bedriegt, breekt Riekje met hem. Het doet haar zoveel pijn \ndat haar hart bevriest. Wie zal het ontdooien, want een stem in de stilte zegt haar dat dit niet is hoe zij wil leven...\n\nMet dank aan de originele poster !! \n\n\nDeze review wordt u aangeboden door","torrent":{"xt":"urn:btih:809ab8e923943777f6ed95906b441aecca579bcb","amp;dn":"Henny+Thijssing-Boer+-+Zwijgen+hoeft+niet+meer+%28Trilogie%29.+NL+Eb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"809ab8e923943777f6ed95906b441aecca579bcb","infoHashBuffer":{"type":"Buffer","data":[128,154,184,233,35,148,55,119,246,237,149,144,107,68,26,236,202,87,155,203]},"announce":[],"urlList":[]}}