{"title":"EnigmaT Set Rips { Cuts } - December 12th, 2013","uid":9335945,"size":559196136,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8302369b8cfe672d34dc5469f5fd146dd0a71a7f&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+December+12th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"EnigmaT","files":62,"time":1386807195,"description":"5th Dimension - Armageddon (Chris Oblivion Remix) (Cut From Lawrence Set)-enTc.mp3\n7 Baltic &amp; Wojciech Kania - Call Me (Cut From Bobina Set)-enTc.mp3\nAdsver - Swirl (Orignal Mix) (Cut From Misja Set)-enTc.mp3\nAerofeel5 - Position (Cut From Graham Set)-enTc.mp3\nAlessandro Diga - Verzonken In Gedachten (Paul Hazendonk &amp; Noraj Cue Remix) (Cut From Ruben Set)-enTc.mp3\nAlex Ender - Phoria (Matt Eray Remix) (Cut From Anderson Set)-enTc.mp3\nAndrew StetS - Siiner (Original Mix) (Cut From Gold Set)-enTc.mp3\nAudio Playground Featuring Snoop Lion - You Never Know (Victor Dinaire &amp; Bissen Remix) (Cut From Dinaire Set)-enTc.mp3\nCarlos Mojica feat. Asherah - Take A Look (Dark Intensity Extended Remix) (Cut From Young Free Set)-enTc.mp3\nCBM &amp; Johnny Zana - Exakto (Victor Dinaire Remix) (Cut From Dinaire Set)-enTc.mp3\nCR &amp; JM - Fuck You (Liam Wilson Remix) (Cut From Suckley Set)-enTc.mp3\nDanny Young - The Shadow (Original Mix) (Cut From Eteson Set)-enTc.mp3\nDomestic Technology - Sunset Madness (Chris Odium Remix) (Cut From Solarstone Set)-enTc.mp3\nElleu - Protons (Cut From Pit Set)-enTc.mp3\nExplosion - Originada (Original Mix) (Cut From Anderson Set)-enTc.mp3\nGelardi &amp; Thomas N - Solero (Santerna Remix) (Cut From Anderson Set)-enTc.mp3\nHellBerg &amp; Deutgen &amp; Splitbreed - Collide (Astronaut &amp; Barely Alive Remix) (Cut From BT Set)-enTc.mp3\nIlya Gerus - Northern Lights (E.F.G Remix) (Cut From Barone Set)-enTc.mp3\nIntomek - Tocame (Cut From Pledger Set)-enTc.mp3\nJason Ross - Burma (Original Mix) (Cut From Eteson Set)-enTc.mp3\nJayB &amp; Sandra Wagner - Keep Running (Club Mix) (Cut From Anderson Set)-enTc.mp3\nJayeson Andel feat. Natasha - Paper Roses (Original Mix) (Cut From Anderson Set)-enTc.mp3\nJesse Hutton - Daydreamer (Original Mix) (Cut From Anderson Set)-enTc.mp3\nJethimself - Canopy (Original Mix) (Cut From Velden Set)-enTc.mp3\nJohn Newall - Backbiter (Original Mix) (Cut From Eteson Set)-enTc.mp3\nLea Hunter - Imperial (Original Mix) (Cut From Fonarev Set)-enTc.mp3\nLence &amp; Pluton - Amphitheater (Cut From Dinaire Set)-enTc.mp3\nLost Witness feat. Daniella - Fall (Orbion Dub Mix) (Cut From Anderson Set)-enTc.mp3\nLyctum and Spinney Lainey - Wake Up (Harmonic Rush Remix) (Cut From Romel Set)-enTc.mp3\nM.I.K.E. - The Motive (Cut From Pit Set)-enTc.mp3\nMarcel Kenenberg Vs. Another World - Heaven (Original Mix) (Cut From ReOrder Set)-enTc.mp3\nMark Eteson - Come Alive (Original Mix) (Cut From Eteson Set)-enTc.mp3\nMaRLo feat. Jano - The Island (MaRLo's 2013 Remix) (Cut From Marlo Set)-enTc.mp3\nMatt Crofford - Morning Waves (AKI Amano Remix) (Cut From Velden Set)-enTc.mp3\nMax Cover - Secret Sign (Cut From Pit Set)-enTc.mp3\nMax Graham - The Evil ID (ID Remix) (Cut From Graham Set)-enTc.mp3\nMF Superstars feat. Danni Rouge - Like Satellites (Sephano And Torio Remix) (Cut From Anderson Set)-enTc.mp3\nMoonsouls - Summer Girl (Original Mix) (Cut From Misja Set)-enTc.mp3\nMostfa Mohamed - Dark Vision (Nab Brothers Remix) (Cut From Anderson Set)-enTc.mp3\nMostfa Mohamed - Sunset On The Beach (Cla6 Remix) (Cut From Anderson Set)-enTc.mp3\nMr FijiWiji &amp; Tlpa - Sentient (Original Mix) (Cut From BT Set)-enTc.mp3\nNicholas Bennison  Shattered-Angles (Cut From Lawrence Set)-enTc.mp3\nNico Parisi - Caress (Philthy Chit Remix) (Cut From Solarstone Set)-enTc.mp3\nNorth Sunset - Summer Walk (Ennis Remix) (Cut From Velden Set)-enTc.mp3\nOliver &amp; Tom - Three Headed Monkey (Farzam Remix) (Cut From Romel Set)-enTc.mp3\nOzgur Ozkan - Cranberry Effect (Rikesto Remix) (Cut From Barone Set)-enTc.mp3\nPaul Miller vs Sebastian Sachov - Together (Pierre Pienaar Remix) (Cut From Suzy Set)-enTc.mp3\nPaul Miller vs. Sebastian Sachov - Together (Original Mix) (Cut From Bobina Set)-enTc.mp3\nQ-W-E-R-T-Y - Screenshot (Daniel Skyver Remix) (Cut From Saux Set)-enTc.mp3\nQ-W-E-R-T-Y - Screenshot (Vlind Remix) (Cut From Nadz Set)-enTc.mp3\nRoald Velden - Last Flight Home (Morrison Kiers Remix) (Cut From Velden Set)-enTc.mp3\nRuben De Ronde - They Are Not You (Gai Barone Remix) (Cut From Barone Set)-enTc.mp3\nRuben de Ronde - They Are Not You (Gai Barone Warmup Remix) (Cut From Ruben Set)-enTc.mp3\nRuben de Ronde - They Are Not You (Nic Toms Remix) (Cut From Ruben Set)-enTc.mp3\nSchodt - Yours Truly (Cut From Ruben Set)-enTc.mp3\nSean Flesh - The Rush (-Sample-  From Ruben Set)-enTc.mp3\nSolarstone feat. Lemon - Lovers (Giuseppe Ottaviani Remix) (Cut From Solarstone Set)-enTc.mp3\nSug J feat. 227 - Lodestar (Andross Berger Remix) (Cut From Anderson Set)-enTc.mp3\nTuneflux - Brink Of Time (Paul Pele Revival Remix) (Cut From Romel Set)-enTc.mp3\nUmmet Ozcan - ReBox (Max Graham Reconstruction) (Cut From Graham Set)-enTc.mp3\nVolkan Erman &amp; Sonsez - Imagination (Cut From Barone Set)-enTc.mp3\nWhey Baq - Love For The Streets (Instrumental Mix) (Cut From Solarstone Set)-enTc.mp3\n","torrent":{"xt":"urn:btih:8302369b8cfe672d34dc5469f5fd146dd0a71a7f","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+December+12th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8302369b8cfe672d34dc5469f5fd146dd0a71a7f","infoHashBuffer":{"type":"Buffer","data":[131,2,54,155,140,254,103,45,52,220,84,105,245,253,20,109,208,167,26,127]},"announce":[],"urlList":[]}}