{"title":"Darwin Among the Machines by George Dyson","uid":9368098,"size":2841705,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8585a81ceaaf951163de2acc063112328a75ae96&amp;dn=Darwin+Among+the+Machines+by+George+Dyson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"420weedman","files":4,"time":1387468783,"description":"As timely now as it was when it was first published in 1997, &quot;Darwin Among the Machines&quot; tells the story of humankind's long journey into the digital age. Historian of technology George Dyson traces the course of the information revolution, illuminating the lives and work of visionaries--from Thomas Hobbes to John von Neumann--who foresaw the development of artificial intelligence, artificial life, and artificial mind. Weaving a convincing, occasionally frightening narrative of the evolution of the global network, Dyson explores the limits of Darwinian evolution to suggest what lies ahead. Computer programs and worldwide networks are combining to produce an evolutionary theater in which the distinctions between nature and technology are increasingly obscured, he argues. We are living in the midst of an experiment--one that echoes the prehistory of human intelligence and the origins of life. Now in a new paperback edition, this classic work on the emergence of collective mechanical intelligence will resonate for generations to come.","torrent":{"xt":"urn:btih:8585a81ceaaf951163de2acc063112328a75ae96","amp;dn":"Darwin+Among+the+Machines+by+George+Dyson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8585a81ceaaf951163de2acc063112328a75ae96","infoHashBuffer":{"type":"Buffer","data":[133,133,168,28,234,175,149,17,99,222,42,204,6,49,18,50,138,117,174,150]},"announce":[],"urlList":[]}}