{"title":"Need For Speed - Shift by relentlesstech (2009)","uid":9342193,"size":5818119624,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8607013eeda9ba5aae57e563989fab7418cb2569&amp;dn=Need+For+Speed+-+Shift+by+relentlesstech+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"relentlesstech","files":-1,"time":1386956450,"description":"Need for Speed: Shift was developed by Slightly Mad Studios, released on September 15, 2009, primarily centers around legal races in real-life racing circuits around the world, and maintain its mix of exotic, import and muscle cars.\n\nIt features over 60 cars, divided into 4 tiers. It features 19 tracks, some of which are actual licensed tracks and others which are fictional. In addition to improved driving simulation and an adaptive difficulty, the game reintroduces cockpit view, the first in the series since Need for Speed: Porsche Unleashed. NFS: Shift focuses on racing simulation rather than arcade racing of previous titles. The car featured on the cover page is a BMW E92 M3 GT2.\n\nNFS: Shift received better reviews than the last 3 games in the series, Carbon, ProStreet and Undercover. It gained a 9.0 rating from IGN and the Official Xbox Magazine, while it gained a 7.0 from Eurogamer and GameSpot, who were considerably less impressed. The reviewers generally praised the in-car view of the game and its sense of speed, while most of the criticism revolved around the drift aspect of NFS: Shift.","torrent":{"xt":"urn:btih:8607013eeda9ba5aae57e563989fab7418cb2569","amp;dn":"Need+For+Speed+-+Shift+by+relentlesstech+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8607013eeda9ba5aae57e563989fab7418cb2569","infoHashBuffer":{"type":"Buffer","data":[134,7,1,62,237,169,186,90,174,87,229,99,152,159,171,116,24,203,37,105]},"announce":[],"urlList":[]}}