{"title":"[Coursera] Logic - Language and Information 1","uid":10262718,"size":926591813,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:879de02a3d80ec4c0a42bf1536f0a9b66b3fb0fa&amp;dn=%5BCoursera%5D+Logic+-+Language+and+Information+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"rndNbr","files":169,"time":1401484663,"description":"LOGIC: LANGUAGE AND INFORMATION 1\n******************************************************\nTaught by Greg Restall and Jen Davoren\nPublished by the University of Melbourne and Coursera\nCompiled by the Free Library and Uploaded by rndNbr in April 2014\n\n======================================================\n\nThank you for downloading this educational resource. If you are satisfied with it, I only ask you to seed its torrent or pass it on in some way for someone else's use.\n\nIf you have any requests, comments, questions, or suggestions, if you would like information on other free educational resources, or if you would like to contribute, please contact us at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;47213522222b2e253526353e07222a262e2b6924282a69&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nIf you would like to donate, support free education by donating to Khan Academy:\n &lt;a href=&quot;\nhttp://khanacademy.org/donate&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://khanacademy.org/donate&lt;/a&gt;\n\nThank you.\n\nThe Free Library\n\n======================================================\n\nThis course includes the video lectures (MP4), their subtitles (SRT), transcripts (TXT), and any lecture resources that were provided by the professor(s).\n\n======================================================\n\nThis is version 001 of this course. It ended in March/April 2014.\n\nThis is an introduction to formal logic and how it is applied in computer science, electronic engineering, linguistics and philosophy. You will learn propositional logicÂ—its language, interpretations and proofs, and apply it to solve problems in a wide range of disciplines.\n\nInformation is everywhere: in our words and our world, our thoughts and our theories, our devices and our databases. Logic is the study of that information: the features it has, how itÂ’s represented, and how we can manipulate it. Learning logic helps you formulate and answer many different questions about information:\n\n- Does this hypothesis clash with the evidence we have or is it consistent with the evidence?\n- Is this argument watertight, or do we need to add more to make the conclusion to really follow from the premises?\n- Do these two sentences say the same things in different ways, or do they say something subtly different?\n- Does this information follow from whatÂ’s in this database, and what procedure could we use to get the answer quickly?\n- Is there a more cost-effective design for this digital circuit? And how can we specify what the circuit is meant to do so we could check that this design does what we want?\n\nThese are questions about Logic. When you learn logic you'll learn to recognise patterns of information and the way it can be represented. These skills are used whether we're dealing with theories, databases, digital circuits, meaning in language, or mathematical reasoning, and they will be used in the future in ways we haven't yet imagined. Learning logic is a central part of learning to think well, and this course will help you learn logic and how you can apply it.\n\nIf you take this subject, you will learn how to use the core tools in logic: the idea of a formal language, which gives us a way to talk about logical structure; and we'll introduce and explain the central logical concepts such as consistency and validity; models; and proofs. But you wonÂ’t only learn concepts and tools. We will also explore how these techniques connect with issues in linguistics, computer science, electronic engineering, and philosophy. \n\nMore information about this course is available at https://coursera.org/course/logic1\n","torrent":{"xt":"urn:btih:879de02a3d80ec4c0a42bf1536f0a9b66b3fb0fa","amp;dn":"%5BCoursera%5D+Logic+-+Language+and+Information+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"879de02a3d80ec4c0a42bf1536f0a9b66b3fb0fa","infoHashBuffer":{"type":"Buffer","data":[135,157,224,42,61,128,236,76,10,66,191,21,54,240,169,182,107,63,176,250]},"announce":[],"urlList":[]}}