{"title":"Doctor Who Season 6 (2011, season 32)","uid":9338395,"size":4758577152,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:87a90c79c8d42b66461b8311aca8f68643688b14&amp;dn=Doctor+Who+Season+6+%282011%2C+season+32%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"CaveJohnsonWithLemons","files":13,"time":1386886095,"description":"-Episonde List-\n \n1.The Impossible Astronaut - Amy, Rory and River mourn the Doctor, but are soon plunged into an adventure.\n\n2. Day of the Moon - The Doctor fights an alien invasion dating back to the beginnings of human civilisation.\n\n3. The Curse of the Black Spot - There's terror on the high seas, as the Doctor is stranded on a pirate ship.\n\n4. The Doctor's Wife - By following a Time Lord distress signal, the Doctor endangers Amy, Rory and the TARDIS.\n\n5. The Rebel Flesh - A solar tsunami liberates doppelgangers from their human 'originals'.\n\n6. The Almost People - The Doctor must convince terrified factory workers to trust their doppelgangers.\n\n7. A Good Man Goes to War - The Doctor assembles an alien army to fight the Battle of Demon's Run.\n\n8. Let's Kill Hitler - Nazis! River on the rampage! Regeneration! The TARDIS crash-lands in 1930s Berlin.\n\n9. Night Terrors - The Doctor faces giant dolls as he fights to help a terrified child and his father.\n\n10. The Girl Who Waited - Amy is trapped in a quarantine facility for victims of an alien plague. Can Rory save her?\n\n11. The God Complex - The TARDIS lands in a hotel where every visitor's room contains their biggest fears.\n\n12. Closing Time - The Doctor's death is near, and the Cybermen are waiting for him below a department store.\n\n13. The wedding of River Song - All of time and space hangs in the balance, for this is the day the Doctor dies.","torrent":{"xt":"urn:btih:87a90c79c8d42b66461b8311aca8f68643688b14","amp;dn":"Doctor+Who+Season+6+%282011%2C+season+32%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87a90c79c8d42b66461b8311aca8f68643688b14","infoHashBuffer":{"type":"Buffer","data":[135,169,12,121,200,212,43,102,70,27,131,17,172,168,246,134,67,104,139,20]},"announce":[],"urlList":[]}}