{"title":"Battlefield.4.Update.4-RELOADED","uid":9360863,"size":800626625,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:87e7dc80da818a88a3e44143fa18f30f744af46a&amp;dn=Battlefield.4.Update.4-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mr.Stifmeister","files":6,"time":1387315572,"description":"\n                                      nERv\n\n\n               Battlefield 4 Update 4 (c) Electronic Arts UK\n\n         12/2013 :..... RELEASE.DATE .. PROTECTION .......: EADRM\n               - :.......... DISC(S) .. GAME.TYPE ........: Action, FPS\n\n\nNote:\n~~~~~\nYou do not need any other updates for this release. Changelog included in\nthe pack, check it for a list of whats new.\n\n--\n\nBattlefield 4 is the genre-defining action blockbuster made from\nmoments that blur the line between game and glory. Fueled by the\nnext-generation power and fidelity of Frostbite 3, Battlefield 4\nprovides a visceral, dramatic experience unlike any other.\n\nOnly in Battlefield can you demolish the buildings shielding your enemy.\nOnly in Battlefield will you lead an assault from the back of a gun\nboat. Battlefield grants you the freedom to do more and be more while\nplaying to your strengths and carving your own path to victory.\nIn addition to its hallmark multiplayer, Battlefield 4 features an\nintense, dramatic character-driven campaign that starts with the\nevacuation of American VIPs from Shanghai and follows your squads\nstruggle to find its way home.\nThere is no comparison. Immerse yourself in the glorious chaos of\nall-out war, found only in Battlefield.\n\nKey Features:\nOnly in Battlefield can you experience Levolution, changing the\nlandscape in real-time with interactive environments that react to your\nevery move.\nOnly in Battlefield will you find the awe-inspiring power of the\nnext generation Frostbite  3 engine, whose unrivaled audio and visual\nfidelity make your game more dramatic, more believable, and more human.\nOnly in Battlefield can you experience an unmatched level of all-out\nwar that grants you the freedom to play to your strengths and carve your\nown path to victory.\nOnly in Battlefield do you have the power to dominate land, air and\nsea with all-new, intense water-based vehicle combat.\n\n\n1. Unrar.\n2. Install the update to where you installed the game. Previous updates are\n   not needed. If the installer prompts you about read-only files, overwrite\n   or ignore them.\n3. Copy over the cracked content from the /Crack directory in the update to\n   your game install directory.\n4. Play the game.\n5. Support the software developers. If you like this game, BUY IT!\n\nNOTE: As always, ignore it if the game or Origin requests that you go\nonline. Better yet, uninstall Origin.\n","torrent":{"xt":"urn:btih:87e7dc80da818a88a3e44143fa18f30f744af46a","amp;dn":"Battlefield.4.Update.4-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87e7dc80da818a88a3e44143fa18f30f744af46a","infoHashBuffer":{"type":"Buffer","data":[135,231,220,128,218,129,138,136,163,228,65,67,250,24,243,15,116,74,244,106]},"announce":[],"urlList":[]}}