{"title":"Shufflepuck Cantina Deluxe MULTI5-ALiAS","uid":9323455,"size":60488245,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:87f8cede33f57ae96fcce6a49b4f3607cd3ee394&amp;dn=Shufflepuck+Cantina+Deluxe+MULTI5-ALiAS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"AN0NYMOUS142857","files":7,"time":1386548592,"description":"RELEASE\niNFOS\n\nShufflepuck Cantina Deluxe\n(c) Kalypso Media Digital\n\nRipped: Steam Release date: 8/12/2013\nFiles: 06x10.00MB Language: DE/EN/ES/FR/IT\n\nRELEASE\nNOTES\n\nStory\n\nAfter &quot;accidentally&quot; jumping your spaceship through a wormhole, you've cr\nash landed onto this forsaken desert planet a billion kilometers from hom\ne. The only thing between you and the horizon is the seemingly endless du\nnes of sand, save for one strange, huge building. Inside, it appears to b\ne an interstellar Casino where everyone plays air hockey for a living\n\nYou'll have to fight hard to grind down all your opponents until they are\nutterly defeated to earn the critical parts needed to repair your ship\nOnce you've obtained all the spaceship pieces you'll have to defeat the o\nwner of this insane Casino so you can go home\n\n* A totally unique world populated by colorful characters in this\natmosph eric Space Western!\n* Face 16 opponents in frantic and spectacular air hockey matches!\n* Relax and take your chances at the prize machine!\n* Hundreds of hours of addictive gameplay!\n\nBackstory\n\nShufflepuck Cantina Deluxe is the first desktop game developed by indie g\name developer Agharta Studio, a small 4 people team. It was developed as\nan homage to the critically acclaimed Shufflepuck Caf released in 1989 b\ny Christopher Gross, Gene Portwood, and Lauren Elliott. Strangely there h\nasn't been a worthy successor for 25 years, so we decided to make one. Th\nis game is actually endorsed by Christopher Gross himself!\n\nFeatures list\n\nGameplay\n* Obliterate 16 fully animated opponents!\n* Battle in six different tournaments!\n* Fight your way to the top and defeat the mysterious &quot;Director&quot;!\n* Collect all the junk, er spaceship parts to finish the game!\n* 500 unique Missions to keep you entertained (Beats playing Minesweeper!)\n* 200 Experience Levels with unique Perks!\n* 300 Characters Bios to unlock! (For the obsessive-compulsives!)\n* Possess your opponents to learn their special strikes!\n* Grind for Credz to unlock new floors and earn tons of equipment!\n* 150 Mini-Quests! (Learn more about your opponents' back-stories!)\n* 70 Steam Achievements! (Bragging rights amongst your hipster friends!)\n\nTechnology\n* Seven gorgeous 3D environments! (Eye candy is important guys!)\n* Incredible and awesome homemade 3D engine! (Insert your own superlative\ns here!)\n* No loading times!!! Ultra optimized performances!\n* Deferred shading! (To appeal to the hardcore nerds!)\n* Dynamic light system! (Lights can move and stuff...)\n* Complex shaders using normal maps, specular maps, self-illum maps, etc\n* Real-time full screen post effects, blur, depth of field, etc\n* English, French, German, Italian and Spanish languages! (more to come\nif you stay classy in the comment section)\n* Steam Leaderboard compatibility!\n* Modeled, textured, rigged, and animated with Blender (We are an indie\nafter all...)\n\nNOTES\n\n1. Extract\n2. Run installer\n3. Copy over crack to where you installed\n3. Have fun!\n\nNote: to change language, edit the file &quot;steam_rld.ini&quot; if needed\nLanguages: english, german, french, italian, spanish\n\nSupport the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:87f8cede33f57ae96fcce6a49b4f3607cd3ee394","amp;dn":"Shufflepuck+Cantina+Deluxe+MULTI5-ALiAS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87f8cede33f57ae96fcce6a49b4f3607cd3ee394","infoHashBuffer":{"type":"Buffer","data":[135,248,206,222,51,245,122,233,111,204,230,164,155,79,54,7,205,62,227,148]},"announce":[],"urlList":[]}}