{"title":"Babybird - There's Something Going On [1998]","uid":9364626,"size":418292985,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:886e548a2ca8799a35240d7cd2cfcd2e1f0f95b3&amp;dn=Babybird+-+There%27s+Something+Going+On+%5B1998%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GenXRock","files":-1,"time":1387388618,"description":"There's Something Going On is the least catchy of Stephen Jones' hi-fi Baby Bird albums. The only song suggesting the pop charm of &quot;You're Gorgeous&quot; is &quot;If You'll Be Mine,&quot; a beautiful minor ballad. The album is almost unrelentingly dark and mysterious, in much the same manner as his earlier lo-fi productions. Indeed, two of the tracks here, &quot;You Will Always Love Me&quot; and &quot;There's Something Going On,&quot; were recorded straight to four-track. Jones' voice echoes out of lyrical valleys that suggest he's quite disturbed when it comes to relationships and life in general. &quot;Take Me Back&quot; is a horrific tale of an obsessive relationship, with lyrics about eyeballs scratched with rusty nails and a creepy chant of &quot;dead, dead, dead&quot; ad infinitum. It's a conceit that starts with the very first track, &quot;Bad Old Man,&quot; where Jones sings of wife-beaters and a drowning in a duck pond. Musically, the album is more of a lean toward the baroque than Ugly Beautiful. One might describe it as stark, disturbed chamber pop. Beautiful melodies appear quite majestically out of Jones' psychological studies. &quot;It's Not Funny Anymore&quot; is bittersweet and touching, with Jones reaching for the album's emotional core over weeping, organic keyboards. &quot;There's Something Going On&quot; is the tender conclusion, suggesting that Jones knows there's a better way of life than obsession and self-torture. There's Something Going On is definitely Baby Bird's most subtle album, and it's a fascinating listen from start to finish. (4/5)","torrent":{"xt":"urn:btih:886e548a2ca8799a35240d7cd2cfcd2e1f0f95b3","amp;dn":"Babybird+-+There%27s+Something+Going+On+%5B1998%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"886e548a2ca8799a35240d7cd2cfcd2e1f0f95b3","infoHashBuffer":{"type":"Buffer","data":[136,110,84,138,44,168,121,154,53,36,13,124,210,207,205,46,31,15,149,179]},"announce":[],"urlList":[]}}