{"title":"Revolution.2012.S02E07.mp4","uid":9359092,"size":233225924,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8afa59898f767112700060560a3e0ae7fa35ffa6&amp;dn=Revolution.2012.S02E07.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ziggi1000","files":1,"time":1387271672,"description":" &quot;The Patriot Act&quot;  November 6, 2013 \n\nMonroe is dug out of his grave by Rachel, having been heavily drugged to make him appear dead. He rehabilitates in a farmhouse outside of town. Dr. Horn, science advisor to the Patriots, arrives, having been drawn by news of Rachel's presence and strange happenings that have occurred since her arrival. He is implied throughout the episode to have a dark sadistic side. With the help of Gene, Dr. Horn learns that Aaron was the cause of the strange happenings, including the spontaneous combustion of two soldiers. Miles and company are aware of Dr. Horn's interest in Aaron and conspire to help him escape town. Aaron won't leave town without his girlfriend, who ultimately agrees to come with him. Gene agrees to help Aaron escape, but is coerced by the Patriots into setting up his capture. Miles on a hunch observes Gene aiding the Patriots which devastates Rachel. When Aaron fails to arrive at the rendezvous, the Patriots realize Gene's cover is blown. They lock down the town and aggressively search house to house. Aaron and company make for a sewer line that leads out of town and barely escape. At the end of the tunnel, they are confronted by Patriot soldiers, but are suddenly helped by Monroe. However, in the fighting, Aaron's girlfriend is attacked by a soldier, triggering another nanotech attack by Aaron. As they walk to safety with Monroe, Aaron's girlfriend is terrified of him. Somewhere on the east coast, Neville and Allenford are hiding out as Jason wakes up. The drugs are continuing to flush out of his system, but his trustworthiness is still questioned by Allenford. After getting ambushed by Patriot cadets, Jason seemingly betrays both Neville and Allenford. Instead, he kills their attackers and offers the knife he used to his father. Allenford wants to try to reclaim her son in Cincinatti after Jason helps, but is unexpectedly drugged by Neville. She awakens to handcuffs, and is questioned by Neville about the location of her husband.\n ","torrent":{"xt":"urn:btih:8afa59898f767112700060560a3e0ae7fa35ffa6","amp;dn":"Revolution.2012.S02E07.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8afa59898f767112700060560a3e0ae7fa35ffa6","infoHashBuffer":{"type":"Buffer","data":[138,250,89,137,143,118,113,18,112,0,96,86,10,62,10,231,250,53,255,166]},"announce":[],"urlList":[]}}