{"title":"Bump - Bump (1970) [FLAC] ","uid":9303629,"size":218417070,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8b6c37a4642b68d18097feb41927d48648fadcb6&amp;dn=Bump+-+Bump+%281970%29+%5BFLAC%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":6,"time":1386280882,"description":"Bump - Bump (1970)\n\nGenre: US, Psychedelic Rock\n\nTracklist:\n\n1. Sing Into The Wind\n2. State Of Affairs\n3. Daydream Song\n4. Holly Thorndike\n5. Got To Get You Back\n6. Spider's Eyes\n7. Clean Myself\n8. From My Slot\n9. Lifelines, Decisions, You Can't Even Think\nBonus tracks:\n10. Winston Built The Bridge (From The Pioneer 45&quot; 1969)\n11. Sing Into The Wind (From The Pioneer 45&quot; 1969)\n\nPersonel:\nAlan Goldman - guitar\nJerry Greenberg - drums, vocals\nPaul Lupien - keyboards, vocals\nGeorge Runyan - lead vocals, bass\n\nNot one of the more interesting period artifacts from the Detroit rock scene of the late '60s and early '70s, Bump took after neither the thrilling proto-punkish heavy rock of state mates the MC5 and the Stooges nor the raucous blue-eyed rock &amp; soul of the Rationals and Mitch Ryder, and there are no hints of a Motown influence. Too bad on all counts, because, instead, the band opts for a psychedelicized brand of minor-key pop/rock with progressive flourishes that wants to be eerie but just as often comes off flat and uninspired. For the most part, the songs are just not there. There are a few things on this CD reissue of Bump's only album that could be construed as quaint reminders of a bygone era, even if they ultimately only act as reminders of how much better the best first- and second- (even third-) tier bands from that period were. Nevertheless, the brief snippet &quot;Holly Thorndike&quot; is so adorably twee and prissy it could have come off an early Bee Gees record (but only if it were better produced, performed, and recorded), and who knows how songs such as &quot;Daydream Song&quot; and &quot;Spider's Eyes&quot; may have come off in a smoke- and incense-choked room or through the filter of a swirling acid haze. Bump tries hard to be atmospheric, to work the same ominous side of the pop spectrum as the Doors and Procol Harum, and in that respect the album means well, but it's also derivative and completely cheesy faux psych-pop -- not the real thing at all, even though it pastes on the fuzz guitar and echo and every other sordid effect it can find. More often than not, the paper-thin organ riffs sound more roller-rink than ballroom, and the melodies more merry-go-round than psychedelic, and after only a few songs, George Runyan's expressiveless voice -- and hence the album that it carries just turns hopelessly grating.\n","torrent":{"xt":"urn:btih:8b6c37a4642b68d18097feb41927d48648fadcb6","amp;dn":"Bump+-+Bump+%281970%29+%5BFLAC%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b6c37a4642b68d18097feb41927d48648fadcb6","infoHashBuffer":{"type":"Buffer","data":[139,108,55,164,100,43,104,209,128,151,254,180,25,39,212,134,72,250,220,182]},"announce":[],"urlList":[]}}