{"title":"Gene - Drawn to the Deep End [1997]","uid":9371977,"size":366928115,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8ea604d19486ec898b0aaf2263cb5c9f334b5858&amp;dn=Gene+-+Drawn+to+the+Deep+End+%5B1997%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GenXRock","files":-1,"time":1387549384,"description":"Gene thrashes all over the place on their second album Drawn to the Deep End, as if they were anxious to shake off any comparison to the Smiths. Opening with the textured, near-art-rock of &quot;New Amusements&quot; and moving into the revamped pop-soul stomp of &quot;Fighting Fit,&quot; the record initially doesn't sound like the tragically doomed bed-sit pop of Olympian, and it seems like Drawn to the Deep End might be a great leap forward. Unfortunately, Gene doesn't quite have the vision to carry through with their promise. Quite a few cuts kick with either a self-determined drive (&quot;Speak to Me Someone&quot;) or a sense of tragic grace (&quot;Where Are They Now?&quot;) or, at best, both, like on &quot;We Could Be Kings.&quot; But the band quickly becomes victims of their own ambition and botched execution. The record becomes bogged down with turgid ballads or failed experiments that come off as weak art-rock. Still, the Queen-styled chorus of &quot;I Love You, What Are You?&quot; are charming, and it is endearing to hear the band try so hard to move forward, but the lack of focus makes the album less affecting than the hero-worship of Olympian. (2.5/5)","torrent":{"xt":"urn:btih:8ea604d19486ec898b0aaf2263cb5c9f334b5858","amp;dn":"Gene+-+Drawn+to+the+Deep+End+%5B1997%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ea604d19486ec898b0aaf2263cb5c9f334b5858","infoHashBuffer":{"type":"Buffer","data":[142,166,4,209,148,134,236,137,139,10,175,34,99,203,92,159,51,75,88,88]},"announce":[],"urlList":[]}}