{"title":"Deborah Sharp - Mace Bauer Mystery Series","uid":9362664,"size":5933156,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8ecab8b5dee3782974f231fcc8876a2f09b04190&amp;dn=Deborah+Sharp+-+Mace+Bauer+Mystery+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1387351593,"description":"About the author \nLike the main character in her funny, Southern-flavored mysteries, Deborah's roots were set in Florida long before Disney and ''Miami Vice.'' A native and former reporter for USA Today, she knows spots not found on maps: Molasses Junction. Muse. And now, Himmarshee, her own slice of Authentic Florida. \nIt's the setting for her Mace Bauer Mysteries, featuring Mace's wacky ''Mama.'' To create it, Deborah borrowed from the present-day ranching town of Okeechobee, and from the south Florida of her family's past. Deborah left a Ph.D. program in psychology to become a reporter, and then left the news biz to write light-hearted fiction.\n\n#1 Mama Does Time: A Mace Bauer Mystery...\t\nMeet Mama: a true Southern woman with impeccable manners, sherbet-hued pantsuits, and four prior husbands, able to serve sweet tea and sidestep alligator attacks with equal aplomb. Mama's antics - especially her penchant for finding trouble - drive her daughters Mace, Maddie and Marty to distraction. \n\nOne night, while settling in to look for ex-beaus on COPS, Mace gets a frantic call from her mother. This time, the trouble's for real: Mama found a body in the trunk of her vintage convertible, and the police think she's the killer. It doesn't help that the handsome detective assigned to the case seems determined to prove Mama's guilt, or that the cowboy who broke Mace's heart shows up at the local Booze 'n' Breeze in the midst of the investigation. Before their mama lands in prison - just like an embarrassing lyric from a country-western song - Mace and her sisters must find the real culprit.\n\nMAMA DOES TIME is a traditional mystery with a comedic edge: Agatha Christie meets &quot;My Name is Earl.''\n\nPenned by a native Floridian, set in cattle-and-citrus country, the story reveals an authentic slice of the state. Everyone knows Disney World and sexy South Beach. But how many know Florida's ranches, rodeo, and Southern-fried flavor, just fifty miles from the coast?\n\n#2 Mama Rides Shotgun: A Mace Bauer Mystery...\t\nBefore Mama ties the sacred knot of matrimony for the 5th time, she coerces daughter Mace to saddle up for some country-gal bonding on the Florida Cracker Trail. The six-day trek gets off to a good start. At least until the wealthy rancher hosting the riders keels over in his Cow Hunter Chili.\n\nA one-time beau of Mama's (and, really, who isn't?) Lawton Bramble had a bad ticker and a ton of enemies who might have &quot;spiced&quot; the cattleman's chili. Was it son Trey, as flawed as he is handsome? The young widow, whose grief seems well-rehearsed? Or maybe the childhood friend, wronged by Lawton in love and business?\n\nMace's worried sisters join the ride, and sexy Detective Carlos Martinez returns to complicate matters. But Mace's miserable love life pales as a problem next to a planted rattlesnake, a tent sliced to shreds, and a spooked horse named Shotgun. When Mama gallops into danger, Mace is determined to corral the killer stalking the Florida trail.\n\n#3 Mama Gets Hitched - A Mace Bauer Mystery \nIt may be Mama's fifth try at tying the sacred knot, but that's no reason to tastefully scale back. She's planning the Wedding of the Century in little Himmarshee, Fla. - complete with a &quot;Gone With the Wind&quot; theme, her daughters in Scarlett O'Hara dresses, and a ring-bearing Pomeranian sporting a satin vest and top hat.\n\n#4 Mama Sees Stars - A Mace Bauer Mystery \nWhen a film crew comes a'callin on little Himmarshee, Mace snags a job as animal wrangler. Mama is sure this cowboy flick will be her own ticket to Hollywood. The Left Coasters are out of their element: No vanilla lattes or yoga studios. Hotter outside than a Santa Ana. Mosquitoes as big as Gulfstream jets.\n\nThe locals think the film folk are nuttier than squirrels at a peanut festival. But make-believe turns to murder when Mace finds the movie's producer shot and strung up at the horse corral. Who in blue blazes DIDN'T want to kill the much-hated executive? Mama's role might be miniscule, but her head swells to superstar proportions. When evil starts stalking the cast, Mama might just become one dead diva.\nBut what's a bridezilla to do when her caterer is fatally stabbed in the VFW kitchen? With a suspect list as long as the bride's gift registry, daughter Mace must find the real killer before Mama's Special Day turns especially deadly.\n\n#5 Mama Gets Trashed - A Mace Bauer Mystery \nWhen Mace stumbles upon the dead body of Camilla Law at the dump, the Bible-loving town is scandalized, but not because there's a killer on the loose. Camilla, the young prudish librarian, was found in a leather getup that screams sex fetish--good gravy! While Mace secretly investigates her brother-in-law, who's running around with another lady, she uncovers salacious information about a circle of bondage fanatics that makes Mama blush pinker than her favorite wine.","torrent":{"xt":"urn:btih:8ecab8b5dee3782974f231fcc8876a2f09b04190","amp;dn":"Deborah+Sharp+-+Mace+Bauer+Mystery+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ecab8b5dee3782974f231fcc8876a2f09b04190","infoHashBuffer":{"type":"Buffer","data":[142,202,184,181,222,227,120,41,116,242,49,252,200,135,106,47,9,176,65,144]},"announce":[],"urlList":[]}}