{"title":"Liberal Fascism: The Secret History of the American Left Jonah","uid":9299169,"size":2299268,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8eda6423ac14c0fb97948bcf83fcc76398262cac&amp;dn=Liberal+Fascism%3A+The+Secret+History+of+the+American+Left+Jonah&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"junkbond","files":-1,"time":1386213883,"description":"&quot;Fascists&quot;,&quot;Brownshirts&quot;,&quot;jackbooted stormtroopers&quot; such are the insults typically hurled at conservatives by their liberal opponents. Calling someone a fascist is the fastest way to shut them up, defining their views as beyond the political pale. But who are the real fascists in our midst?\n\nLiberal Fascism offers a startling new perspective on the theories and practices that define fascist politics. Replacing conveniently manufactured myths with surprising and enlightening research, Jonah Goldberg reminds us that the original fascists were really on the left, and that liberals from Woodrow Wilson to FDR to Hillary Clinton have advocated policies and principles remarkably similar to those of Hitler's National Socialism and Mussolini's Fascism.\n\nContrary to what most people think, the Nazis were ardent socialists (hence the term &quot;National socialism&quot;). They believed in free health care and guaranteed jobs. They confiscated inherited wealth and spent vast sums on public education. They purged the church from public policy, promoted a new form of pagan spirituality, and inserted the authority of the state into every nook and cranny of daily life. The Nazis declared war on smoking, supported abortion, euthanasia, and gun control. They loathed the free market, provided generous pensions for the elderly, and maintained a strict racial quota system in their universities where campus speech codes were all the rage. The Nazis led the world in organic farming and alternative medicine. Hitler was a strict vegetarian, and Himmler was an animal rights activist.\n\nDo these striking parallels mean that today's liberals are genocidal maniacs, intent on conquering the world and imposing a new racial order? Not at all. Yet it is hard to deny that modern progressivism and classical fascism shared the same intellectual roots. We often forget, for example, that Mussolini and Hitler had many admirers in the United States. W.E.B. Du Bois was inspired by Hitler's Germany, and Irving Berlin praised Mussolini in song. Many fascist tenets were espoused by American progressives like John Dewey and Woodrow Wilson, and FDR incorporated fascist policies in the New Deal.\n\nFascism was an international movement that appeared in different forms in different countries, depending on the vagaries of national culture and temperament. In Germany, fascism appeared as genocidal racist nationalism. In America, it took a &quot;friendlier&quot; more liberal form. The modern heirs of this &quot;friendly fascist&quot; tradition include the New York Times, the Democratic Party, the Ivy League professoriate, and the liberals of Hollywood. The quintessential Liberal Fascist isn't an SS storm trooper; it is a female grade school teacher with an education degree from Brown or Swarthmore.\n\nThese assertions may sound strange to modern ears, but that is because we have forgotten what fascism is. In this angry, funny, smart, contentious book, Jonah Goldberg turns our preconceptions inside out and shows us the true meaning of Liberal Fascism.","torrent":{"xt":"urn:btih:8eda6423ac14c0fb97948bcf83fcc76398262cac","amp;dn":"Liberal+Fascism%3A+The+Secret+History+of+the+American+Left+Jonah","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8eda6423ac14c0fb97948bcf83fcc76398262cac","infoHashBuffer":{"type":"Buffer","data":[142,218,100,35,172,20,192,251,151,148,139,207,131,252,199,99,152,38,44,172]},"announce":[],"urlList":[]}}