{"title":"Up Your Ass #22 - DVDRip","uid":9417159,"size":7164633519,"categoryP":"porn","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8f646410603ebac49bbc1d9f33973040cdc36d83&amp;dn=Up+Your+Ass+%2322+-+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"real_epi","files":-1,"time":1388480481,"description":"They Say:\n\nThe UP YOUR ASS series is one of the most demanding sexual challenges a girl can subject herself to! Su proudly introduces covergirl and authentic rookie Teagan to her first anal scene and satisfies her quest for cum with 2 pop shots! Natural breasted, Bouncy, bubbly, blond Maxine from UYA 21 is back for more; this time she gives up her first DP to the thick-dicked duo of Mr. Marcus and Joachim. She takes her first DP just like the whore she was born to be. After all a girl has to get her self-esteem somewhere! Sphincter stretched, sultry sluts Katsumi and Roxy Jezel are two of the hottest Asians in recent porn history! Mr. Marcus' prayers were answered by being cast in an A2M anal extravaganza with these two beauties! The Cock craving, cum eating, Nymphoniac girls in this movie take all the Ass-pounding our Mammouth, Monster-cocked, Mandingo styled, sphincter-stretching swordsman can dish out! These whores subject their nubile, ripe, luscious bodies to a veriable barrage of Big Black spew blasting cock! We have provided an arena where these young ladies can literally test their sexual endurance! All this thanks to the Vision of Anabolic's most dedicated director -Su\n\nI say:\nUnfortunately this DVD is now out of print and I had to purchase it for about â‚¬95 on adultdvdmarketplace.com. Fortunately for you I am not a stingy person and I am sharing it with all of you!!!\n\nStarring:\nMaxine\nTeagan\nJessica Darlin\nJessica Sweet\nBella Marie Wolfe\nBritney Madison\nRoxy Jezel\nKatsumi","torrent":{"xt":"urn:btih:8f646410603ebac49bbc1d9f33973040cdc36d83","amp;dn":"Up+Your+Ass+%2322+-+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f646410603ebac49bbc1d9f33973040cdc36d83","infoHashBuffer":{"type":"Buffer","data":[143,100,100,16,96,62,186,196,155,188,29,159,51,151,48,64,205,195,109,131]},"announce":[],"urlList":[]}}