{"title":"The Real James Herriot A Memoir of My Father by Jim Wight","uid":9364250,"size":5183433,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:906753bfc9766aa54b9bb6c114bf6879a1909d12&amp;dn=The+Real+James+Herriot+A+Memoir+of+My+Father+by+Jim+Wight&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"420weedman","files":4,"time":1387382224,"description":"No one is better poised to write the biography of James Herriot than the son who worked alongside him in the Yorkshire veterinary practice when Herriot became an internationally bestselling author. Now, in this warm and poignant memoir, Jim Wight talks about his father--the beloved veterinarian whom his family had to share with half the world. \nAlf Wight (aka James Herriot) grew up in Glasgow, where he lived during a happy rough-and-tumble childhood and then through the challenging years of training at the Glasgow Veterinary College. The story of how the young vet later traveled to the small Yorkshire town of Thirsk, aka Darrowby, to take the job of assistant vet is one that is well known through James Herriot's internationally celebrated books and the popular All Creatures Great and Small television series. \nBut Jim Wight's biography ventures beyond the trials and tribulations of his father's life as a veterinarian to reveal the man behind the stories--the private individual who refused to allow fame and wealth to interfere with his practice or his family. With access to all of his father's papers, correspondence, manuscripts, and photographs--and intimate remembrances of all the farmers, locals, and friends who populate the James Herriot books--only Jim Wight could write this definitive biography of the man who was not only his father but his best friend.","torrent":{"xt":"urn:btih:906753bfc9766aa54b9bb6c114bf6879a1909d12","amp;dn":"The+Real+James+Herriot+A+Memoir+of+My+Father+by+Jim+Wight","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"906753bfc9766aa54b9bb6c114bf6879a1909d12","infoHashBuffer":{"type":"Buffer","data":[144,103,83,191,201,118,106,165,75,155,182,193,20,191,104,121,161,144,157,18]},"announce":[],"urlList":[]}}