{"title":"Loose Women, Lecherous Men A Feminist Philosophy of Sex by Linda","uid":9367959,"size":3662272,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:90911a1722ac214cdafb47e8bf9bbf8abe433a2c&amp;dn=Loose+Women%2C+Lecherous+Men+A+Feminist+Philosophy+of+Sex+by+Linda&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"420weedman","files":4,"time":1387467623,"description":"Linda LeMoncheck introduces a new way of thinking and talking about women's sexual pleasures, preferences, and desires. Using the tools of contemporary analytic philosophy, she discusses methods for mediating the tensions among apparently irreconcilable feminist perspectives on women's sexuality and shows how a feminist epistemology and ethic can advance the dialogue in women's sexuality across a broad political spectrum. She argues that in order to capture the diversity and complexity of women's sexual experience, women's sexuality must be examined from two equally compelling perspectives: that of women's sexual oppression under conditions of individual and institutional male dominance; and that of women's sexual liberation, both in terms of each woman's pursuit of sexual agency and self-definition, and in terms of women's sexual liberation as a class. \nLoose Women, Lecherous Men sheds crucial new light on such much-debated topics as promiscuity, adultery, sexual deviance, prostitution, pornography, sexual harassment, and sexual violence against women. Her book supports a dialogue that encourages both women and men to take up a feminist perspective in exploring the meaning and value of\nGenre: Non Fiction , Relationships","torrent":{"xt":"urn:btih:90911a1722ac214cdafb47e8bf9bbf8abe433a2c","amp;dn":"Loose+Women%2C+Lecherous+Men+A+Feminist+Philosophy+of+Sex+by+Linda","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90911a1722ac214cdafb47e8bf9bbf8abe433a2c","infoHashBuffer":{"type":"Buffer","data":[144,145,26,23,34,172,33,76,218,251,71,232,191,155,191,138,190,67,58,44]},"announce":[],"urlList":[]}}