{"title":"Secrets of Your Cells - Sondra Barret ebook epub mobi","uid":10250026,"size":3035322,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:90c4d376cb21c8bcb3d9f5f62af0fc2968a91c74&amp;dn=Secrets+of+Your+Cells+-+Sondra+Barret+ebook+epub+mobi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"KiwiSue49","files":-1,"time":1401338563,"description":"Description:\n\n\nSecrets of Your Cells: Discovering Your Body's Inner Intelligence by Sondra Barret PhD\n\nA guiding principle of the spiritual journey is to &quot;look within.&quot; Biochemist Dr. Sondra Barrett has done just that-and discovered that our cells offer us invaluable wisdom for inspiration, transformation and healing. With Secrets of Your Cells, this scientist and mind-body teacher takes readers on a provocative journey into our inner universe. Each chapter explores a specific aspect of the cell's astonishing architecture, intelligence, and ability to work in harmony- offering practical exercises to help readers apply the lessons our cells have to offer. Join Dr. Barrett to learn more about:\n\n-\tWisdom for incorporating biological principles of balance, fluidity, identity, and cooperation into our everyday lives\n\n-\tHow your cells listen to your beliefs and thoughts-and practices for sending life-affirming messages to your body\n\n-\tRituals for making direct contact with the &quot;soul of the cell&quot;\n\n-\tHow cells reflect sacred art, as revealed by Dr. Barrett's intriguing color photographs of the inner world\n\n&quot;Our cells are more than just fortuitous arrangements of chemicals,&quot; teaches Sondra Barrett. &quot;They are a community of trillions of sentient entities working together to create a sanctuary for the human soul.&quot; Drawing on the insights of indigenous practitioners, energy medicine, and the powerful wisdom of our body's fundamental building blocks, Dr. Barrett offers readers a thoroughly-researched and accessible resource for putting cutting-edge biology into action with Secrets of Your Cells.\n\n\n\nNote: Tested epub with Aldiko and the mobi file with the Kindle application on my Samsung Note 10.1 (2012 model). Both work fine.\n\n","torrent":{"xt":"urn:btih:90c4d376cb21c8bcb3d9f5f62af0fc2968a91c74","amp;dn":"Secrets+of+Your+Cells+-+Sondra+Barret+ebook+epub+mobi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90c4d376cb21c8bcb3d9f5f62af0fc2968a91c74","infoHashBuffer":{"type":"Buffer","data":[144,196,211,118,203,33,200,188,179,217,245,246,42,240,252,41,104,169,28,116]},"announce":[],"urlList":[]}}