{"title":"Hey Mercedes - Discography (2000-2006) [FLAC]","uid":9348637,"size":1055998287,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:90e35252a4bd7f3bd0d2b0f2f2386e8664fec098&amp;dn=Hey+Mercedes+-+Discography+%282000-2006%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"politux","files":51,"time":1387080446,"description":"\n  Hey Mercedes - Discography (2000-2006) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Rock, Alternative\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  Albums\n\n  2001 Everynight Fire Works \n  2003 Loses Control\n\n  EP's \n\n  2000 Hey Mercedes\n  2002 The Weekend EP\n  2006 Unorchestrated\n\n  Born of the ashes of the now legendary Chicago emo outfit Braid, Hey Mercedes had a tough reputation, not to mention their work cut out for them from the start. It all began in mid-'99, when Braid decided to call it quits and original guitarist Chris Broach left the group. They closed out their career with a series of well-received and well-documented local shows before Broach went on to work with his other act, the Firebird Band, and the remaining members -- guitarist vocalist Bob Nanna, drummer Damon Atkinson, and bassist Todd Bell -- attempted to return to their normal lives. Normal lives being as often boring as they are, it was mere months before the three decided to regroup, and Hey Mercedes was born. Drafting former Alligator Gun guitarist and Milwaukee native Mark Dawursk, Hey Mercedes officially came into being in April of 2000, and almost immediately headed into the studio to record a four-song EP for the Danville, IL-based Polyvinyl Records. \n\n  The self-titled disc was a mix of the churning syncopations of Braid and a newfound melodic structure, highlighted by Nanna's fantastically solid vocal presence and a more laid-back but still commanding musical approach from the rest of the band. Eschewing the more aggressive nature of their old music, Hey Mercedes was a more accessible and melodic entity, and it didn't take long for their songs to win the hearts of a new generation of young music fans caught up in the burgeoning emo trend. Many still existing old connections led to high-profile touring slots with acts like Jets to Brazil, Saves the Day, and Alkaline Trio, and soon the band was signed to Vagrant Records, a trend-setting and powerhouse label in the genre. Early 2001 saw the group head back in the studio with producer J. Robbins to record their debut full-length, a powerful 11-song effort, entitled Everynight Fire Works, which after countless delays was finally released by Vagrant in October of 2001.","torrent":{"xt":"urn:btih:90e35252a4bd7f3bd0d2b0f2f2386e8664fec098","amp;dn":"Hey+Mercedes+-+Discography+%282000-2006%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90e35252a4bd7f3bd0d2b0f2f2386e8664fec098","infoHashBuffer":{"type":"Buffer","data":[144,227,82,82,164,189,127,59,208,210,176,242,242,56,110,134,100,254,192,152]},"announce":[],"urlList":[]}}