{"title":"EnigmaT Set Rips { Cuts } - December 6th, 2013","uid":9311424,"size":385829568,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9107cc2367f5123ac2f69d6145d30953f7356d2a&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+December+6th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"EnigmaT","files":50,"time":1386407859,"description":"5th Dimension - Armageddon (Diego Morrill Remix) (Cut From El Jay Set)-enTc.mp3\nAbove &amp; Beyond feat. Zoe Johnston - Love Is Not Enough (Acoustic Mix) (ABGT 056 Rip)-enTc.mp3\nAERO 21 - Hedge Hopping (Darren Porter Remix) (ASOT 642 Rip)-enTc.mp3\nAirscape feat. Radboud - Promise (Virtual Vault Remix) (Cut From Gielen Set)-enTc.mp3\nAlex Project - Race (Phillipo Blake Remix) (Cut From Masoud Set)-enTc.mp3\nAlex Wackii - Match Point (Original Mix) (Cut From Photographer Set)-enTc.mp3\nAli - My Ego Hangs Low (Cut From Tydi Set)-enTc.mp3\nAndain - You Once Told Me (Faruk Sabanci Dirty Rock Mix) (Cut From Sixma Set)-enTc.mp3\nAscania - Trying To Disappear (Original Mix) (Cut From Indayo Set)-enTc.mp3\nAzima feat. Victoria Ray - Not The Same (Touchstone Dub Mix) (Cut From El Jay Set)-enTc.mp3\nBeta5 - Reflection In The Water (Cut From Aurosonic Set)-enTc.mp3\nChris Malinchak - If U Got It (Mark Knight Remix) (ABGT 056 Rip)-enTc.mp3\nCrusy - I Need You (Cut From Sunny Set)-enTc.mp3\nDallonte - Krystal (Cut From Masoud Set)-enTc.mp3\nDallonte - Krystal (Cut From Sunny Set)-enTc.mp3\nDany and Lana - Sorry (Xenoflash Remix) (Cut From El Jay Set)-enTc.mp3\nDelfii &amp; The North feat. Jenny - Astory (Cut From Aurosonic Set)-enTc.mp3\nDem Slackers - Rocks N Stones (Toby Green Remix) (Cut From Claessen Set)-enTc.mp3\nEnigmaT Progressive House Rips Special Part 113.mp3\nFatboy Slim &amp; Riva Starr Feat. Beardyman - Eat, Sleep, Rave, Repeat (Ben Nicky Headfuck Mashup) (ASOT 642 Rip)-enTc.mp3\nFerry Corsten - Black Light (New World Punx Edit) (GDJB Rip)-enTc.mp3\nFon.Leman - Califorman (ABGT 056 Rip)-enTc.mp3\nFon.Leman - Constant Religion (Original Club Mix) (ABGT 056 Rip)-enTc.mp3\nFon.Leman - M3 (ABGT 056 Rip)-enTc.mp3\nFon.Leman - My Way (ABGT 056 Rip)-enTc.mp3\nFon.Leman - Tiberium Prophecy (ABGT 056 Rip)-enTc.mp3\nFormal One DoubleV - Black Hawk (-Short- Cut From Schossow Set)-enTc.mp3\nGouryella - Ligaya (Green Court Remix) (TrancEye Edit) (Cut From El Jay Set)-enTc.mp3\nGreenflash - Play It Loud (Cut From Schossow Set)-enTc.mp3\nHanski - Motionless (Original Mix) (Cut From Sunny Set)-enTc.mp3\nID - Antianphetamine (Sonic Species Remix) (Cut From Patterson Set)-enTc.mp3\nIdo - The Sting (Cut From Sunny Set)-enTc.mp3\nJan Vervloet vs. Nash &amp; Pepper - The Beat Kicks (Cut From Claessen Set)-enTc.mp3\nJasper Herbrink - Malpensa (Cut From GO Set)-enTc.mp3\nKevin Charm - Sydneysider (ABGT 056 Rip)-enTc.mp3\nMaywave - Harmony (Sunset Mix) (Cut From Palagano Set)-enTc.mp3\nMehrad feat. Kelly Siew - Lonely (Original Mix) (Cut From McNally Set)-enTc.mp3\nMehrad Feat. Kelly Slew - Lonely (Sebastian Welkum Remix) (Cut From Tydi Set)-enTc.mp3\nNicholas Moritz - Muda (Cut From Schossow Set)-enTc.mp3\nohan Ekman - Movement (Original Mix) (Cut From El Jay Set)-enTc.mp3\nPurple Stories - Pandorum (GDJB Rip)-enTc.mp3\nRadio Slave featuring Danton Eeprom - Grindhouse (KhoMha vs. New World Punx Stadium Mix) (GDJB Rip)-enTc.mp3\nRuben de Ronde - Pure (Phillipe El Sisi Remix) (ASOT 642 Rip)-enTc.mp3\nSandi Morreno - Awakening (Original Mix) (Cut From Photographer Set)-enTc.mp3\nSebastian Krieg - Apollonia (Cut From Schossow Set)-enTc.mp3\nSimon Patterson vs JOC &amp; Audrey Gallagher - Bush Strokes in Big Sky (Shura Vlasov Mashup) (ASOT 642 Rip)-enTc.mp3\nSonic Species - Freak Out (Cut From Patterson Set)-enTc.mp3\nSound Quelle - Laguna (Cut From Tydi Set)-enTc.mp3\nSteve Sanders - Unity &amp; Love (Cut From Gielen Set)-enTc.mp3\nTom Colontonio featuring Amber Noel - See The Light (Cut From GO Set)-enTc.mp3\n","torrent":{"xt":"urn:btih:9107cc2367f5123ac2f69d6145d30953f7356d2a","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+December+6th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9107cc2367f5123ac2f69d6145d30953f7356d2a","infoHashBuffer":{"type":"Buffer","data":[145,7,204,35,103,245,18,58,194,246,157,97,69,211,9,83,247,53,109,42]},"announce":[],"urlList":[]}}