{"title":"Nelson Mandela's Way (2010 - Unabridged)","uid":9308401,"size":136426207,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:94c9c781ba247927e3ff481c94823a4a2626d9c7&amp;dn=Nelson+Mandela%27s+Way+%282010+-+Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Robin1966","files":7,"time":1386360205,"description":"Audio Books : Biography : MP3/Variable : English\n\n\nMandela's Way: Fifteen Lessons on Life, Love, and Courage (Audiobook) by Richard Stengel\nEnglish | 2010 | ISBN: 0739383337 | ASIN: B003EN3K3O | 4 hours and 43 minutes | MP3 64 kbps | 130 MB\n\nWe long for heroes and have too few. Nelson Mandela, who recently celebrated his 91st birthday, is the closest thing the world has to a secular saint. He liberated a country from a system of violent prejudice and helped unite oppressor and oppressed in a way that had never been done before.\n\nNow Richard Stengel, the editor of Time magazine, has distilled countless hours of intimate conversation with Mandela into 15 essential life lessons. For nearly three years, including the critical period when Mandela moved South Africa toward the first democratic elections in its history, Stengel collaborated with Mandela on his autobiography and traveled with him everywhere. Eating with him, watching him campaign, hearing him think out loud, Stengel came to know all the different sides of this complex man and became a cherished friend and colleague.\n\nIn Mandela's Way, Stengel recounts the moments in which the grandfather of South Africa was tested and shares the wisdom he learned: why courage is more than the absence of fear, why we should keep our rivals close, why the answer is not always either/or but often both, how important it is for each of us to find something away from the world that gives us pleasure and satisfaction - our own garden. Woven into these life lessons are remarkable stories of Mandelas childhood as the protegy of a tribal king, of his early days as a freedom fighter, of the 27-year imprisonment that could not break him, and of his new and fulfilling marriage at the age of 80.\n\nThis compact book is profoundly inspiring. It captures the spirit of this extraordinary manwarrior, martyr, husband, statesman, and moral leader, and spurs us to look within ourselves, reconsider the things we take for granted, and contemplate the legacy well leave behind.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:94c9c781ba247927e3ff481c94823a4a2626d9c7","amp;dn":"Nelson+Mandela%27s+Way+%282010+-+Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94c9c781ba247927e3ff481c94823a4a2626d9c7","infoHashBuffer":{"type":"Buffer","data":[148,201,199,129,186,36,121,39,227,255,72,28,148,130,58,74,38,38,217,199]},"announce":[],"urlList":[]}}