{"title":"The Training Of O--ToO-34390 Holly Michaels MP4","uid":9374629,"size":2044893044,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:9678f5e20e0b9f9532b8cea02889c899ba0e3fa3&amp;dn=The+Training+Of+O--ToO-34390+Holly+Michaels+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1387599211,"description":"The Training of an Undisciplined Little Fuck Toy, Day One\n\nDec 20, 2013 - Performers: Holly Michaels \n\n\nMP4 only.\n\n\nHot. Holly Michaels is Hot. Undisciplined raw material, but Fucking Hot. Great, round luscious tits, beautiful bouncing ass, horny, hungry pussy. And this week, she is all Mine. Mine to Train. Mine to change from undisciplined little fuck toy to slave girl. We have allot of work to do. \n\nShe thinks this is going to be just another porn shoot. I have to chuckle as I string her nipples up to a couple of buckets of rocks for a painful predicament. She has no idea what is to come. Let's find out how tough the little bitch is. \n\nShe is so shaken by her first scene, I decide it would be prudent to use this juncture to overwhelm her with praise and pleasure. I glove up and fuck the shit out of her hungry cunt with my hands. I loosen her little pussy up enough to stuff it with the biggest cock in our box. Watching her come and squirt uncontrollably amuses me, and I am left feeling we have stricken a nice balance thus far between pain and pleasure. \n\nNow onto destroying her pretty, pale thighs. She sees the dick on the short post. She nods and smiles as I explain to her what is going to happen: reverse cowgirl on a dildo. She is confident. Her naivety is charming. She has no idea just how brutal this little exercise is actually going to be. In the end, her thighs are so burned out she can hardly stand. Sweat pours down her face. She is trembling and rambling incoherently. She is completely spent. Charming. And, a little more disciplined than when she started.\n\nScreens  &lt;a href=&quot;\nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=34390&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=34390&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:9678f5e20e0b9f9532b8cea02889c899ba0e3fa3","amp;dn":"The+Training+Of+O--ToO-34390+Holly+Michaels+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9678f5e20e0b9f9532b8cea02889c899ba0e3fa3","infoHashBuffer":{"type":"Buffer","data":[150,120,245,226,14,11,159,149,50,184,206,160,40,137,200,153,186,14,63,163]},"announce":[],"urlList":[]}}