{"title":"David Thompson &amp; Ben Winship - Fishing Music [2003][EAC.LOG.","uid":9360231,"size":326264143,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9708c9f2f9b6f746638fc1ae398e0d06a409b5a1&amp;dn=David+Thompson+%26amp%3B+Ben+Winship+-+Fishing+Music+%5B2003%5D%5BEAC.LOG.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dickspic","files":20,"time":1387300065,"description":"Producers Ben Winship and David Thompson don't actually put their names on the cover of Fishing Music, the subtitle of which is &quot;A Collection of Folk, Blues &amp; Swing.&quot; But either or both of them are to be heard on every cut, along with a varying cast of 24 other singers and musicians on this thematic disc. Thompson plays bass on 11 out of 16 tracks, and Winship's main axe is mandolin, though he also plays bouzouki, among other exotic string instruments. Ranging across traditional jazz, bluegrass, and even one Celtic number, the collection is devoted to songs &quot;inspired by fish, fishing, and rivers.&quot; The players have a lot of fun with that concept, particularly on instrumentals like &quot;Fisherman's Reel&quot; and comic tunes like &quot;Fish Ain't Bitin'.&quot; &quot;Fishing Blues&quot; and Hoagy Carmichael's &quot;Lazy River&quot; are perhaps obvious choices, but &quot;The Fishin' Hole,&quot; the familiar theme from TV's The Andy Griffith Show, is an inspired find, especially since the rarely heard lyrics are sung by Mollie O'Brien. There are also more serious songs, such as &quot;Reflections off the Water&quot; and Thompson and Winship's own &quot;Ocean of Dreams,&quot; but the overall tone is light and lazy, appropriate to the theme. It's hard to imagine how the producers forgot the 1951 Bing Crosby and Louis Armstrong hit &quot;Gone Fishin',&quot; which would have made an excellent inclusion, but that's one of the few criticisms that can be offered about this enjoyable set....","torrent":{"xt":"urn:btih:9708c9f2f9b6f746638fc1ae398e0d06a409b5a1","amp;dn":"David+Thompson+%26amp%3B+Ben+Winship+-+Fishing+Music+%5B2003%5D%5BEAC.LOG.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9708c9f2f9b6f746638fc1ae398e0d06a409b5a1","infoHashBuffer":{"type":"Buffer","data":[151,8,201,242,249,182,247,70,99,143,193,174,57,142,13,6,164,9,181,161]},"announce":[],"urlList":[]}}