{"title":"The Lexecutioner DVDRiP.x264 [.mp4]","uid":9347739,"size":3054296335,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:97302ed076cc84625f3f77a20eb294eb172aab64&amp;dn=The+Lexecutioner+DVDRiP.x264+%5B.mp4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xxxlavalxxx","files":3,"time":1387066830,"description":"When a gorgeous young lady needs her sweet butthole stretched by an enormous slab of black cock meat, ebony superstud Lexington Steele is on the job. The director/performer s world-famous monster dick gives six stunning sluts what they re craving in his all-anal two-disc set, The Lexecutioner. These pretty girls rectums will never be the same! Lex seduces sultry black schoolgirl Skin Diamond after he discovers her masturbating with her favorite butt toy. After plowing her perfect ass with his oversized prick, Lex splatters Skin s lovely face with sperm. Next is blonde, mixed-race Asian cutie Mia Lelani; she shows off her new dance routine for Lex. The shy, busty girl teases Lex s black snake out of his pants and takes an enthusiastic rectal ride. Bikini-clad brunettes Mischa Brooks and Aleksa Nicole believe that chanting The Lexecutioner three times will make their black cock dreams come true, and sure enough Lex materializes to deep-drill both butt-sluts. It s a Biggie Aleksa s first interracial ass fucking! Curvaceous tart Juelz Ventura gets double-stuffed as Lex and a huge toy alternate in her hungry asshole. Adorable Italian beauty Valentina Nappi seductively spreads her thick, round buns and winks her little asshole before taking Lex s dark shaft all the way up her phat booty hole. Every scene climaxes with a messy facial! The feature runs over four hours, and the deluxe DVD package includes revealing behind-the-scenes footage. This is the ultimate anal fixer! \n\nCast:\nAleksa Nicole, Juelz Ventura, Lexington Steele, Mia Lelani, Mischa Brooks, Skin Diamond, Valentina Nappi\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=45977935487289784434.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=45977935487289784434.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=15015329647324140710.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=15015329647324140710.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:97302ed076cc84625f3f77a20eb294eb172aab64","amp;dn":"The+Lexecutioner+DVDRiP.x264+%5B.mp4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97302ed076cc84625f3f77a20eb294eb172aab64","infoHashBuffer":{"type":"Buffer","data":[151,48,46,208,118,204,132,98,95,63,119,162,14,178,148,235,23,42,171,100]},"announce":[],"urlList":[]}}