{"title":"Dodgy - Ace A's + Killer B's [1997]","uid":9367944,"size":525430481,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:98227dab0b5285215b318dcb4656bc6c5c8df2dc&amp;dn=Dodgy+-+Ace+A%27s+%2B+Killer+B%27s+%5B1997%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GenXRock","files":-1,"time":1387467356,"description":"Dodgy were never considered to be one of the more important bands in the Brit-pop movement; rather they more often played the part of jesters to the more critically and commercially acclaimed bands who rode on the wave of the movement during the peak of its popularity. It is no surprise, then, that lead singer Nigel Clark left the group in mid-1998 when the popularity of Brit-pop had officially hit an all-time low. With the release of Ace A's and Killer B's, a 18 track greatest hits and B-sides retrospective, the band effectively close the book on their first incarnation and also open the doors for the future. The disc collects nearly all of Dodgy's finest moments from their first three albums and 19 singles onto a single disc featuring one new single &quot;Every Single Day.&quot; It seems pointless to be so nostalgic over a band that was so short-lived and released so little material, but what is contained on Ace A's and Killer B's is nothing less than first-rate Brit-pop. From the sloppy, electrified &quot;In a Room&quot; to the tribal beats on &quot;The Elephant,&quot; there's enough here to please any fan or non-fan. The inclusion of several B-sides and the one new track makes it essential for collectors, as well. The only true flaws are that a few singles are substituted by lackluster album material (&quot;Grassman,&quot; &quot;Ain't No Longer Asking&quot;) and that Dodgy will never make music like this again. (4.5/5)","torrent":{"xt":"urn:btih:98227dab0b5285215b318dcb4656bc6c5c8df2dc","amp;dn":"Dodgy+-+Ace+A%27s+%2B+Killer+B%27s+%5B1997%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98227dab0b5285215b318dcb4656bc6c5c8df2dc","infoHashBuffer":{"type":"Buffer","data":[152,34,125,171,11,82,133,33,91,49,141,203,70,86,188,108,92,141,242,220]},"announce":[],"urlList":[]}}