{"title":"Sexual Rx by Kassie Burns","uid":9364945,"size":290337,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9904ba460cdbae38678c5b2ecc518474ef2a1951&amp;dn=Sexual+Rx+by+Kassie+Burns&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"420weedman","files":4,"time":1387394519,"description":"Rachel Herrington-Whyte is a young heiress who appears to have everything -- youth, beauty, fame, wealth, and a powerful husband. Only she hates her fame, her husband Jeremy married her for her money and is having an affair, she-s about to divorce him, and her doctor has just told her she has an incurable brain tumor. \nRachel isn-t about to give up on life, though. Through her connections, she-s learned that Mastror si Lor Canto, an Evolved sexual healer, is coming to Earth. Although the Evolved are forbidden to share their advanced science with the primitive Earthlings, Rachel is determined to seduce Lor and receive sexual healing from him. \nMastror si Lor Canto has come to Earth with a hidden purpose. As the foremost sexual healer of Cor'almere, he is determined to test his theory that the primitive humans of Earth have untapped paranormal powers that could boost his own. When he meets Rachel, he senses that she possesses the psychic sensitivity he is looking for. \nFor Rachel, seducing Lor is a matter of life or death. She arranges to meet him at a dinner party thrown by one of her wealthy friends and begins to seduce him. Their bedroom interlude ends abruptly, though, when Lor learns that Rachel is still married. He insists that her husband must be present for the sexual healing ceremony. Rachel uses her wealth to bribe Jeremy into attending, but her soon-to-be ex secretly tapes the beginning of the sexual ceremony and broadcasts it on national TV to embarrass her and the Evolved. \nRachel finds herself facing a public backlash as she-s denounced as a whore, but the outer turmoil in her life only ignites her inner courage. She ventures into a deeper romance with Lor and comes up with a way to have her revenge on her Ex. She-s earned a new freedom, but will Lor-s lovemaking be enough to cure the tumor that threatens her life? And if he does cure her, will Lor obey the ancient tradition of the sexual healers to abandon all sexual contact with a patient once she is healed?","torrent":{"xt":"urn:btih:9904ba460cdbae38678c5b2ecc518474ef2a1951","amp;dn":"Sexual+Rx+by+Kassie+Burns","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9904ba460cdbae38678c5b2ecc518474ef2a1951","infoHashBuffer":{"type":"Buffer","data":[153,4,186,70,12,219,174,56,103,140,91,46,204,81,132,116,239,42,25,81]},"announce":[],"urlList":[]}}