{"title":"Memories of John Lennon edited by Yoko Ono (2005)","uid":10238107,"size":8104761,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9bfb44f672483befce6cc164599ee794e06acb00&amp;dn=Memories+of+John+Lennon+edited+by+Yoko+Ono+%282005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1401211921,"description":"Title: Memories Of John Lennon\nAuthor: Yoko Ono (Editor), others\nPublisher: It Books (November 29, 2005)\nLanguage: English\nISBN-10: 0060594551\nISBN-13: 978-0060594558\n\nPromotional info/Publisher's Summary - &quot;'My first encounter with John Lennon gave me a sense of humility, which is funny in a way. The Beatles were such a big deal then - this was in 1963, before we had made a record - and we weren't really anyone.' - Mick Jagger. In this unique and evocative book, Yoko Ono, the widow of John Lennon, gathers together memories from fans, friends, and colleagues about the inspiring and influential singer-songwriter. Even in death Lennon and his work continues to inspire and enthrall. Some of the most well-respected artists, including James Brown, Marshall Crenshaw, Peter Gabriel and Dennis Hopper, share their reminiscences within these pages. Harry Benson is one of many photographers who recall Lennon's generosity and sense of humour; Cilla Black recounts how Lennon gave her her first break; activist Tom Hayden writes of how MI5 and the FBI tracked Lennon; Donovan tells of playing their guitars together at an Indian ashram; and many others tell of their excitement at hearing the Beatles music for the first time, and the impact it had on their lives.&quot;\n\nKind of a mixed bag here, and that's why I'm not posting a full review. Mostly these are just recollections from his friends (some previously published) and others about the life and times of a unique icon. Worth checking out if you are big Beatles/Lennon fan but not essential reading by any means. A nice book to flip through for quotes from Mick Jagger, Elton John and others. \n\nThis contains the original PDF version of the book as well as a converted EPUB edition I made using Calibre - it has some textual errors but not too many and is definitely readable. The front cover and generated metadata OPF are also included. Please seed, and enjoy! :-)\n\nPlease visit and support my Suprbay release thread here, I would appreciate it:  &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&lt;/a&gt;\t","torrent":{"xt":"urn:btih:9bfb44f672483befce6cc164599ee794e06acb00","amp;dn":"Memories+of+John+Lennon+edited+by+Yoko+Ono+%282005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9bfb44f672483befce6cc164599ee794e06acb00","infoHashBuffer":{"type":"Buffer","data":[155,251,68,246,114,72,59,239,206,108,193,100,89,158,231,148,224,106,203,0]},"announce":[],"urlList":[]}}