{"title":"[Bang Bros] [BangBros Remastered] Silky Thumper, Tia Sweete - Le","uid":9317955,"size":694933371,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:9cac768630b89bcdcf8c236e1e11cf0b619577e3&amp;dn=%5BBang+Bros%5D+%5BBangBros+Remastered%5D+Silky+Thumper%2C+Tia+Sweete+-+Le&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SS132203","files":5,"time":1386497380,"description":"[Bang Bros] [BangBros Remastered] Silky Thumper, Tia Sweet - Lesbians Fucked In A Threesome! -={ SPARROW }=-\n\nGet a load of this fellas...I invited my homegirl Tia to check out this pimped out penthouse apartment, that my boy J-Mac and Silky are sharing for the weekend... As soon as she walks in I could'nt help myself, I had to get a closer look at her firm round ass...damn this girl is tight!!!So Tia makes her way over to my homie and introduces herself...J-Mac could'nt keep his hands of her perky tits and round apple bottom...after enjoying Tia for a minute, he lets us know that Silky is in the bedroom sleeping after they had a long night of &quot;Bumpin' &amp; Grindin'&quot; (special shout-out to my boy R)...anyways, I decide to wake-up Silky with a special surprise: Tia eating her pussy!!!Needless to say this GIRL ON GIRL action made my motherfucking day, but we was just getting started...Silky is so damn fine, her sweet juicy ass was sticking out so perfectly that I decided to have an ASS WORSHIPING session in the terrace!!! You know your boy D. Sanchez has got your mofockin back...so once we hit the terrace I got this two beauties halfway over the ledge shaking their asses...Well, what happened next is unbelivable, the girls were so horny that they decided it was time for some anal play...oh yes, so Silky pulls out some anal beads and proceeds to introduce them into Tia's tight little asshole...All I can say is..this shit is amazing...once her little browneye was nice and stretched, Jmac makes his way into that tight spot...it was tough, but he got it all the way in, Fellas, this is a legendary episode, don't sleep on this one...It was great! I loved every minute of it.. as will you... Enjoy! The Dirty One....\n &lt;a href=&quot;\nhttp://postimg.org/image/bguaxkfr9/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/bguaxkfr9/&lt;/a&gt;","torrent":{"xt":"urn:btih:9cac768630b89bcdcf8c236e1e11cf0b619577e3","amp;dn":"%5BBang+Bros%5D+%5BBangBros+Remastered%5D+Silky+Thumper%2C+Tia+Sweete+-+Le","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cac768630b89bcdcf8c236e1e11cf0b619577e3","infoHashBuffer":{"type":"Buffer","data":[156,172,118,134,48,184,155,205,207,140,35,110,30,17,207,11,97,149,119,227]},"announce":[],"urlList":[]}}