{"title":"Wilder Jasinda-Forever and Always LittleFairyRG","uid":9373264,"size":1602944,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9e63c08365e1cc8b92a4c0f2c4d47c06a0b1013e&amp;dn=Wilder+Jasinda-Forever+and+Always+LittleFairyRG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SirHates","files":2,"time":1387569255,"description":"Forever and Always by Jasinda Wilder\n\nGenre: Romance\n\nEver, These letters are often all that get me through week to week. Even if it's just random stuff, nothing important, they're important to me. Gramps is great, and I love working on the ranch. But...I'm lonely. I feel disconnected, like I'm no one, like I don't belong anywhere. Like I'm just here until something else happens. I don't even know what I want with my future. But your letters, they make me feel connected to something, to someone. I had a crush on you, when we first met. I thought you were beautiful. So beautiful. It was hard to think of anything else. Then camp ended and we never got together, and now all I have of you is these letters. S**t. I just told you I have a crush on you. HAD. Had a crush. Not sure what is anymore. A letter-crush? A literary love? That's stupid. Sorry. I just have this rule with myself that I never throw away what I write and I always send it, so hopefully this doesn't weird you out too much. I had a dream about you too. Same kind of thing. Us, in the darkness, together. Just us. And it was like you said, a memory turned into a dream, but a memory of something that's never happened, but in the dream it felt so real, and it was more, I don't even know, more RIGHT than anything I've ever felt, in life or in dreams. I wonder what it means that we both had the same dream about each other. Maybe nothing, maybe everything. You tell me. Cade ~ ~ ~ ~ Cade, We're pen pals. Maybe that's all we'll ever be. I don't know. If we met IRL (in real life, in case you're not familiar with the term) what would happen? And just FYI, the term you used, a literary love? It was beautiful. So beautiful. That term means something, between us now. We are literary loves. Lovers? I do love you, in some strange way. Knowing about you, in these letters, knowing your hurt and your joys, it means something so important to me, that I just can't describe. I need your art, and your letters, and your literary love. If we never have anything else between us, I need this. I do. Maybe this letter will only complicate things, but like you I have a rule that I never erase or throw away what I've written and I always send it, no matter what I write in the letter. Your literary love, Ever **","torrent":{"xt":"urn:btih:9e63c08365e1cc8b92a4c0f2c4d47c06a0b1013e","amp;dn":"Wilder+Jasinda-Forever+and+Always+LittleFairyRG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e63c08365e1cc8b92a4c0f2c4d47c06a0b1013e","infoHashBuffer":{"type":"Buffer","data":[158,99,192,131,101,225,204,139,146,164,192,242,196,212,124,6,160,177,1,62]},"announce":[],"urlList":[]}}