{"title":"How The Grinch Stole Christmas (Audiobook &amp; songs)","uid":9304142,"size":75928124,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a1421f5d0d0bd3a87d46ffd9fe51d9e86d3121f8&amp;dn=How+The+Grinch+Stole+Christmas+%28Audiobook+%26amp%3B+songs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"IThinkIamBreaking","files":6,"time":1386287630,"description":"Dr. Seuss' How the Grinch Stole Christmas! is a 1966 American animated television special directed by Chuck Jones. It is based on the homonymous children's book by Dr. Seuss, the story of The Grinch trying to take away Christmas from the townsfolk of Whoville below his mountain hideaway. The special, which is considered a short film as it runs less than an hour, is one of the very few Christmas specials from the 1960s to still be shown regularly on television. Jones and Geisel previously worked together on the Private Snafu training cartoons during World War II.\n\nThe 26-minute short was originally telecast on CBS on December 18, 1966. CBS repeated it annually during the Christmas season until 1987. Beginning in 2006, ABC began broadcasting it annually during the Christmas season. It was eventually acquired by Turner Broadcasting System, which now shows it several times between November and December. It has since been broadcast on TBS, TNT, Cartoon Network, and The WB Television Network, and ABC Family but with some scenes trimmed to fit more commercial time.\n\nBoris Karloff, in one of his final roles, narrates the film and also provides the speaking voice of The Grinch. (The opening credits state, &quot;The sounds of the Grinch are by Boris Karloff...And read by Boris Karloff too!&quot;) The special was originally produced by The Cat in the Hat Productions in association with the television and animation divisions of Metro-Goldwyn-Mayer Studios.","torrent":{"xt":"urn:btih:a1421f5d0d0bd3a87d46ffd9fe51d9e86d3121f8","amp;dn":"How+The+Grinch+Stole+Christmas+%28Audiobook+%26amp%3B+songs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1421f5d0d0bd3a87d46ffd9fe51d9e86d3121f8","infoHashBuffer":{"type":"Buffer","data":[161,66,31,93,13,11,211,168,125,70,255,217,254,81,217,232,109,49,33,248]},"announce":[],"urlList":[]}}