{"title":"Ivan the Terrible - Robert Payne (1975 - Retail epub)","uid":9343379,"size":11356871,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a288d42a0be1c2bdb8cf7267ac64b29964fca0bd&amp;dn=Ivan+the+Terrible+-+Robert+Payne+%281975+-+Retail+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Robin1966","files":5,"time":1386980298,"description":"Books : Biography : English\n\n\nIvan was truly in a class with Genghis Khan, Hitler and Stalin, and this study brings him to life with all the fascination which the monstrous evokes.\n\nPublishers Weekly\nGrandly conceived with imperial sweep and torch-lit pageantry.\n\nKirkus Reviews\nThe authors reveal the most significant moments in Ivan's life and his growing abuse of power. The writing is vigorous and colorful yet never sensational.\n\nCHOICE\nDeeply satisfying... . Ivan's reign lasted 54 years, more than a lifetime (perhaps two?) for people of his time. And, together with the evil he perpetrated, he had an immense effect on Russian architecture, the arts, governance and geography. His reign merits better understanding, and this book tells the story in a manner that makes the study enjoyable.\n\nProduct Description\nCzar Ivan IV (1530-1584), the first Russian ruler to take the title czar, is known as one of the worst tyrants in history, but few people among the general public know how he got such an infamous reputation. Relying on extensive research based heavily on original Russian sources, this definitive biography depicts an incredibly complex man living in a time of simple, harsh realities.\n\nRobert Payne, the distinguished author of many historical and biographical works, and Russian scholar Nikita Romanoff, describe in vivid and lively detail Ivan's callous upbringing; the poisoning of his second wife and the murder of his son; his obsession with religion and sin; his predilection for mass murder, evidenced by his massacre of 30,000 citizens of Novgorod; yet his remarkable intelligence as a ruler, supporting the growth of trade and expanding Russia's borders.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:a288d42a0be1c2bdb8cf7267ac64b29964fca0bd","amp;dn":"Ivan+the+Terrible+-+Robert+Payne+%281975+-+Retail+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a288d42a0be1c2bdb8cf7267ac64b29964fca0bd","infoHashBuffer":{"type":"Buffer","data":[162,136,212,42,11,225,194,189,184,207,114,103,172,100,178,153,100,252,160,189]},"announce":[],"urlList":[]}}