{"title":"Starbound Beta ALI213 incl update3","uid":9306666,"size":885398413,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a32fda540e0837b0d6e8338f1251017a8ff63ac5&amp;dn=Starbound+Beta+ALI213+incl+update3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cookiezeater1","files":-1,"time":1386324884,"description":"In Starbound, you take on the role of a character whos just fled from their home planet, only to crash-land on another. From there youll embark on a quest to survive, discover, explore and fight your way across an infinite universe. \n\nYoull encounter procedurally generated creatures and weapons, discover populated villages and abandoned temples. Explore planets dotted with dungeons, eyeball trees and treasure. Make use of over a hundred materials and over one thousand in-game objects to build a sprawling modern metropolis or a sleepy secluded cabin in the woods, and do all of it alone or with friends! \n\nStarbound lets you live out your own story of space exploration, discovery and adventure. Settle down and farm the land, hop from planet to planet claiming resources, or make regular visits to populated settlements, taking on jobs and earning a living. NPCs are scattered about the worlds, offering quests and challenges for those looking for a little extra excitement in their lives. \n\nKey Features: \n6 playable races \nA procedurally generated universe with unlimited procedurally generated planets \nAll content available in online drop in/drop out co-op \nGenerated dungeons full of unique enemies \nRandomly generated monsters \nThousands of items \nA deep crafting system \nPVP gameplay \nOwn and decorate your own Starship \nDevelop your own home planet \nMenacing boss battles \nProcedurally generated guns and melee weapons \nFarming, hunting and survival mechanics \nBuilt from the ground up to support modding \nOngoing free updates \nMulti platform multiplayer\n\nUpdate #2\n\nMassively reducing the pixel cost (sometimes eliminating it entirely) on early weapons/armor. You can build a refinery in later tiers to turn ores of all kinds into pixels. (done)\n\nYou can no longer teleport to another players ship from underground (done)\n\nreduce pixel/material cost of iron beacon (done)\n\nfixed a bug that made iron appear less than it should (done)\n\nMake guards you've summoned refer to you as their boss (done)\n\nFix human starter chest showing apex starter items (done)\n\nMake the refinery appear earlier in the game (done)\n\nReduced fuel costs a bit to go to other planets (done)\n\nTweaked wording of starter quests to encourage exploring of more planets. (done)\n\nAdded hunting knife weapon that also makes monsters drop meat (done)\n\nPixel loss on death reduced to 20% for testing, might change further (done)\n\n[16:27] &lt;Mortvert&gt; Tiy_, Also, could you make silver more visible, please? (Done)\n\nAdded new armor that provides a good amount of warmth early on in the game at the sacrifice of armor levels. (done)\n\nTweaked the UFO boss to make him smash blocks. (done)\n\nAlso make him a little bit easier by changing him to level 9 from level 10 (done)\n\nRevamping the warmth bar to make it more obvious (suggestion by thedbp on reddit) http://i.imgur.com/O2IYd6k.png (done)\n\nIncrease mining speed a little (done)\n\nAdd numbers above the hotbar slots http://i.imgur.com/qTJiFrS.png (done)\n\nCraftable climbing ropes! (done)\n\nTons of bug fixes including..\n\nShift click no longer eats items when used with a full chest/other thingers (done)\n\nMade it more difficult to accidentally fall through platforms (done)\n\nBartwe is working on the windows XP issues, not sure yet if it'll be done by tonight but fingers crossed.\n\n------------------------------------------\nThis torrent includes only windows binaries and custom font","torrent":{"xt":"urn:btih:a32fda540e0837b0d6e8338f1251017a8ff63ac5","amp;dn":"Starbound+Beta+ALI213+incl+update3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a32fda540e0837b0d6e8338f1251017a8ff63ac5","infoHashBuffer":{"type":"Buffer","data":[163,47,218,84,14,8,55,176,214,232,51,143,18,81,1,122,143,246,58,197]},"announce":[],"urlList":[]}}