{"title":"The Killer Book of Cold Cases - Tom Philbin.epub","uid":9314923,"size":3215130,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a33cbb3be6262db9648d3a2cc83f3b5b05d2d081&amp;dn=The+Killer+Book+of+Cold+Cases+-+Tom+Philbin.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1386451501,"description":"Shocking Stories of the Most Infamous Unsolved Crimes\n\nEvery criminal dreams of committing the perfect crime. A crime that is so well executed, with clues and evidence so scarce, that even the experts are left baffled. The Killer Book of Cold Cases takes you behind the crime scene tape and deep into the investigations of some of the most puzzling and notorious cold cases of all timefrom murders to kidnappings to massive bombings that were open for years before the criminal was finally brought to justice.\n\nRead about:\n\n*The New York City judge whose disappearance was so famous, his name became synonymous with cold cases\n* The first use of DNA to help solve a murder case that had been cold for years\n* The bomber who took down an entire plane of people, just to collect on his mother's insurance\n* The legendary bank robber D.B. Cooper\n* The murder of two cops in a small California town-a case that took more than SO years to solve\n* The Mad Bomber, who drove New Yorkers half crazy in the fifties by planting bombs all over the city Bury yourself in these edge-of-your-seat tales, read chilling quotes, and test your crime IQ with cold-case trivia. You'll stay up wondering which criminals might still be on the loose!","torrent":{"xt":"urn:btih:a33cbb3be6262db9648d3a2cc83f3b5b05d2d081","amp;dn":"The+Killer+Book+of+Cold+Cases+-+Tom+Philbin.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a33cbb3be6262db9648d3a2cc83f3b5b05d2d081","infoHashBuffer":{"type":"Buffer","data":[163,60,187,59,230,38,45,185,100,141,58,44,200,63,59,91,5,210,208,129]},"announce":[],"urlList":[]}}