{"title":"Amy-Jill Levine - The Historical Jesus in Context [2006][A]","uid":10245273,"size":3248320,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a4847e9b247310f42cf2d8b35408435be9a67cfb&amp;dn=Amy-Jill+Levine+-+The+Historical+Jesus+in+Context+%5B2006%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Anette14","files":-1,"time":1401290647,"description":"\nDescription\nProduct Details\nBook Title: The Historical Jesus in Context (Princeton Readings in Religions)\t\nBook Author: Amy-Jill Levine (Editor), Dale C. Allison Jr. (Editor), John Dominic Crossan (Editor)\nSeries: Princeton Readings in Religions\nHardcover: 456 pages\nPublisher: Princeton University Press (October 16, 2006)\nLanguage: English\nISBN-10: 0691009910\nISBN-13: 978-0691009919\n\n===================================================================================\nBook Description\nPublication Date: October 16, 2006\nThe Historical Jesus in Context is a landmark collection that places the gospel narratives in their full literary, social, and archaeological context. More than twenty-five internationally recognized experts offer new translations and descriptions of a broad range of texts that shed new light on the Jesus of history, including pagan prayers and private inscriptions, miracle tales and martyrdoms, parables and fables, divorce decrees and imperial propaganda.\nThe translated materials--from Christian, Coptic, and Jewish as well as Greek, Roman, and Egyptian texts--extend beyond single phrases to encompass the full context, thus allowing readers to locate Jesus in a broader cultural setting than is usually made available. This book demonstrates that only by knowing the world in which Jesus lived and taught can we fully understand him, his message, and the spread of the Gospel.\nGathering in one place material that was previously available only in disparate sources, this formidable book provides innovative insight into matters no less grand than first-century Jewish and Gentile life, the composition of the Gospels, and Jesus himself.\n\n===================================================================================\nReviews\n&quot;The essays illuminate the social, religious, and cultural background of Jesus and the Gospels in striking ways. The book has gathered together the work of leading scholars without regard for any party line.&quot;--Paul Cavill, Church Times\n\n&quot;A very useful introduction to the historical background of Jesus and the Gospels...A valuable resource for historical Jesus studies.&quot;--Michael Bird, Journal for the Study of the New Testament\n\n&quot;It is a major research tool and an education in its own right. Highly recommended.&quot;--Robert M. Price, Religious Studies Review\n\n&quot;In general, this is a volume especially useful as a resource for teaching about Jesus in his historical context.&quot;--Bruce Longenecker, Theological Book Review\n\n&quot;This collection of essays is a very useful introduction to the historical background of Jesus and the Gospels. The translation of a number of primary texts in one volume makes it a valuable resource for historical Jesus studies.&quot;--Michael Bird, Journal for the Study of the New Testament\n\n&quot;The heart of the matter is in the ancient texts themselves--let the reader understand! For this reason, the student of Christian origins and/or the historical Jesus will find this book eminently worthwhile. There is, as far as I know, no other book on the market that brings the primary textual backgrounds on Jesus together in one place.&quot;--Nicholas Perrin, Journal of the Evangelical Theological Society\n\n&quot;An excellent addition to any library--whether scholarly, pastoral, or devotional--this is an illuminating volume with easy to follow, concise essays that deal with a variety of subjects or aspects of the world in which Jesus lived and the gospels written. Excellent for scholars, students, those charge with pastoral responsibilities or the interested reading public, The Historical Jesus in Context provides background and insights that illumine the gospel record in delightfully unexpected ways.&quot;--Stephen Morris, European Legacy\n\n===================================================================================\nFrom the Inside Flap\n&quot;An impressive volume. Levine, Allison, and Crossan have assembled a group of experts who, by generously citing and carefully analyzing primary sources, contextualize Jesus in the Jewish and wider Greco-Roman world of his time. The essays cast a wide net and collect a rich assortment of information for students of the historical Jesus and the Gospels.&quot;--James C. Vanderkam, University of Notre Dame, author of The Dead Sea Scrolls\n\n&quot;Textbooks are increasingly difficult to find for an introductory class on Jesus of Nazareth. The Historical Jesus in Context provides an anthology of important primary texts that are set in context so that they illuminate what Jesus and his world was like. The selections are judicious, the authors prominent, and the potential for students illuminating.&quot;--Scot McKnight, author of The Jesus Creed\n\n&quot;This is a source book to help all obtain their own conclusions, by emphasizing that Jesus' own message must be grounded in the original historical context. The task is not only imperative but also demanded morally. No other book does this so well. It is amazingly well done and well written.&quot;--James Charlesworth, Princeton Theological Seminary\n\n&quot;This is a great collection and would certainly be of interest to scholars and laypersons interested in the quest for the historical Jesus. The selection of scholars is top notch, and the notes and commentary for each source are strong.&quot;--Kathleen Corley, University of Wisconsin, Oshkosh\n\n===================================================================================\nAbout the Author\nAmy-Jill Levine is E. Rhodes and Leona B. Carpenter Professor of New Testament Studies at the Divinity School and Graduate Department of Religion of Vanderbilt University. Dale C. Allison Jr. is Errett M. Grable Professor of New Testament Exegesis and Early Christianity at the Pittsburgh Theological Seminary. John Dominic Crossan is Professor Emeritus of Religious Studies at DePaul University.\n===================================================================================","torrent":{"xt":"urn:btih:a4847e9b247310f42cf2d8b35408435be9a67cfb","amp;dn":"Amy-Jill+Levine+-+The+Historical+Jesus+in+Context+%5B2006%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4847e9b247310f42cf2d8b35408435be9a67cfb","infoHashBuffer":{"type":"Buffer","data":[164,132,126,155,36,115,16,244,44,242,216,179,84,8,67,91,233,166,124,251]},"announce":[],"urlList":[]}}