{"title":"A Nail Through the Heart [Poke Rafferty Mystery, #1] - Timothy H","uid":9345437,"size":850297,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a48f9438e547bd81f726cb674616c9940928ba31&amp;dn=A+Nail+Through+the+Heart+%5BPoke+Rafferty+Mystery%2C+%231%5D+-+Timothy+H&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mohammad_AT","files":1,"time":1387033766,"description":"Travel writer Poke Rafferty was good at looking for trouble--so good that he made a little money writing a few offbeat travel guides for the young and terminally bored. But that was before Bangkok stole his heart. Now the expat American is happily playing family with Rose, the former go-go dancer he wants to marry, and with Miaow, the wary street child he wants to adopt. Yet just when everything is beginning to work out, trouble comes looking for Poke in the guise of good intentions. First he takes in Miaow's friend, a troubled and terrifying street urchin named Superman. Then he agrees to find a distraught Aussie woman's missing uncle--and accept an old woman's generous payment to find a blackmailing theif. Soon, these three seemingly disparate events begin to overlap, pulling Poke deeper into dark, unfamiliar terrain. Gradually he realizes that he's been gliding across the surface of a culture he really doesn't understand--and that what he doesn't know is about to hurt him and everyone he loves.\n\nBeautifully crafted, relentlessly paced, &quot;A Nail Through the Heart&quot; is an exciting and enticing read that will leave readers hungry for more from the gifted Timothy Hallinan.","torrent":{"xt":"urn:btih:a48f9438e547bd81f726cb674616c9940928ba31","amp;dn":"A+Nail+Through+the+Heart+%5BPoke+Rafferty+Mystery%2C+%231%5D+-+Timothy+H","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a48f9438e547bd81f726cb674616c9940928ba31","infoHashBuffer":{"type":"Buffer","data":[164,143,148,56,229,71,189,129,247,38,203,103,70,22,201,148,9,40,186,49]},"announce":[],"urlList":[]}}