{"title":"Edward VII: The Playboy Prince (2013 - Retail epub)","uid":9343387,"size":16148617,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a52feed09860a770e9c083978cde9099fcea53fc&amp;dn=Edward+VII%3A+The+Playboy+Prince+%282013+-+Retail+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Robin1966","files":6,"time":1386980571,"description":"Books : Biography : English\n\n\nJane Ridley, &quot;The Heir Apparent: A Life of Edward VII, the Playboy Prince&quot;\nISBN: 1400062551 | 2013 | EPUB | 752 pages | 8 MB\n\nThis richly entertaining biography chronicles the eventful life of Queen Victoria's firstborn son, the quintessential black sheep of Buckingham Palace, who matured into as wise and effective a monarch as Britain has ever seen. Granted unprecedented access to the royal archives, noted scholar Jane Ridley draws on numerous primary sources to paint a vivid portrait of the man and the age to which he gave his name.\n\nBorn Prince Albert Edward, and known to familiars as &quot;Bertie,&quot; the future King Edward VII had a well-earned reputation for debauchery. A notorious gambler, glutton, and womanizer, he preferred the company of wastrels and courtesans to the dreary life of the Victorian court. His own mother considered him a lazy halfwit, temperamentally unfit to succeed her. When he ascended to the throne in 1901, at age fifty-nine, expectations were low. Yet by the time he died nine years later, he had proven himself a deft diplomat, hardworking head of state, and the architect of Britain's modern constitutional monarchy.\n\nJane Ridley's colorful biography rescues the man once derided as &quot;Edward the Caresser&quot; from the clutches of his historical detractors. Excerpts from letters and diaries shed new light on Bertie's long power struggle with Queen Victoria, illuminating one of the most emotionally fraught mother-son relationships in history. Considerable attention is paid to King Edward's campaign of personal diplomacy abroad and his valiant efforts to reform the political system at home. Separating truth from legend, Ridley also explores Bertie's relationships with the women in his life. Their ranks comprised his wife, the stunning Danish princess Alexandra, along with some of the great beauties of the era: the actress Lillie Langtry, longtime &quot;royal mistress&quot; Alice Keppel (the great-grandmother of Camilla Parker Bowles), and Lady Randolph Churchill, mother of Winston.\n\nEdward VII waited nearly six decades for his chance to rule, then did so with considerable panache and aplomb. A magnificent life of an unexpectedly impressive king, The Heir Apparent documents the remarkable transformation of a man--and a monarchy--at the dawn of a new century.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:a52feed09860a770e9c083978cde9099fcea53fc","amp;dn":"Edward+VII%3A+The+Playboy+Prince+%282013+-+Retail+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a52feed09860a770e9c083978cde9099fcea53fc","infoHashBuffer":{"type":"Buffer","data":[165,47,238,208,152,96,167,112,233,192,131,151,140,222,144,153,252,234,83,252]},"announce":[],"urlList":[]}}