{"title":"Car Highway Speed Racing game","uid":10343111,"size":12130081,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:a95e356d36f899a347e7b28dfce636cd5d23f4f3&amp;dn=+Car+Highway+Speed+Racing+game&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Kaloyan78","files":-1,"time":1402571415,"description":"An arcade style car racing game where you take control of a car and race on the highway by using your device's accelerometer, controlling the car's speed. Try not to crash in any obstacles while racing, like train, truck, cars and bikes. Tilting the device forward or backward will make the car accelerate or decelerate, while tilting it sideways will make it turn. Your goal is to reach the highest score, while avoiding traffic. Going of the track / highway will make you lose points. If you reach a score of zero the level will end and you will have to start over.\n\n\nPoints are earned for every vehicle, which has disappeared from the screen and is no longer an obstacle.\n\n\nFeatures:\n\n\n* Full tilt controls - the vehicle is controlled only by the accelerometer of the device.\n* Nice 2D graphics, making the game more fun\n* Highscores - compare your race scores with other people's.\n* Traffic incidents - cars collide and hazardous lights, blinkers, are turned on.\n* Traffic has a truck, two types of cars, crashed and stopped cars, as well as motorcycle.\n* Both current and highscores are displayed\n* Small speedometer in the upper corner of the game.\n\n\nRacing music link:\n\n\nThis is an ad supported version of the car racing game. Ads are located at the bottom of the menu screens and are hidden when playing the game itself.","torrent":{"xt":"urn:btih:a95e356d36f899a347e7b28dfce636cd5d23f4f3","amp;dn":"+Car+Highway+Speed+Racing+game","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a95e356d36f899a347e7b28dfce636cd5d23f4f3","infoHashBuffer":{"type":"Buffer","data":[169,94,53,109,54,248,153,163,71,231,178,141,252,230,54,205,93,35,244,243]},"announce":[],"urlList":[]}}