{"title":"POtHS - Holy Treasures - 43 - Revelations Unearthed","uid":9396025,"size":10894603427,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:aacc29a96ee69af6b93c6df3e7d9938d47113394&amp;dn=POtHS+-+Holy+Treasures+-+43+-+Revelations+Unearthed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":63,"time":1387983778,"description":"\nPOtHS - E V I L - U T I O N - School Your Professor on The Facts\n &lt;a href=&quot;\nhttp://thepiratebay.pe/torrent/8865248/POtHS_-_E_V_I_L_-_U_T_I_O_N_-_School_Your_Professor_on_The_Facts&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.pe/torrent/8865248/POtHS_-_E_V_I_L_-_U_T_I_O_N_-_School_Your_Professor_on_The_Facts&lt;/a&gt;\n\nreligious-christian-icons-337.gif\n\n\n\n\n\n PO t HS\n\nPouring Out the Holy Spirit\n\nPOtHS - Holy Treasures - 43 - Revelations Unearthed\n\n\n\nPOtHS Comment:  You haven't seen a UFO yet??? Get off your couch they are everywhere. Search Google for UFO's if you can't get your butt higher than your knees. WAKE UP WAKE UP WAKE UP WAKE UP WAKE UP WAKE UP WAKE UP WAKE UP WAKE UP WAKE UP WAKE UP WAKE UP WAKE UP WAKE UP WAKE UP WAKE UP WAKE UP WAKE UP\n\nINTRODUCTION\n\nAncient Bible Codes, DNA and Bio Spiritual Warfare:\n(4-HOURS) Join Dr. Leonard Horowitz as he explores more than 3000 years of religious and political persecution by a secret cabal that has waged ceaseless wars, famines, plagues and propaganda campaigns against Earth's people. Includes the details about ancient musical and mathematical codes linked to creation, destruction, and miracles, including the repair frequency of DNA the genetic blueprint of life. Ancient knowledge and modern science collide in this amazing program presented back in 1999 that links modern conspiracy theories to ancient Bible Codes and their relation to End-Times events.\n\nNOW ON DVD - HEALING CODES FOR THE BIOLOGICAL APOCALYPSE - 4-HOUR 2-DVD SPECIAL EDITION, Cat# K476.  UFOTVÂ®, accept no imitations.  \nGo to http://www.UFOTV.com.\n------------------------------------------------------------------------------------------------------------------\n\nAnceient Chinese Writing Tells The Biblical Story - The Flood, The plan of Salvation all in Ancient Chinese Language:\nThis is a must see presentation! The first video I have personally seen to discuss this topic in depth and non-believers will also be amazed. Was the flood just a fable? What was the original Chinese religion?  We should be mindful that the oldest known Religion is not a religion at all. It is the Word of God that existed long before man and will continue to exist long after we are gone. Religion is a man-made concept of divinity and worship that has perverted God's Holy Word which has given rise to many false doctrines. But conforming to that description, Judeo Christianity is the oldest form which happens to begin from the time of Adam &amp; Eve but the Jews were not the first to document God and His relationship with mankind.\n\nThe first documentary evidence does not reside in the Torah, but in the ancient writing of the Chinese people and the first God of worship in China. The Chinese have the oldest known form of writing which dates all the way back to 2500 BC. That places these writings within a few Centuries after Noah's Great Flood of the Bible. The writings are well-documented and in those ancient times the Chinese actually worshiped the one true God and Creator. The same God as modern Christians today and to them, his name was Shang Di.\n\nThe modern Chinese religions did not surface until Daoism in the 6th century BC, Confucianism in 5th BC, and Buddhism in the 5th BC. But for over 2000 years, the Chinese people actually worshiped Shang Di and no other. Their ancient manuscripts begin with the text:\n&quot;In the beginning, there was... without form and dark... planets had not begun to revolve, nor the lights to shine. In the midst of it there existed neither form nor sound.&quot;\n\nAs stated in the presentation, &quot;For over 2000 years the Chinese people worshiped a singular surpreme sovereign God who is the Creator of Heaven and Earth... who has the same nature, character and power of Jahovah, YHWH God of the Old Testament.&quot; The Chinese are well-known for documenting historical events and these ancient writings also describe the first written account of the Great Flood in the Bible and the Tower of Babel that later scatterred people everywhere across the world. The ancient Chinese worshiped our God, the most high and documented the Creation story, the biblical flood the tower of babel diaspora and His heavenly plan of Salvation.\n\nYou see, our God loves all of His creation and from the times of Adam &amp; Eve His story lived on. Passed down through the ages to Noah and his family, then onto their descendants. This didn't begin with Abraham and he wasn't the first to receive the Word of God; but the Jews and the Church are God's chosen people to carry us through until the 2nd coming of our Lord and Savior. So should it be surprising that other civilizations that also existed in ancient days had similar knowledge that was passed down fron the descendants of Noah?  That should not be surprising, since it also led to the Tower of Babel, its destruction and the scattering of people in their new tongues after the Flood.\n\nNotably the Chinese people have always been very adept at writing down history so things or events may be remembered for future generations. And their writings are unique because of its characters or symbols are used in picture form which are still used today. But how many are aware that these ancient symbols were originally created to account for the biblical story-line and the Holiness of God 2500 years ago? In other words, from the very start of the Chinese writing, it was created to proclaim the Word of God within its charactures and relfect God's story in its symbols and how they are combined together to from meanings or words.\n\nHowever most modern Chinese are not even aware of how these symbols were used to form or represent meanings. Each characture or word has a purpose that tells us a story; e.g., create, prosperity, garden, forbid, tempter, greed/lust, worry, temptation/Sin, naked, hide, guilt, brother to form Murder and the mark placed on Cain, big boat, tower, confusion, divide, migrate, sacrifice, righteousness = Lamb over me with a spear through its side! in Singapore its simplified, righteousness = blood on the cross! Also eternal/the coming of Christ/washed as white as snow, and faith/confession/grace/salvation!\n\nIn 221 BC, Qin Shi Huang united China and built the Great Wall of China. There were many past Emperors who were believers in God as the knowledge was passed down over generations. Although Qin Shi Huang may not have been a believer, he knew God's word. So he changed the characture for Sin to better reflect the 4 Sins or contradictions in Genesis 3: 1-2, 4-5; the devil's manipulation of Eve to eat the fruit of the forbidden tree!  \n\nChristianity is not just an modern American faith. The ancient Chinese embraced the Word of God that was delivered onto man from long ago. This is their time to renew that faith and realize Christianity is not some modern religious concept. Their own language formed 4500 years ago that is still used today, speaks loudly of the Lord our God, to creation, to the flood, to the tower of Babel, to the sacrifical system, to the coming of Christ and His death on the cross, to the way we may be blessed, to what faith is all about, of our grace and Salvation in the blood of the Lamd of God. Their language shows that the Christian God is the same God of the Chinese people. The one Who is charactized and Whose story is told in their own writing, ranging back to their ancient roots or heritage!\n\nAlso something not stated in this video are the references found in the old writings of the ancient Chinese philosopher Confucius who established Confucianism in the 5 BC. He states that he was puzzled by the Shang Di God and the &quot;trinity&quot;. He is noted in questioning, How could three God's be One? To him, the trinity of the Godhead made no sense. As such, he was known for using that to promote his new religion.\n &lt;a href=&quot;\nhttp://www.godslastwarning.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.godslastwarning.com&lt;/a&gt;\n-----------------------------------------------------------------------------------------------------------------\n\nHISTORICAL (NON BIBLICAL) EVIDENCE OF THE EXISTENCE OF JESUS CHRIST:\nChris White presents the historical evidence for the existence of Jesus Christ vs the common skeptic views often promoted today.  Similar to modern archeology re-confirming biblical historicity that were once erroneously disputed among skeptics, the life of Jesus is well documented among many ancient historians, Roman Senators, Jewish Rabbi's, and etc.  Some of these accounts even discuss Jesus' supernatural miracles.\n\nEven in the modern &quot;scientific dictatorship&quot; and religious promotion of ancient pagan beliefs in modern-day Darwinism and &quot;Do as thou Wilt&quot; without guilt, the orthodoxy has been unable to conceal the truth of Jesus and the holy scriptures.  This modern-day resurgence merely exposes the deperation of modern atheists and pagans to obscure the public mindset of well-substantiated truths and the re-writing of history to conform to their own personal desires.   Although their attempts are seemingly endless, God has always provided mankind with the certainties of His word and circumstance.\n-----------------------------------------------------------------------------------------------------------------\n\nThe Dead Sea Scrolls Confirming the text of the Bible is unchanged over time! - Dr. Don Patton:\nh\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe The Above Statement and that the Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed...\n\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\n\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...hmmm sounds like some of us might be Immortal. (Ask your preacher about that)\n\nMore Torrents in this series at http://conspiracyhub.com/membershares.php?it=41 ALL TORRENTS are RELEASED here FIRST!!! The First down loaders of my torrents get the Main Hookups on my SERVER. This will get lightning fast downloads, FOR FREE. (The High Speed download wholesalers are going to hate me)I upload to OVER 13 Torrent sites and this site is uploaded 1st.\n\n\nMay Yahweh Bless You as He has me. Seed long and Prosper from the Blessings of our Lord. I have asked the Father to Bless all those that Seed Long.  \n\nDo Not believe anything you find here, search the Scriptures daily to determine the TRUTH.  Other Torrents in this Series at\n &lt;a href=&quot;\nhttp://conspiracyhub.com/membershares.php?it=41&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracyhub.com/membershares.php?it=41&lt;/a&gt;  \n\nGet info on the Take Over by The New World Order Below a\n\n &lt;a href=&quot;\nhttp://end-times-prophecy.com/blog/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://end-times-prophecy.com/blog/&lt;/a&gt;                                                                  Prophecy from Susan Davis &lt;a href=&quot;\nhttp://jesus-talks.com/blogs/blog1.php/creating-an-event-in-heaven&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://jesus-talks.com/blogs/blog1.php/creating-an-event-in-heaven&lt;/a&gt;                   A place where Jesus would feel at home. This is a new site still under construction. &lt;a href=&quot;\nhttp://www.khouse.org/topical_bible_study&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouse.org/topical_bible_study&lt;/a&gt;                                                       Free online Bible Study &lt;a href=&quot;\nhttp://www.babylonthegreatisfalling.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.babylonthegreatisfalling.net&lt;/a&gt;                                                            End Times Prophecy - Who is Babylon the Great &lt;a href=&quot;\nhttp://www.theberean.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theberean.org/&lt;/a&gt;                                                                                Daily Bible Study in Your Email &lt;a href=&quot;\nhttp://www.khouseafrica.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouseafrica.com/&lt;/a&gt;                                                                           Chuck Missler - Africa &lt;a href=&quot;\nhttp://www.store.khouse.org/store/catalog&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.store.khouse.org/store/catalog&lt;/a&gt;                                                        Chuck Missler - USA &lt;a href=&quot;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&lt;/a&gt;                                       Dehydrated Survival Food -  Excellent Taste &lt;a href=&quot;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&lt;/a&gt;          Chuck Missler - New Zealand, Australia, Pacific Rim\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n      :thankyou:    :thankyou:     Thank You JESUS  \n\n  ","torrent":{"xt":"urn:btih:aacc29a96ee69af6b93c6df3e7d9938d47113394","amp;dn":"POtHS+-+Holy+Treasures+-+43+-+Revelations+Unearthed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aacc29a96ee69af6b93c6df3e7d9938d47113394","infoHashBuffer":{"type":"Buffer","data":[170,204,41,169,110,230,154,246,185,60,109,243,231,217,147,141,71,17,51,148]},"announce":[],"urlList":[]}}