{"title":"When The Boat Comes In - Series 1 (1977) [DVDRip (XviD)]","uid":9351990,"size":6496627940,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ac4e95b2a20f6f458bd94e808b27a270a903b851&amp;dn=When+The+Boat+Comes+In+-+Series+1+%281977%29+%5BDVDRip+%28XviD%29%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"byx55","files":13,"time":1387144906,"description":"When The Boat Comes In\nThou shall hev a fishy on a little dishy \nThou shall hev a fishy when the boat comes in.\nExtract from the Theme Tune, based on a Northumberland folk song\n\nBritish drama series, showing on The BBC running from 1976 to 1981 (three seasons from 1976-77 and a fourth in 1981), starring James Bolam as Jack Ford, a First World War veteran who returns to his Tyneside town of Gallowshields.\nHe falls for Jessie Seaton, a local teacher, but just as they're about to marry, he ends up getting another woman pregnant and has to marry her. They both end up in increasingly loveless marriages.\n\nIn the meantime, Jack starts to work his way up in the world of 1920s England. From unemployed fitter, he gets elected local secretary of the fitters trade union. Associating with a rich industrialist, he starts getting into property of his own.\nFeatures a lot of contemporary politics, particularly of the trade union variety.\n\nThis show contains examples of:\nBritish Accents (a lot of Geordie and associated accents here)\nBritish Laws (a good amount of play is had with period British divorce laws; which essentially require Tom Seaton and Jack's wife, pregnant by Tom, to live apart until her divorce from Jack is finalised and require &quot;proof&quot; of adultery on Jack's part)\nThe Chessmaster (Jack himself, who does prison time for theft to get himself elected as head of the local branch of the Amalgamated Union of Fitters, a Â£400 a year position. He gets industrialist Sir Horatio Manners to give his fitters an increase in one pence on the hourly rate by pointing out that if he goes for not doing it, his successor will strike. When Sir Horatio calls in the favour by asking him to use his union role to slow down a rival machining company, Ford identifies that the company is using unsafe machines- and so is Sir Horatio. So they're both shut down)\n\nNo OSHA Compliance (One episode sees someone who is catching red hot rivets in a bucket as they're thrown down to him. It does not end well- he gets hit in the chest by one and dies as a result)\n\nOop North (the fictional town of Gallowshields)\nReal-Life Relative (Jessie Seaton, who Jack briefly has a relationship with is played by Susan Jameson, who was and still is married to James Bolam)\nSpanish Civil War\n\nThe Roaring Twenties (They're not that roaring in Tyneside)\nThe Troubles (Two of Jack's old war buddies arrive in Gallowshields. One is a member of the IRA. The other is part of the infamous &quot;Black and Tans&quot;. Both end up being killed in a shootout at Gallowshields station)\nTitle Drop (In a subtle way. The episode title is usually worked into dialogue or obviously referenced at some point. When the end credits begin, the episode title appears again, allowing you to go &quot;Ah! So that's what it means!&quot;\nA Touch of Class, Ethnicity and Religion (Class differences run very thick through the entire series)","torrent":{"xt":"urn:btih:ac4e95b2a20f6f458bd94e808b27a270a903b851","amp;dn":"When+The+Boat+Comes+In+-+Series+1+%281977%29+%5BDVDRip+%28XviD%29%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac4e95b2a20f6f458bd94e808b27a270a903b851","infoHashBuffer":{"type":"Buffer","data":[172,78,149,178,162,15,111,69,139,217,78,128,139,39,162,112,169,3,184,81]},"announce":[],"urlList":[]}}