{"title":"Accidents - Yael Hedaya.epub","uid":9303775,"size":528362,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ade875d4598d66472fbe6448880d85053a0040d4&amp;dn=Accidents+-+Yael+Hedaya.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1386282305,"description":"A captivating first novel of family, sex, love, and death from an &quot;extraordinary&quot; writer of &quot;remarkable emotional power&quot;\n(Maureen Howard, Los Angeles Times Book Review)\n\nFor Shira Klein, Yonatan Luria, and his daughter, Dana, it is winter-winter at work, winter among friends, winter at home, and winter of the heart. Yonatan is a marginal writer, a fifty-year-old widower left to raise his child alone. When he meets Shira, a bestselling author paralyzed by stage fright, the thaw begins as man, woman, and girl enter a halting romance, alternately tender and belligerent, generous and withdrawn.\n\nTo the accompaniment of a full chorus of voices-of friends, neighbors, ex-lovers, parents-speaking from the past as well as the present, this family in the making gropes its way toward the comfort of love while navigating through ordinary pains: a dying father, angry children, wounding moments, and a distressing difference in the writers' levels of success which they wish would vanish even as it grows.\n\nAn ensemble story marked by Yael Hedaya's exquisite sensitivity, Accidents follows its cast through fragility, vulnerability, and joy, accruing the small events of unremarkable days to produce a grand vision of the shared life. Rarely has the fictional world of family been plumbed with such knowingness, humor, and love.","torrent":{"xt":"urn:btih:ade875d4598d66472fbe6448880d85053a0040d4","amp;dn":"Accidents+-+Yael+Hedaya.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ade875d4598d66472fbe6448880d85053a0040d4","infoHashBuffer":{"type":"Buffer","data":[173,232,117,212,89,141,102,71,47,190,100,72,136,13,133,5,58,0,64,212]},"announce":[],"urlList":[]}}