{"title":"Hotel 1979 Hotel - Half Moon Silver 1980","uid":10251586,"size":109905920,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:aea06d74655035e5a5294da2b7463652eb85a6e7&amp;dn=Hotel+1979+Hotel+-+Half+Moon+Silver+1980&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"duncan5656","files":20,"time":1401358174,"description":"After various personnel changes marked their early formative years, the group solidified their lineup in 1976 with original members Marc Phillips on lead vocals/piano and Tommy Calton on guitar/vocals. Rounding out the most-popular formation of this group were Lee Bargeron on keyboards/acoustic guitar/vocals, Mike Reid on guitar/vocals, George Creasman on bass/vocals, and Michael Cadenhead on drums/vocals, which is the lineup that recorded their 2 MCA studio albums.\n\nHotel was a popular favorite on the southeastern United States Rock-n-Roll club scene and played in all the best and largest clubs, as well as fronting concerts for many national acts who toured through the area in the mid-to-late 1970s. Their original songs were highly laced with pop hooks and heavy vocal harmonies, sometimes 6-part. Their sound was relative to power pop groups such as The Rascals and Raspberries but with a more-polished sound and much-higher musicianship; they routinely peppered their sets with tunes that showed off their musical prowess by covering difficult-to-play songs note-for-note by acts such as Steely Dan. Phillips' lead vocal also gave the group an identifiable trademark that combined a good range with exceptional quality.\n***************************************************************************\nIn 1978, Hotel released a single for Mercury Records, &quot;You'll Love Again.&quot; It reached No. 71 on the Billboard Hot 100, and it was very popular in its regional area where the band toured constantly and built a solid following.\n\nIn 1979, they signed with MCA Records and released their debut album. Simply entitled &quot;Hotel&quot;, the album was a collection of power-pop tunes. MCA released the songs &quot;You've Got Another Thing Coming&quot; which reached No. 54, becoming the band's highest charting single, and &quot;Hold On To The Night&quot;, penned by Phillips and prolific 1960s songwriter Barry Mann (co-writer of &quot;On Broadway&quot;, &quot;You've Lost That Lovin' Feelin'&quot; and many more).\n\nIt appeared that by 1980, with popular music moving away from power pop, not to mention progressive rock, punk and disco, these elements would eventually meld themselves into New Wave, which combined elements of all these styles using a combination synthesizer and guitar-based sound. Although rock purists saw it as a soulless and fleeting style, it became nevertheless a new marketable formula for pop radio success at that time. This style was first captured by acts such as Elvis Costello, The Cars and Blondie in the late 1970s, and was the norm for pop-rock artists by the 1980s who did not slip into the post punk genre or the few true rock artists who followed Van Halen into hair band pop metal a few years later.\n\nSeeing this change in the music environment taking place, Hotel began work on their second album, &quot;Half-Moon Silver&quot;, which was released by MCA in 1980. This second album contained strong power pop tunes and was quite a bit edgier than the debut album. It lacked proper promotion and sold even less than the debut album, which led MCA to drop the act. The group stayed together as the perennial star of the club circuit and disbanded in 1982.\n","torrent":{"xt":"urn:btih:aea06d74655035e5a5294da2b7463652eb85a6e7","amp;dn":"Hotel+1979+Hotel+-+Half+Moon+Silver+1980","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aea06d74655035e5a5294da2b7463652eb85a6e7","infoHashBuffer":{"type":"Buffer","data":[174,160,109,116,101,80,53,229,165,41,77,162,183,70,54,82,235,133,166,231]},"announce":[],"urlList":[]}}