{"title":"Need For Speed - Underground by relentlesstech (2003)","uid":9342162,"size":1425712035,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:af91c65ae20f62a81ae9ce5b048e0c18b665d4af&amp;dn=Need+For+Speed+-+Underground+by+relentlesstech+%282003%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"relentlesstech","files":-1,"time":1386955817,"description":"Need for Speed: Underground was developed by EA Black Box and released on November 17, 2003. This was the first Need for Speed to require Hardware Transform and Lighting in Graphics Cards. Most of the new elements in Underground have become defining marks of later installments in the Need for Speed series.\n\nUnderground proposed a shift from semi-professional racing and isolated circuits to the street racing style of other arcade racing series: all circuits are now part of a single map, Olympic City, except for drifts. Underground game introduced three new play modes (Drag, Drift and Sprint) and tuning with more options than in the previous attempt, High Stakes. Underground was also the first game in the series to feature a story, told via pre-rendered videos, completely rebooting the franchise.\n\nUnderground features tuner cars and focuses on the import tuner culture shown in movies like the Fast and the Furious and 2 Fast 2 Furious and this video game has some competition with the Midnight Club Series. The game has a wide variety of tuning options such as widebody kits, bumpers, spoilers, rims, hoods, roof scoops, window tints, neon lighting, decals, vinyls, paint and performance upgrades such as engine and nitrous. City street racing is the primary focus of the game.\n\nDue to law enforcement reasons, there were no cops in Underground and Underground 2, which drew criticism as cops were an important part of previous titles' gameplay. The game received good reviews, which generally criticised cops not being in the game.","torrent":{"xt":"urn:btih:af91c65ae20f62a81ae9ce5b048e0c18b665d4af","amp;dn":"Need+For+Speed+-+Underground+by+relentlesstech+%282003%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af91c65ae20f62a81ae9ce5b048e0c18b665d4af","infoHashBuffer":{"type":"Buffer","data":[175,145,198,90,226,15,98,168,26,233,206,91,4,142,12,24,182,101,212,175]},"announce":[],"urlList":[]}}