{"title":"Mutation(s)","uid":9368481,"size":3303833939,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:b0b2417bec609371809e15a8295f6442af459e24&amp;dn=Mutation%28s%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"JMPW","files":78,"time":1387477402,"description":"I cannot afford to print or publish my own works.  Therefore, I release this to you under Creative Commons license.  Feel free to manipulate and/or distribute, but please give credit where it is due.\n\nI can be contacted via e-mail at:\n\nIt is an honor to live in a world where this is possible.\n\nTorrent includes:\n\n- HD quality video\n- SD quality video\n- 3-D video (anaglyph)\n- Full-length ambient album\n- 40 digital prints (36x27 and up)\n\nThe Mutation(s) project began as a simple calendar, using original paintings as the basis.  As I began digitally modifying these works, I noticed the efficiency of using a computer to manipulate the images in ways that cannot be replicated on a canvas.  So, I took the 10 original paintings that I had so far, and began mutating them to my own strange tastes.  It dawned on me that a video slideshow would be a very effective and original way of showing off my works.  \n\nOf course, by this point, I needed some audio to put behind the slideshow.  So, I took individual clips from The Conet Project and NASA's Voyager recordings, and mutated them into ambient soundscapes.  The CD folder includes blank tracks, numbered in proper burning order.  It was my intention to have a hidden track 13, but I am unable to replicate this effect in torrent distribution.  Please burn all tracks in order, if you wish to hear the album in its original form.\n\nThe videos are all 4:3, as this was the aspect ration of most of my original works.  If you can watch the HD version, please do, it shows off the intricacy of my works much better than SD.  You will need red/cyan 3-D glasses to watch the 3-D version.\n\n-Jacob Michael Peter Welch (JMPW)","torrent":{"xt":"urn:btih:b0b2417bec609371809e15a8295f6442af459e24","amp;dn":"Mutation%28s%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0b2417bec609371809e15a8295f6442af459e24","infoHashBuffer":{"type":"Buffer","data":[176,178,65,123,236,96,147,113,128,158,21,168,41,95,100,66,175,69,158,36]},"announce":[],"urlList":[]}}