{"title":"Wicked Passions 2013 Wicked Pictures","uid":9431379,"size":2827894628,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b28baf5d5ddb600b192dd7ff5d9dc0b159e2b24f&amp;dn=Wicked+Passions+2013+Wicked+Pictures&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"grighta","files":3,"time":1388812107,"description":"Wicked Pictures scored a bunch of nominations for XBIZ 2014 Couples-Themed Release of the Year (for films from 2013) - Bikini Outlaws, Change of Heart, Rebound and Tuff Love in the running. Only Rebound is from their &quot;Wicked Passions&quot; series. The other films from this series, If You Only Knew and Meant To Be, were nominees for the 31st AVN awards Best Romance Movie (the full list of nominees is at https://en.wikipedia.org/w/index.php?title=31st_AVN_Awards&amp;oldid=587784269 )\n\nIf You Only Knew - https://thepiratebay.se/torrent/8109047\nLoyal and hardworking, Kellie is the longtime assistant to Mark, a powerful land developer. She secretly harbors a crush on her boss who is clearly oblivious. He's too busy with his gold digging girlfriend and high profile projects to notice. But when a tragic accident occurs, the hard-nosed businessman seeks the solace and comfort of his biggest supporter.\n\nRebound - http://www.adultfilmdatabase.com/video.cfm?videoid=101240\nTessa Kendall is a celebrated author, often referred to as a &quot;love guru&quot; by fans. Intimate photos of her long time boyfriend and another woman surface while Tessa is on a morning television talk show, and Tessa seeks refuge at her brother's mountain cabin. What she doesn't expect is to find a new friend in a handsome local named Zach. Feeling like the last person who should be writing relationship advice and pleasantly distracted by Zach, she lets loose. With feelings for Zach, but gun shy of betrayal she seeks the answer to the question, is it love or truly just a rebound?\n\nMeant To Be - http://www.adultfilmdatabase.com/video.cfm?videoid=101605\nMeant To Be is a sexy, romantic and engaging story about Sara (Lexi Belle) and her childhood best friend, Jacob (James Deen). Sara always had feelings for Jacob but he never felt the same way ... or so she thought! The night before she's set to leave for college - Jacob confesses his love for her with a long awaited proposal. Unfortunately, Jacob's confession isn't enough - as Sara goes off to college. Several years pass and Sara returns home with her fiancee Michael, and has to decide between her &quot;new love&quot; or &quot;old love&quot; and ultimately decide what is ... Meant To Be!\n\nFeminist Porn Reviews' Wicked Passions review says:\n\nWicked Passions is the female-friendly imprint of Wicked Pictures, which is one of the top mainstream porn studios. Wicked's main offerings tend to be pretty inoffensive, as mainstream porn goes, and they were the first major studio to mandate the use of condoms in all their movies.\n\nAfter the first four films [crossing 2011 and 2012], the series undergoes a bit of a transformation, as the films become (with one exception) story-oriented, as several of Wicked's usual directors start to participate. Stormy Daniels, Brad Armstrong, Barrett Blade, and Francois Clousot have all directed films in the series. Some of these have been more successful than others, but The Fate of Love (2011), directed by Daniels, and Love Blossoms (2012), directed by Blade, are both well worth watching. That said, the series overall has not been terribly successful, and the releases have been quite slow of late, with just two in the first six months of 2013.","torrent":{"xt":"urn:btih:b28baf5d5ddb600b192dd7ff5d9dc0b159e2b24f","amp;dn":"Wicked+Passions+2013+Wicked+Pictures","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b28baf5d5ddb600b192dd7ff5d9dc0b159e2b24f","infoHashBuffer":{"type":"Buffer","data":[178,139,175,93,93,219,96,11,25,45,215,255,93,157,192,177,89,226,178,79]},"announce":[],"urlList":[]}}