{"title":"reader's Digest US 01/2014","uid":9339811,"size":20073666,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b2cb951fad16f76c6ac1f1af1150a416d0ecd624&amp;dn=reader%27s+Digest+US+01%2F2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sidmal","files":-1,"time":1386906984,"description":"Reader's Digest USA - January 2014 \nEnglish | 156 pages | True PDF | 19.50 Mb\n\nReader's Digest is an American general interest family magazine, published monthly (except for a short period between 2010 and 2012 when the American edition was published ten times per year).[2] Formerly based in Chappaqua, New York, its headquarters is now in New York City. It was founded in 1922, by DeWitt Wallace and Lila Bell Wallace. For many years, Reader's Digest was the best-selling consumer magazine in the United States, losing the distinction in 2009 to Better Homes and Gardens. According to Mediamark Research, it reaches more readers with household incomes of $100,000+ than Fortune, The Wall Street Journal, Business Week and Inc. combined.[3]\n\nGlobal editions of Reader's Digest reach an additional 40 million people in more than 70 countries, with 49 editions in 21 languages. It has a global circulation of 10.5 million, making it the largest paid circulation magazine in the world. It is also published in Braille, digital, audio, and a version in large type called Reader's Digest Large Print. The magazine is compact, with its pages roughly half the size of most American magazines'. Hence, in the summer of 2005, the U.S. edition adopted the slogan, &quot;America in your pocket.&quot; In January 2008, it was changed to &quot;Life well shared.&quot;\n","torrent":{"xt":"urn:btih:b2cb951fad16f76c6ac1f1af1150a416d0ecd624","amp;dn":"reader%27s+Digest+US+01%2F2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2cb951fad16f76c6ac1f1af1150a416d0ecd624","infoHashBuffer":{"type":"Buffer","data":[178,203,149,31,173,22,247,108,106,193,241,175,17,80,164,22,208,236,214,36]},"announce":[],"urlList":[]}}