{"title":"Saxon - Unplugged And Strung Up [Deluxe Edition 2CD] (320CBR) [M","uid":9303079,"size":314845949,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b56d6a674a02d006a73d735204743ac5ff9d584c&amp;dn=Saxon+-+Unplugged+And+Strung+Up+%5BDeluxe+Edition+2CD%5D+%28320CBR%29+%5BM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MentalZero","files":33,"time":1386274570,"description":"The British heavy metal legends produce a series of alternative takes on classic favorites to herald a worthy new entry to the Saxonian Institute of Metal.\n\n\n\nThere is always feral beauty in a raging beast...and with Unplugged and Strung Up, Saxon's selection of unique, fresh and adventurous interpretations of material previously heard only with raw heavy metal thunder, the point is triumphantly underscored.\n\n\n\nUnplugged and Strung Up reveals layers and pieces previously dormant in many of the 14 classic Saxon songs chosen for this makeover, thanks to some ear-catching new arrangements and mixes. Recorded, mixed and mastered with Andy Sneap in Derbyshire, UK earlier this year, Biff and co re-evaluated, re-worked and re-energized the towering likes of &quot;The Eagle Has Landed&quot; and &quot;Crusader&quot; by introducing orchestral dynamics to offer added dimension. &quot;Frozen Rainbow&quot; from the band's 1979 debut, gets a stunning acoustic reprisal which transports it into a power ballad to be proud of, whilst &quot;Red Star Falling&quot; soars and sweeps the emotions with it's orchestrally-arranged dovetail.\n\nSAXON's selection of unique, fresh and adventurous interpretations of material previously heard only with raw heavy metal thunder, &quot;Unplugged And Strung Up&quot; was released on November 18. The effort reveals layers and pieces previously dormant in many of the 14 classic SAXON songs chosen for this makeover, thanks to some ear-catching new arrangements and mixes. Recorded, mixed and mastered with Andy Sneap in Derbyshire, U.K. earlier this year, &quot;Unplugged And Strung Up&quot; contains re-evaluated, re-worked and re-energized versions of &quot;The Eagle Has Landed&quot; and &quot;Crusader&quot; by introducing orchestral dynamics to offer added dimension. &quot;Frozen Rainbow&quot;, from the band's 1979 debut, gets a stunning acoustic reprisal which transports it into a power ballad to be proud of, while &quot;Red Star Falling&quot; soars and sweeps the emotions with its orchestrally arranged dovetail.\n\nAs if this reinvention wasn't enough, SAXON superfans and collectors can purchase a digipak version of the release which includes 2002's storming set of full-volume, pedal-to-the-metal re-recorded hits &quot;Heavy Metal Thunder&quot;. Featuring staple SAXON stormers such as &quot;Motorcycle Man&quot;, &quot;Strong Arm Of The Law&quot; and &quot;Dallas 1pm&quot;, it is a quintessential part of any collection.\n\nSaxon are an English heavy metal band, formed in 1976 in Barnsley, Yorkshire. As front-runners of the New Wave of British Heavy Metal, they had 8 UK Top 40 albums in the 1980s including 4 UK Top 10 albums. Saxon also had numerous singles in the Top 20 singles chart. Between 1980 and 1987 Saxon established themselves as one of Europe's biggest metal acts, they also had success in Japan and in the USA. In Japan, the single &quot;Motorcycle Man&quot; stayed in the charts for over 5 months. They still tour regularly and have sold more than 13 million albums worldwide. Saxon have also influenced many bands from Metallica and Megadeth.","torrent":{"xt":"urn:btih:b56d6a674a02d006a73d735204743ac5ff9d584c","amp;dn":"Saxon+-+Unplugged+And+Strung+Up+%5BDeluxe+Edition+2CD%5D+%28320CBR%29+%5BM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b56d6a674a02d006a73d735204743ac5ff9d584c","infoHashBuffer":{"type":"Buffer","data":[181,109,106,103,74,2,208,6,167,61,115,82,4,116,58,197,255,157,88,76]},"announce":[],"urlList":[]}}