{"title":"Ernest Volkman - Science Goes to War; The Search for the Ultimat","uid":9322036,"size":1960992,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b91b81778a8dcb92eb75276d7e330de8462a8cae&amp;dn=Ernest+Volkman+-+Science+Goes+to+War%3B+The+Search+for+the+Ultimat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"conspiracyPDF","files":1,"time":1386569471,"description":"Ernest Volkman - Science Goes to War; The Search for the Ultimate Weapon, From Greek Fire to Star Wars (2002)\n\n&quot;It was a thing blameworthy, shameful and barbarous, worthy of severe punishment before God and Man, to wish to bring to perfection an art damageable to one's neighbor and destructive to the human race.&quot;\nThis anguished statement from the fifteenth-century Italian mathematician known as Tartaglia, who created the science of ballistics, might have come from any one of thousands of brilliant scientists who, throughout history, have applied their genius to the art of war. Every advance in weaponry from the bronze sword to the stealth bomber has been the product of science, and it is likely that without the pressure of war, science as we know it would not exist.\nScience Goes to War examines the moral dilemmas, knotty technological problems, and pragmatic necessities that have punctuated the inseparable histories of science and warfare. This remarkably comprehensive volume recounts the 4,000-year quest for the ultimate weapon and reveals how this eternal arms race has both exploited and contributed to &quot;pure&quot; science. Highlights among the many compelling stories in Science Goes to War include:\n* Archimedes and the defense of Syracuse\n* Galileo and the first military R&amp;D laboratory\n* Emperor Meiji and the technological transformation of Japan\n* The Manhattan Project","torrent":{"xt":"urn:btih:b91b81778a8dcb92eb75276d7e330de8462a8cae","amp;dn":"Ernest+Volkman+-+Science+Goes+to+War%3B+The+Search+for+the+Ultimat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b91b81778a8dcb92eb75276d7e330de8462a8cae","infoHashBuffer":{"type":"Buffer","data":[185,27,129,119,138,141,203,146,235,117,39,109,126,51,13,232,70,42,140,174]},"announce":[],"urlList":[]}}