{"title":"POtHS - Creation - 79 - Evolution Conspiracy","uid":9418302,"size":11390905818,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b970b6a8cc583a2a9514da9c800f3fe9dd267e5b&amp;dn=POtHS+-+Creation+-+79+-+Evolution+Conspiracy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"POtHS11","files":70,"time":1388503208,"description":"\nPOtHS - E V I L - U T I O N - School Your Professor on The Facts\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8865248/POtHS_-_E_V_I_L_-_U_T_I_O_N_-_School_Your_Professor_on_The_Facts&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8865248/POtHS_-_E_V_I_L_-_U_T_I_O_N_-_School_Your_Professor_on_The_Facts&lt;/a&gt;\n\nreligious-christian-icons-337.gif\n\n\nPO t HS\n\nPouring Out the Holy Spirit\n\nPOtHS - Creation - 79 - Evolution Conspiracy\n\n\n\nPOtHS Comment: Everything you learned in School about Evolution being a Scientific Fact is a LIE. Here is some proof.\n\nINTRODUCTION\n\nUFOs - Jose Escamilla Bundle (2007-2012) xvid avi\n\nA collection of Docu Films produce by Jose on UFOs, Critters, Rods\nand Moon Image Blurring weather its proof of cover up or tech issues\ntime will tell when new power camera and surveys are done\nbut who knows if its moving machines on the moon next time they snap\nthey wont be there.. maybe they building did exist and got moved\neither way its a great story.\n\nMoon Views was not greatest story denied Part III\nas you can see that comes out this year - see the trailer\n\n\nSome Info on Moon RIsing (aka Greatest Story ever denied Parts I, II and III)\nIn 2009, Jose Escamilla produced Moon Rising, a three part documentary based on his work colorizing 274 photos of the moon. As well, his movie exposes the epic cover-up of what the Moon is, what is up there, what is looks like, and so much more. We thought it was time to revisit this important film that exposes the greatest story ever denied.\n\nHere is the official description of Moon Rising:\nOn February 25,1994 1.8 million photos were taken of the Moon during the Clementine Mission. Different variations were taken including Full Color photos. . . . This is the first time in human history the Moon is being revealed to you in its Full Natural Color.\n\nOn the matter concerning whether or not we went to the Moon, we landed there without a doubt. This film is about what was waiting for us when we got there and the lies put in motion in order to conceal what was found. Moon researchers and investigators appearing in this film disclose facts hidden from you for over forty years. The facts will amaze and shock you at the same time. You may ask yourself why these lies have been impressed upon us all these year\n\n\nRODS - A Strange UFO Mystery:\nFeature Film by Jose Escamilla and UFOTV. Rods are cylindrical or cigar shaped objects that have been discovered appearing in the skies. The objects are not like the typical &quot;cigar&quot; shaped UFOS that have been reported throughout history.\n\nThe following are characteristics of Rods gathered over the past five years of videotaped evidence and research: They are from four inches to a few feet in length. Some are thin like spears. Some Rods have what appear to be &quot;appendages&quot; along their torsos resembling Centipedes. They travel at extremely high velocities barely visible with the naked eye. They do exhibit some form of intelligence. They are appearing everywhere. They don't appear to be mechanical or made of metal. They appear to be alive!\n\nJose Escamilla has been editing film and video for over 17 years and has produced many films and arranged and performed all the music for Tito Guizar, well known as the Mexican Troubador. He has also appeared on many national TV and radio broadcasts.\n\n\nCELESTIAL:\nCELESTIAL - a JOSE ESCAMILLA film:\nThe film that challenges anyone to prove that the Moon is grey. This film proves the Moon is a full color celestial body and that there are incredible structures and towers built by &quot;someone&quot; that has the ability to build a structure ten miles wide and six miles high within an eight month period. The evidence is presented and you will be amazed at what you will see in this film. CELESTIAL brings you the&quot;full color&quot; photography of the Moon taken during the Clementine Mission in 1994. The Moon's natural colors are breathtaking. We are visiting another world for the first time, a Celestial Body that has orbited earth for billions of years.  The full color and image resolutions are amazing and the evidence of structures and related phenomena are incredible.\n &lt;a href=&quot;\nhttp://thecelestialmovie.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thecelestialmovie.com/&lt;/a&gt;\n\nSpecial Note:\nThis film provides much evidence on one of many deceptions which the govt and scientific community blatanly lie about to the public.  The unanswered questions not addressed in this film are:\nWhy are they hiding this information; what is their motive(s)?\nHow many more lies have yet to be exposed (or accepted)?\nFor what purpose(s), plan(s) or agenda(s)?\nHow are we to rely on them if they cannot be trusted?\nAnd so on...\n\nUnfortunately, the answers to these questions we have to research and find for ourselves.  I sincerely hope others will begin to awake to the &quot;Truth&quot; and discover who/what are behind these deceptions and realize the true nature of deceit.  This is the purpose behind this POtHS series: to inform others of the deceptions, their purppose, agendas and expectations for our future.  I hope you will be the next to see our one and only &quot;Truth, Light and Salvation&quot; which will swiftly end this madness and provide us with an eternal resting place and countless blessings.  \n\n\n\nCELESTIAL - a JOSE ESCAMILLA film:\nThe film that challenges anyone to prove that the Moon is grey. This film proves the Moon is a full color celestial body and that there are incredible structures and towers built by &quot;someone&quot; that has the ability to build a structure ten miles wide and six miles high within an eight month period. The evidence is presented and you will be amazed at what you will see in this film. CELESTIAL brings you the&quot;full color&quot; photography of the Moon taken during the Clementine Mission in 1994. The Moon's natural colors are breathtaking. We are visiting another world for the first time, a Celestial Body that has orbited earth for billions of years.  The full color and image resolutions are amazing and the evidence of structures and related phenomena are incredible.\n &lt;a href=&quot;\nhttp://thecelestialmovie.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thecelestialmovie.com/&lt;/a&gt;\n\nSpecial Note:\nThis film provides much evidence on one of many deceptions which the govt and scientific community blatanly lie about to the public.  The unanswered questions not addressed in this film are:\nWhy are they hiding this information; what is their motive(s)?\nHow many more lies have yet to be exposed (or accepted)?\nFor what purpose(s), plan(s) or agenda(s)?\nHow are we to rely on them if they cannot be trusted?\nAnd so on...\n\nUnfortunately, the answers to these questions we have to research and find for ourselves.  I sincerely hope others will begin to awake to the &quot;Truth&quot; and discover who/what are behind these deceptions and realize the true nature of deceit.  This is the purpose behind this POtHS series: to inform others of the deceptions, their purppose, agendas and expectations for our future.  I hope you will be the next to see our one and only &quot;Truth, Light and Salvation&quot; which will swiftly end this madness and provide us with an eternal resting place and countless blessings.  \n\n\nInterstellar UFO Movie by Jose Escamilla:\n&quot;Interstellar is a film to be long remembered for generations to come. You are immediately made aware of the fact these things are in orbit in deep space yet not so far away. As you view this film, you might be surprised how many of them resemble things depicted in some of the more recent blockbuster feature films.&quot; Jose Escamilla\n\nStills taken from an up and coming film entitled, &quot;Interstellar&quot;. Best watched on big screen. They are up there, I have seen them. But what they are or whom they are, I do not know.\n\nCheck out the ectoplasm picked up by the CCD camera chip in the pictures around .44 seconds into the video.\n\nRead more: http://www.disclose.tv/action/viewvideo/1203/Jose_Escamilla___Interstellar_UFO_Movie/#ixzz2dbGA3Aka\n\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe The Above Statement and that the Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed...\n\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\n\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...hmmm sounds like some of us might be Immortal. (Ask your preacher about that)\n\n\nMay Yahweh Bless You as He has me. Seed long and Prosper from the Blessings of our Lord. I have asked the Father to Bless all those that Seed Long.  \n\nDo Not believe anything you find here, search the Scriptures daily to determine the TRUTH.  Other Torrents in this Series at\n\n\nGet info on the Take Over by The New World Order Below a\n\n &lt;a href=&quot;\nhttp://end-times-prophecy.com/blog/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://end-times-prophecy.com/blog/&lt;/a&gt;                                                                  Prophecy from Susan Davis &lt;a href=&quot;\nhttp://jesus-talks.com/blogs/blog1.php/creating-an-event-in-heaven&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://jesus-talks.com/blogs/blog1.php/creating-an-event-in-heaven&lt;/a&gt;                   A place where Jesus would feel at home. This is a new site still under construction. &lt;a href=&quot;\nhttp://www.khouse.org/topical_bible_study&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouse.org/topical_bible_study&lt;/a&gt;                                                       Free online Bible Study &lt;a href=&quot;\nhttp://www.babylonthegreatisfalling.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.babylonthegreatisfalling.net&lt;/a&gt;                                                            End Times Prophecy - Who is Babylon the Great &lt;a href=&quot;\nhttp://www.theberean.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theberean.org/&lt;/a&gt;                                                                                Daily Bible Study in Your Email &lt;a href=&quot;\nhttp://www.khouseafrica.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouseafrica.com/&lt;/a&gt;                                                                           Chuck Missler - Africa &lt;a href=&quot;\nhttp://www.store.khouse.org/store/catalog&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.store.khouse.org/store/catalog&lt;/a&gt;                                                        Chuck Missler - USA &lt;a href=&quot;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&lt;/a&gt;                                       Dehydrated Survival Food -  Excellent Taste &lt;a href=&quot;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&lt;/a&gt;          Chuck Missler - New Zealand, Australia, Pacific Rim\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n      :thankyou:    :thankyou:     Thank You JESUS  \n\n  ","torrent":{"xt":"urn:btih:b970b6a8cc583a2a9514da9c800f3fe9dd267e5b","amp;dn":"POtHS+-+Creation+-+79+-+Evolution+Conspiracy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b970b6a8cc583a2a9514da9c800f3fe9dd267e5b","infoHashBuffer":{"type":"Buffer","data":[185,112,182,168,204,88,58,42,149,20,218,156,128,15,63,233,221,38,126,91]},"announce":[],"urlList":[]}}