{"title":"DeviceBondage--DB-11393 Ariel X","uid":9373744,"size":2826838059,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:b984e82c2680a92668b7bbf4faae5720311cf36f&amp;dn=DeviceBondage--DB-11393+Ariel+X&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1387579726,"description":"Ariel X. Enough said. \nCountdown to Relaunch-15 of 20\n\nDec 20, 2013 - Performers: Ariel X \n\n\nMed, Hi and HD MP4, WMV + Pics.\n\n\nAriel X has one of the tightest sexiest bodies one can ever hope to strap down and fuck with. So I do exactly that. A strap over her chest and a strap on her hips. Never has Ariel felt so vulnerable with such little bondage. To perfect this body I hoist her back up into her full potential of a back arch. Some finger fucking to get her wet and ready for whats to come. Her nipples are stretched and she is covered with black clamps, especially on the pussy. Then she is caned and fucked, able to feel every clip shake with every thrust. \n\nNext, Ariel is chained and restrained at a spread. I warm her up with some vicious cattle prodding. I find her weak spots, which is just enough to loosen that asshole. I shove a dick in her and fuck her to near orgasm, then leave her there like a human tripod. I tie her nipples to her toes to keep her still, then it's time for an old fashion zipper. I flip nine her ass and nipples until she is ready to give me what I want. Dick in her ass, I shove another in her pussy and vibe her to orgasm. When I'm done I hoist her up by her arms attached to a crotch chain and watch her agony surface as she kicks and squirms for unattainable relief. \n\nThis last one is for me and Ariel, so you're welcome for being invited. A straight jacket, electric plug and a tie from foot to throat. Any time I jolt her strong enough she can only kick with the leg that will intentionally choke her. A build up that leads to the juice turned all the way up in order for Ariel to cum. Mission accomplished. \n\nScreens &lt;a href=&quot;\nhttp://www.devicebondage.com/site/shoot/11393-Ariel-X-Enough-said-Countdown-to-Relaunch-15-of-20.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.devicebondage.com/site/shoot/11393-Ariel-X-Enough-said-Countdown-to-Relaunch-15-of-20.html&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\n\n","torrent":{"xt":"urn:btih:b984e82c2680a92668b7bbf4faae5720311cf36f","amp;dn":"DeviceBondage--DB-11393+Ariel+X","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b984e82c2680a92668b7bbf4faae5720311cf36f","infoHashBuffer":{"type":"Buffer","data":[185,132,232,44,38,128,169,38,104,183,187,244,250,174,87,32,49,28,243,111]},"announce":[],"urlList":[]}}