{"title":"Yes 24 Bit Vinyl Pack","uid":9342260,"size":19837067637,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ba323ef3d48f3f2f50eceaf7e6b0d1df6db2752c&amp;dn=Yes+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"politux","files":-1,"time":1386958244,"description":"\n  Yes 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Album Rock, Art Rock, Psychedelic, Prog-Rock\n  Source: vinyl\n  Codec: FLAC\n  Bit Rate: ~ 3,000 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  1971 The Yes Album (two versions)\n  1971 Fragile \n  1971 Fragile (180g)\n  1971 Fragile (PBTHAL)\n  1972 Close to the Edge\n  1973 Relayer (two versions)\n  1975 Yesterdays (UK original)\n  1977 Boston Garden 8/12/77\n  1977 Providence Civic Center 8/15/77\n  1978 Tomato \n  1980 Drama (PBTHAL)\n  1983 90125 (two versions)\n  1985 9012Live: The Solos\n  1999 The Ladder (UK)\n  \n  Far and away the longest lasting and the most successful of the '70s progressive rock groups, Yes proved to be one of the lingering success stories from that musical genre. The band, founded in 1968, overcame a generational shift in its audience and the departure of its most visible members at key points in its history to reach the end of the century as the definitive progressive rock band. Where rivals such as Emerson, Lake &amp; Palmer withered away commercially after the mid-'70s, and Genesis and King Crimson altered their sounds so radically as to become unrecognizable to their original fans, Yes retained the same sound, and performed much of the same repertoire that they were doing in 1971, and for their trouble, they found themselves being taken seriously a quarter of a century later. Their audience remained huge because they had always attracted younger listeners drawn to their mix of daunting virtuosity, cosmic (often mystical) lyrics, complex musical textures, and powerful yet delicate lead vocals.\n\n  Lead singer Jon Anderson (b. October 25, 1944, Accrington, Lancashire) started out during the British beat boom as a member of the Warriors, who recorded a single for Decca in 1964; he was later in the band Gun before going solo in 1967 with two singles on the Parlophone label. He was making a meager living cleaning up at a London club called La Chasse during June of 1968, and was thinking of starting up a new band. One day at the bar, he chanced to meet bassist/vocalist Chris Squire, a former member of the band the Syn, who had recorded for Deram, the progressive division of Decca.\n\n The two learned that they shared several musical interests, including an appreciation for the harmony singing of Paul Simon and Art Garfunkel, and within a matter of days were trying to write songs together. They began developing the beginnings of a sound that incorporated harmonies with a solid rock backing, rooted in Squire's very precise approach to the bass. Anderson and Squire saw the groups around them as having either strong vocals and weak instrumental backup, or powerful backup and weak lead vocals, and they sought to combine the best of both. Their initial inspiration, at least as far as the precision of their vocals, according to Squire, was the pop/soul act the Fifth Dimension.\n\n  They recruited Tony Kaye (b. January 11, 1946), formerly of the Federals, on keyboards; Peter Banks (b. July 7, 1947, d. March 8, 2013), previously a member of the Syn, on guitar; and drummer Bill Bruford (b. May 17, 1948), who had only just joined the blues band Savoy Brown a few weeks earlier. The name Yes was chosen for the band as something short, direct, and memorable.\n\n  The British music scene at this time was in a state of flux. The pop/psychedelic era, with its pretty melodies and delicate sounds, was drawing to a close, replaced by the heavier sounds of groups like Cream. Progressive rock, with a heavy dose of late 19th century classical music, was also starting to make a noise that was being heard, in the guise of acts such as the Nice, featuring Keith Emerson, and the original Deep Purple.\n\n  The group's break came in October of 1968 when the band, on the recommendation of the Nice's manager, Tony Stratton-Smith (later the founder of Charisma Records), played a gig at the Speakeasy Club in London, filling in for an absent Sly &amp; the Family Stone. The group was later selected to open for Cream's November 26, 1968, farewell concert at Royal Albert Hall. This concert, in turn, led to a residency at London's Marquee Club and their first radio appearance, on John Peel's Top Gear radio show. They subsequently opened for Janis Joplin at her Royal Albert Hall concert in April 1969, and were signed to Atlantic Records soon after.","torrent":{"xt":"urn:btih:ba323ef3d48f3f2f50eceaf7e6b0d1df6db2752c","amp;dn":"Yes+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba323ef3d48f3f2f50eceaf7e6b0d1df6db2752c","infoHashBuffer":{"type":"Buffer","data":[186,50,62,243,212,143,63,47,80,236,234,247,230,176,209,223,109,178,117,44]},"announce":[],"urlList":[]}}