{"title":"The Fauns - Lights (2013) [FLAC]","uid":9307846,"size":260650594,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:baa9050d3d05008a2dccc7bd4473731def21ed5d&amp;dn=The+Fauns+-+Lights+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"politux","files":-1,"time":1386348226,"description":"\n  The Fauns - Lights (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Dream Pop, Shoegaze\n  Source: CD (log + cue) \n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Point Zero \n  02 Seven Hours \n  03 Ease Down \n  04 In Flames \n  05 Nothing Ever \n  06 Lights \n  07 Rise \n  08 4 am \n  09 With You \n  10 Let's Go \n  11 Give Me Your Love \n\n   Given Invada Records' reputation for releasing more offbeat artists and albums, it's a little surprising that they're the home of Fauns, a quintet that specializes in shoegaze that sounds like it's straight out of 1991. However, the quality of Lights is undeniable, and in their hands, shoegaze's basic ingredients -- spun-sugar vocals, onslaughts of gorgeously distorted guitars, ecstatic crescendos -- sound just as inspired as they did when they first appeared decades before. Singer Alison Garner's voice makes Fauns' dream pop sound especially authentic, evoking the icy purity of Rachel Goswell or Miki Berenyi on songs like the lovely &quot;Seven Hours&quot; or Bilinda Butcher's sultry coos on &quot;Nothing Ever.&quot; The band also masters the style's unique ability to sound revved-up and calm at the same time on highlights like &quot;Ease Down&quot; and &quot;In Flames.&quot; \n\n  On songs like these, Lights is actually refreshing in how quintessentially shoegaze it is; Fauns don't try too hard to update the style with touches like heavy dance beats, as many bands from the '90s onward have attempted. When they do incorporate electronics, as on the opening track &quot;Point Zero&quot; and &quot;Rise,&quot; it only makes their sound even dreamier and more atmospheric, providing palate cleansers between the album's sugary moments. Fauns find more interesting ways to personalize and modernize shoegaze throughout Lights: The delicately brisk &quot;4 AM&quot; suggests what the xx might sound like if they were more inspired by dream pop than R&amp;B; &quot;Let's Go&quot; playfully adds buzzing engines to the fray; and &quot;With You&quot; tangles lust, yearning, and sadness so strikingly that it suggests the band has much more to offer than dream pop confections. While this is Fauns' second album, their self-titled debut wasn't widely available, so for most listeners Lights will be their introduction to the band, and a fine one at that. Anyone with a soft spot for shoegaze will find a lot to like here.","torrent":{"xt":"urn:btih:baa9050d3d05008a2dccc7bd4473731def21ed5d","amp;dn":"The+Fauns+-+Lights+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"baa9050d3d05008a2dccc7bd4473731def21ed5d","infoHashBuffer":{"type":"Buffer","data":[186,169,5,13,61,5,0,138,45,204,199,189,68,115,115,29,239,33,237,93]},"announce":[],"urlList":[]}}