{"title":"Fonts - Bohemian Coding","uid":9274182,"size":7413922,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:bc969ae957787dcdf3cba95c056e27c8cf8a3664&amp;dn=Fonts+-+Bohemian+Coding&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Tynzo","files":335,"time":1385829484,"description":"Description\nIf you've got more fonts than you dare to admit, how do you find that one font whose name you just can't recall? You know, that one almost but not quite entirely unlike Garamond?\n\nWelcome to Fonts, a new app for previewing and organising your fonts from the people who brought you the award-winning Sketch and Fontcase.\n\nThink Visual:\n\nSearch is hard if you don't know exactly what you're looking for. Your eyes need to do the work here, and Fonts's gorgeous previews make it a breeze to browse a large number of fonts visually. \n\nEven if you're looking for a specific glyph we've got you covered, with a fully featured glyph panel built in.\n\nThink Collections:\n\nFonts's simple workflow helps you perfectly organise and group your fonts. \n\nWe keep our collections in sync with the rest of system so you'll have access to them from any standard Mac app.\n\nThink Different:\n\nIn the old days, Macs struggled if we installed thousands of fonts. \n\nA workaround was to activate just a few at a time, and utilities such as Fontcase evolved to help with this. \n\nNowadays the system can cope, and so in a rather radical move, we got rid of all that stuff, and concentrated on letting you find and group the fonts you want.\n\nWhat's left is cleaner, simpler and more focussed.","torrent":{"xt":"urn:btih:bc969ae957787dcdf3cba95c056e27c8cf8a3664","amp;dn":"Fonts+-+Bohemian+Coding","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc969ae957787dcdf3cba95c056e27c8cf8a3664","infoHashBuffer":{"type":"Buffer","data":[188,150,154,233,87,120,125,205,243,203,169,92,5,110,39,200,207,138,54,100]},"announce":[],"urlList":[]}}