{"title":"The Aisha Prophecy - John R. Maxim.epub","uid":9341110,"size":710623,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bd2bcaaacd9b86032c0986729daf659e50734e29&amp;dn=The+Aisha+Prophecy+-+John+R.+Maxim.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1386934455,"description":"Elizabeth Stride, the notorious Black Angel, had hoped to live quietly at last; no more killing, no more being hunted. She now had a family to think of. She had four young girls whom she'd sworn to protect. Especially Aisha, beautiful Aisha, whom she'd come to think of as a daughter. Add to this a mixed blessing; Martin Kessler was back with her. For two years, he'd allowed her to think he was dead. He had his reasons, but, still, she found it hard to forgive him. She would try very hard not to let herself love him. A good man, true, but almost gleefully reckless and every bit as lethal as she was. All seemed well until the prophecy appeared; it was everywhere; in every language; all over the Internet. It foretold the coming, now, today, of what some called a Muslim Joan of Arc. Aisha, the youngest wife of Mohammed, had been reborn, &quot;to show men how they had fallen into error.&quot; A fiery angel had come with her, to guide and protect her.\n\nAisha and Qaila. Aisha and the Black Angel. She couldn't know that some had already decided that the two might be one and the same. It was heresy, they said. They must be found. They must be killed. All this talk of the prophecy would die with them.\n\n&quot;Maxim, who's been writing top-grade thrillers for more than two decades, continues to be one of the form's best kept secrets.&quot;\n\n-Publishers Weekly","torrent":{"xt":"urn:btih:bd2bcaaacd9b86032c0986729daf659e50734e29","amp;dn":"The+Aisha+Prophecy+-+John+R.+Maxim.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd2bcaaacd9b86032c0986729daf659e50734e29","infoHashBuffer":{"type":"Buffer","data":[189,43,202,170,205,155,134,3,44,9,134,114,157,175,101,158,80,115,78,41]},"announce":[],"urlList":[]}}