{"title":"Robert J. Wicks - Perspective. The Calm Within the Storm [2014][","uid":10252994,"size":3051101,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bd307f9c67e26e498fcf8d1bfec629f8f5db8c75&amp;dn=Robert+J.+Wicks+-+Perspective.+The+Calm+Within+the+Storm+%5B2014%5D%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Anette14","files":-1,"time":1401378040,"description":"Description\nProduct Details\nBook Title: Perspective: The Calm Within the Storm\t\nBook Author: Robert J. Wicks\nHardcover: 280 pages\nPublisher: Oxford University Press; 1 edition (March 3, 2014)\nLanguage: English\nISBN-10: 0199944555\nISBN-13: 978-0199944552\n\n===================================================================================\nBook Description\nPublication Date: March 3, 2014 | ISBN-10: 0199944555 | ISBN-13: 978-0199944552 | Edition: 1\nFor generations, classic wisdom literature has taught that a healthy perspective can replenish our thirst for a meaningful and rewarding life. From its inception clinical psychology has followed suit, revealing that how we see ourselves and the world is more important than what we see or have-in essence, that a healthy perspective is tantamount to possessing the psychological &quot;pearl of great price.&quot;\nRobert J. Wicks, world-renowned psychologist and author of Bounce: Living the Resilient Life, has written a powerful guide for discovering and regaining a balanced and healthy perspective. Combining classic wisdom with cutting-edge research in cognitive behavioral therapy and positive psychology, his new book, Perspective, offers concrete steps for overcoming doubt and resistance to openness, so that beneficial life changes become possible. Drawing on the psychology of mindfulness, gratitude, and happiness, Dr. Wicks also reveals how a healthy perspective makes us more aware of the beneficial things already present in our lives.\nPerspective teaches us to see ourselves more completely and will inspire us to become the calm within the storm, better able to enjoy our experiences, maintain balance in our professional and personal lives, and reach out to others without being pulled down in the process.\n\n===================================================================================\nReviews\n&quot;Wicks's writing comes alive when he focuses on his patients and their experiences, and renders in intimate terms the warmth and faith he expresses towards his readers.&quot; --Publishers Weekly\n\n&quot;This is the kind of book you can't put down because it is so necessary.&quot; --Alexandra Fuller, author of Cocktail Hour Under the Tree of Forgetfulness\n\n&quot;Robert Wicks has written a truly remarkable book for leading a more meaningful, balanced, resilient life.&quot; --Robert Brooks, PhD, Faculty, Harvard Medical School; Co-Author, The Power of Resilience: Achieving Balance, Confidence, and Personal Strength in Your Life\n\n&quot;Dr. Wicks unlocks the secret to achieving the fullest potential in each of us. I wish I had read this book 30 years ago and had assigned it to everyone under my command.&quot; --Mike Gould, Lieutenant General (retired), USAF, Superintendent USAF Academy, June 2009-August 2013\n\n&quot;Robert Wicks leads us on an inward exploration designed to foster our own personal journey toward enlightenment by opening the door to pathways for living and being that have always been there right before our eyes, but perhaps previously not readily accessible to us.&quot; --Jeffrey E. Barnett, PsyD, ABPP, Past President, Division of Psychotherapy, American Psychological Association\n\n&quot;This book is a lovely, clear, and inspiring read. Using personal examples combined with the insights of Eastern spiritual traditions and clinical psychology, the author guides the reader through easy-to-follow steps to develop a healthier perspective on life.&quot; --Kristin Neff, PhD, Author, Self-Compassion; Associate Professor, Human Development and Culture, Educational Psychology Department, University of Texas at Austin\n\n&quot;Dr. Wicks inspires the reader but more importantly challenges you to 'practice' the skills he proposes to achieve greater self-awareness and open-mindedness in managing everyday life.&quot; --M. Tish Knobf, PhD, FAAN, Professor, Yale School of Nursing\n\n&quot;Perspective: The Calm within the Storm is the type of gift that keeps giving. Wherever you are on your journey, this book is your perfect companion. I feel wiser and richer because of it.&quot; --Francoise Adan, MD, Medical Director, Connor Integrative Medicine Network, University Hospitals; Assistant Professor, Case Western Medical School\n\n&quot;An immensely helpful book bound to help people in need of healing--that is, all of us.&quot; --James Martin, SJ, Editor-at-Large of America Magazine and author of Jesus: A Pilgrimage.\n\n&quot;Wicks provides his readers with practical advice for regaining balance and a healthy sense of perspective during stressful situations in life. Combining wisdom and experience, Wicks aims to give a greater sense of gratitude for the little things in life.&quot; -US Catholic\n\n===================================================================================\nAbout the Author\nRobert J. Wicks received his doctorate in psychology from Hahnemann Medical College and Hospital and is on the faculty of Loyola University, Maryland. He has published more than 50 books for professionals and the general public, including Bounce: Living the Resilient Life; Riding the Dragon; The Inner Life of the Counselor; and Streams of Contentment. Dr. Wicks has lectured on the importance of resilience and possessing a healthy perspective in Hanoi, Beijing, Budapest, Belfast, and Johannesburg as well as at the Mayo Clinic, Harvard's Children's Hospital and Harvard Divinity School, Johns Hopkins School of Medicine, the U.S. Air Force Academy, and on Capitol Hill to members of Congress and their chiefs of staff. He has received the Humanitarian of the Year Award from the American Counseling Association's Division on Spirituality, Ethics, and Values and in 2006 was recipient of the first annual Alumni Award for Excellence in Professional Psychology from Widener University.\n===================================================================================","torrent":{"xt":"urn:btih:bd307f9c67e26e498fcf8d1bfec629f8f5db8c75","amp;dn":"Robert+J.+Wicks+-+Perspective.+The+Calm+Within+the+Storm+%5B2014%5D%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd307f9c67e26e498fcf8d1bfec629f8f5db8c75","infoHashBuffer":{"type":"Buffer","data":[189,48,127,156,103,226,110,73,143,207,141,27,254,198,41,248,245,219,140,117]},"announce":[],"urlList":[]}}