{"title":"Riding Partner by Mary Winter","uid":9368023,"size":145323,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:be12fe7b79769531eb40f15b5127b461cdb8682a&amp;dn=Riding+Partner+by+Mary+Winter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"420weedman","files":4,"time":1387468054,"description":"Overview: Equestrian Derek Whitten watched his dreams fall with the last jump at the Athens Olympics, losing both the gold medal and his lover in one fateful day. Now, two years later, financial troubles have forced him to consider selling his prize horse, and Derek turns to the one man he trusts. A simple business transaction, that's all, no matter how much he wants it to be more. It was Charles DeMorinson's mare that Derek rode in the Olympics, and though Charles never blamed Derek for his horse's performance, both his dream and his lover slipped through his grasp. He's spent the years since regretting not fighting harder for their relationship. Now Derek's back on his doorstep, in need of his help. Time and distance did little to cool their attraction to each other. And when Derek returns, Charles is ready to stake the claim he should have made in Athens. If he holds on too tightly he'll earn nothing but resentment, but Charles let Derek go once, and he won't make the same mistake again. He just has to convince him that they both need one thing-each other.\n","torrent":{"xt":"urn:btih:be12fe7b79769531eb40f15b5127b461cdb8682a","amp;dn":"Riding+Partner+by+Mary+Winter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be12fe7b79769531eb40f15b5127b461cdb8682a","infoHashBuffer":{"type":"Buffer","data":[190,18,254,123,121,118,149,49,235,64,241,91,81,39,180,97,205,184,104,42]},"announce":[],"urlList":[]}}