{"title":"Mazzy Star - So Tonight That I Might See [24 bit FLAC] vinyl","uid":9336972,"size":1031163914,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c0a852bfd9d70de88ae884c88428118aee9937bb&amp;dn=Mazzy+Star+-+So+Tonight+That+I+Might+See+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"politux","files":-1,"time":1386869576,"description":"\n  Mazzy Star - So Tonight That I Might See [24 bit FLAC] vinyl\n\n  Genre: Pop/Rock\n  Styles: Shoegaze, Dream Pop, Alternative\n  Source: Original Release Capitol vinyl\n  Codec: FLAC\n  Bit Rate: ~ 2,900 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  01 Fade into You\n  02 Bells Ring\n  03 Mary of Silence \n  04 Five String Serenade\n  05 Blue Light \n  06 She's My Baby \n  07 Unreflected \n  08 Wasted \n  09 Into Dust\n  10 So Tonight That I Might See\n\n  Thanks to the fluke hit &quot;Fade Into You&quot; -- one of the better beneficiaries of alt-rock's radio prominence in the early '90s, a gentle descent of a lead melody accompanied by piano, a steady beat, and above all else, Hope Sandoval's lovely lead vocal -- Mazzy Star's second album became something of a commercial success. All without changing much at all from where the band was before -- David Roback oversaw all the production, the core emphasis remained a nexus point between country, folk, psych, and classic rock all shrouded in mystery, and Sandoval's trademark drowsy drawl remained swathed in echo. But grand as She Hangs Brightly was, So Tonight That I Might See remains the group's undisputed high point, mixing in plenty of variety among its tracks without losing sight of what made the group so special to begin with. \n\n  Though many songs work with full arrangements like &quot;Fade Into You,&quot; a thick but never once overpowering combination, two heavily stripped-down songs demonstrate in different ways how Mazzy Star makes a virtue out of simplicity. &quot;Mary of Silence&quot; is an organ-led slow shuffle that easily ranks with the best of the Doors, strung-out and captivating all at once, Sandoval's singing and Roback's careful acid soloing perfect foils. &quot;Wasted,&quot; meanwhile, revisits a classic blues riff slowed down to near-soporific levels, but the snarling crunch of Roback's guitar works wonders against Sandoval's vocals, a careful balance that holds. If there's a left-field standout, then unquestionably it's &quot;Five String Serenade.&quot; A cover of an Arthur Lee song -- for once not a Love-era number, but a then-recent effort -- Roback's delicate acoustic guitar effortlessly brings out its simple beauty. Tambourine and violin add just enough to the arrangement here and there, and Sandoval's calm singing makes for the icing on the cake.\n","torrent":{"xt":"urn:btih:c0a852bfd9d70de88ae884c88428118aee9937bb","amp;dn":"Mazzy+Star+-+So+Tonight+That+I+Might+See+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0a852bfd9d70de88ae884c88428118aee9937bb","infoHashBuffer":{"type":"Buffer","data":[192,168,82,191,217,215,13,232,138,232,132,200,132,40,17,138,238,153,55,187]},"announce":[],"urlList":[]}}