{"title":"Ben Weaver - Mirepoix and Smoke [2010][EAC.Log,Cue.FLAC]","uid":9332078,"size":146590103,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c1bee838c510a826dc10bd1ea7708b7f4e153fa9&amp;dn=Ben+Weaver+-+Mirepoix+and+Smoke+%5B2010%5D%5BEAC.Log%2CCue.FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dickspic","files":12,"time":1386786506,"description":"Artist: Ben Weaver\nRelease: Mirepoix and Smoke\nReleased: 2010\nLabel: Bloodshot Records\nCatalog#: BS 173\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: folk,pop\n\nimage\n\n\n1. Grass Doe\n2. City Girl\n3. Drag the Hills\n4. East Jefferson\n5. While I'm Gone\n6. Maiden Cliff\n7. Split Ends\n8. 22 Shells\n9. Rooster's Wife\n\n\n\n\nAfter 2008's release of the electronically-enhanced acoustic sounds on Ax in the Oak, singer/songwriter Ben Weaver has gone back to his acoustic origins on Mirepoix and Smoke, his second offering for Chicago's Bloodshot imprint and seventh overall. This is no mere retreat, however. While Weaver's early albums were gritty, wily, and sometimes stomping blues and folk offerings where his voice owed much of its delivery to a younger Tom Waits, his sound here is an entirely different kind of organic: it's cut to the absolute bone, bleached in sun, and tempered by the wind. Weaver's new songs find him accompanied either by a guitar or a banjo; very occasionally a piano, a bass, or some drums -- also played by him -- are dubbed in. The only other person on the record is Anathallo's Erica Froman adding a plaintive harmony or backing vocal. Clocking in at under 30 minutes, the nine songs on Mirepoix and Smoke showcase another quality in Weaver's voice as well. While his low-register baritone is still there, it's been tempered by a lilting middle register and even a falsetto. Recorded in three days, Weaver's songs here are his most intimate; they're often pastoral and capture essences gently, yet indelibly and poignantly. Album-opener &quot;Grass Doe,&quot; played on a fingerpicked acoustic guitar, is more than likely a retelling of his marriage and divorce with reflections on the natural world (which end up in virtually every cut) added metaphorical weigh, with Froman's backing vocal adding a near counterpoint of view to the narrative. &quot;City Girl&quot; is a taut, poetic character study; despite the obvious admiration of his protagonist, this is no mere romantic tale. With bass, banjo, and a harmony vocal, Weaver creates a speaking subject from the observed object. &quot;Maiden Cliff&quot; is dark-hued, banjo-painted meditation on nature that borrows part of its melody from the spiritual, &quot;Oh Sinner Man.&quot; &quot;Split Ends&quot; is a sung poem about the loss of childhood innocence and its illusory ideals, and the onset of adult-sized responsibilities and their resulting disappointments. These difficult moments on the set are tempered by nearly profound observations of the perfect earth and atmosphere, tarnished only by humans and their dramas: &quot;While the tree grows around our names in the bark/the last of our tracks fill with snow.&quot; Mirepoix and Smoke is Weaver at his most focused, inspired, and connected to that which is larger than himself....\n","torrent":{"xt":"urn:btih:c1bee838c510a826dc10bd1ea7708b7f4e153fa9","amp;dn":"Ben+Weaver+-+Mirepoix+and+Smoke+%5B2010%5D%5BEAC.Log%2CCue.FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1bee838c510a826dc10bd1ea7708b7f4e153fa9","infoHashBuffer":{"type":"Buffer","data":[193,190,232,56,197,16,168,38,220,16,189,30,167,112,139,127,78,21,63,169]},"announce":[],"urlList":[]}}