{"title":"Forbidden Holywood Collection Vol. 1 - Disk 1 - DVD9- Waterloo B","uid":9254208,"size":7183017984,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c3170310666003950ac91c9df743a022985becee&amp;dn=Forbidden+Holywood+Collection+Vol.+1+-+Disk+1+-+DVD9-+Waterloo+B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"SaM","files":-1,"time":1385523780,"description":"Forbidden Holywood Collection Vol. 1 - Disk 1 - DVD9- Waterloo Bridge (1931) - Red Headed Woman (1932) [DDR]\n\nWaterloo Bridge (1931)\nWaterloo Bridge is a 1931 American drama film directed by James Whale. The screenplay by Benn Levy and Tom Reed is based on the 1930 play of the same title by Robert E. Sherwood.\n\nThe film was remade twice, under its original title in 1940 and as Gaby in 1956. Both remakes were made by Metro-Goldwyn-Mayer, which bought the 1931 version from Universal. \n\nToday, the rights to all three films are held by Warner Bros. and their subsidiary Turner Entertainment.\n\nBecause of its controversial material, censor boards in Chicago, New York City, and Pennsylvania insisted extensive cuts be made to the film. When the Production Code was enforced in July 1934, it became impossible to re-release the original version of Waterloo Bridge.\n\nIn 1939, MGM bought the rights to the property, and the following year released an adaptation starring Vivien Leigh and Robert Taylor and directed by Mervyn LeRoy. The 1956 film Gaby, directed by Curtis Bernhardt and starring Leslie Caron and John Kerr, advanced the story's timeline to World War II.\n\nAfter being stored in the studio vaults for thirty-five years, Waterloo Bridge was re-discovered in 1975, but a joint ownership agreement between MGM and Universal prevented it from being seen for another two decades.\n\n\n    CAST:-\n    Mae Clarke as Myra Deauville\n    Douglass Montgomery as Roy Cronin\n    Doris Lloyd as Kitty\n    Frederick Kerr as Major Fred Wetherby\n    Enid Bennett as Mrs Mary Cronin Wetherby\n    Bette Davis as Janet Cronin\n    Ethel Griffies as Mrs Hobley, Landlady\n\n    Directed by James Whale\n    Produced by Carl Laemmle, Jr.\n    Written by Benn Levy, Tom Reed\n    Based on the play by Robert E. Sherwood\n\nSYNOPSIS- Waterloo Bridge (1931)\nUnable to find work in London at the height of World War I, American chorus girl Myra Deauville resorts to prostitution to support herself. She meets her clients on Waterloo Bridge, the primary entry point into the city for soldiers on leave. During an air raid, she meets fellow American Roy Cronin, a member of the Canadian Army, and he joins Myra in her apartment.\n\nDescribing herself simply as an unemployed chorus girl, Myra gains Roy's sympathy, and he offers to pay her overdue rent. After she rejects his offer and he departs, Myra returns to the streets. The following morning, Roy returns to visit her, and landlady Mrs. Hobley lets him into her apartment. There he meets Myra's friend and neighbor Kitty, who tells him Myra needs someone to love and protect her. Myra later berates Kitty for interfering and rejects her advice to marry Roy to ensure a better future for herself.\n\nRoy brings Myra to visit his mother Mary and sister Janet at their country estate, where he proposes to Myra, who later that night tells Mary the truth about herself. Mary is sympathetic but implores Myra not to marry Roy. The following morning, Myra slips away and returns to London by train. Eventually Roy visits her and asks her to explain her abrupt departure. \n\nBecause he is on the verge of returning to the battlefields in France, he begs Myra to marry him immediately. She agrees, but escapes from her apartment through a window while he waits for her in the hallway. Seeking the rent, Mrs. Hobley enters and, believing Myra has run off to avoid her financial obligation, reveals her true profession to Roy.\n\nAlthough shocked, Roy searches for Myra and eventually finds her on Waterloo Bridge, where he tells her he still loves and wants to marry her. The military police insist Roy join a truck of departing soldiers or be considered a deserter, and once he secures Myra's promises to marry him upon his return, he departs. The air raid sirens sound, and as Myra seeks shelter, she is killed by a bomb.\n\n---------------------------------------------------------------------------------\n\nRed Headed Woman (1932)\nRed-Headed Woman is a 1932 American romantic comedy film, produced by Metro-Goldwyn-Mayer, based on a novel of the same name by Katherine Brush, and with a screenplay by Anita Loos. It was directed by Jack Conway, and stars Jean Harlow as a woman who uses sex to advance her social position. During the course of the film, Harlow breaks up a marriage, has multiple affairs and pre-marital sex, and attempts to kill a man.\n\nThe film proved difficult from its inception. Producer Irving Thalberg was concerned that the original story and the first draft of a script by F. Scott Fitzgerald were too serious, and offered the job of rewriting it to Anita Loos, instructing her to provide something that was more fun and playful and with a greater emphasis on comedy.\n\nBefore Harlow, MGM wanted Clara Bow, who agreed to do the part, but objected to the &quot;future services&quot; option the studio felt needed.\n\nPrior to its release he worked with the Will Hays Office to ensure it would receive approval for general release. Under the Production Code, a criminal could not be seen to profit from the crime, or to go unpunished, and sin must be punished. Adding further to the problem was Harlow's overtly sexual portrayal, with several scenes in which she was partially undressed, or making obvious sexual advances.\n\nAlthough the Hays Office could not ban a film as such, a refusal to issue approval for a particular film could lead exhibitors to refuse to screen it. Thalberg agreed to seventeen cuts to enable it to screen in the United States;[citation needed] however upon release, it still received a large number of complaints from affronted cinema patrons.[citation needed] The original theatrical release was banned in the United Kingdom, it was never resubmitted until 1965. The furor surrounding its release generated considerable publicity, and the film was a box-office success.\n\n    CAST:-\n    Jean Harlow as Lillian 'Lil' / 'Red' Andrews Legendre\n    Chester Morris as William 'Bill' / 'Willie' Legendre Jr.\n    Lewis Stone as William 'Will' Legendre Sr.\n    Leila Hyams as Irene 'Rene' Legendre\n    Una Merkel as Sally\n    Henry Stephenson as Charles B. 'Charlie' / 'C.B.' Gaerste\n    Charles Boyer as Albert\n    May Robson as Aunt Jane\n    Harvey Clark as Uncle Fred\n\n    Directed by Jack Conway\n    Produced by Paul Bern\n    Written by F. Scott Fitzgerald (uncredited)\n    Screenplay by Anita Loos\n    Based on Red-Headed Woman by Katherine Brush\n\nSYNOPSIS:- Red Headed Woman (1932)\nLilian 'Lil' Andrews (Harlow wearing a red wig) is a young woman who will do anything to improve herself. She seduces her wealthy boss William 'Bill' Legendre Jr. (Chester Morris) and cleverly breaks up his marriage with his loving wife Irene (Leila Hyams). Irene reconsiders and tries to reconcile with Bill, only to find he has married Lil that day.\n\nHowever, Lil finds herself shunned by high society, including Bill's father, Will Legendre Sr. (Lewis Stone), because of her lower class origins and homewrecking. When Charles B. Gaerste (Henry Stephenson), a nationally known coal tycoon and the main customer of the Legendres' company, visits the city, Lil thinks she has found a way to force her way into the highest social circles. She seduces him, then blackmails him into throwing a party at her mansion, knowing that no one would dare offend him by not showing up. It seems like a social coup for Lil, until her hairdresser friend and confidante Sally (Una Merkel) points out that all the guests have left early to attend a surprise party for Irene (who lives across the street).\n\nHumiliated, she decides to move to New York City, even if it means a temporary separation from her husband. Will finds Lil's handkerchief at Gaerste's place and correctly guesses what Lil has done. He shows his evidence to his son, who hires detectives to watch Lil. They find that she is conducting not one, but two affairs, with Charles and his handsome French chauffeur Albert (Charles Boyer). Bill shows Charles damning photographs.\n\nWhen Lil learns that Charles has found out about her, she returns to Bill, only to find him with Irene. Furious, she shoots him, but he survives and refuses to have her charged with attempted murder. However, he does divorce her and remarry Irene. Two years later, he sees her again, at a racetrack in Paris, in the company of an aged Frenchman. He discreetly hides Irene's binoculars. In the final scene, Lil and her elderly companion get into a limousine ... driven by Albert.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4999 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime 160 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 160 mins","torrent":{"xt":"urn:btih:c3170310666003950ac91c9df743a022985becee","amp;dn":"Forbidden+Holywood+Collection+Vol.+1+-+Disk+1+-+DVD9-+Waterloo+B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3170310666003950ac91c9df743a022985becee","infoHashBuffer":{"type":"Buffer","data":[195,23,3,16,102,96,3,149,10,201,28,157,247,67,160,34,152,91,236,238]},"announce":[],"urlList":[]}}