{"title":"Jim Henson's Muppets Mr. Willowby's Christmas Tree","uid":9348968,"size":4401177929,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c34209a90b3a886ae4323065489373fbaf4224d5&amp;dn=Jim+Henson%27s+Muppets+Mr.+Willowby%27s+Christmas+Tree&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tygerbug","files":82,"time":1387087531,"description":"Mr. Willowby's Christmas Tree\n\n[Also available: The Great Santa Claus Switch]\n\nJoin Robert Downey Jr., Kermit the Frog, Leslie Nielsen, Stockard Channing and a family of Muppet mice for this 1995 Christmas special.\n\nBased on Robert Barry's 1963 book, our story follows a family of mice living in the wealthy and eccentric Mr. Willowby's house. They decide to start the hunt for the perfect Christmas tree (namely, chopping off the top of the perfect tree Mr. Willowby has brought home). However, while they continually attempt to take their piece of tree, the top of the tree is passed around from humans to animals, each one taking just enought of the tree to make it the perfect size for them. Through this adventure, the mice see how others celebrate Christmas, and Mr. Willowby's friends and employees learn a little about Christmas magic too.\n\nDirected by longtime Sesame Street creative director Jon Stone, this otherwise-unavailable special is featured here in full DVD quality for the first time in English.\n\nAnd while it's not the most popular of Muppet holiday specials, there's plenty more here on the DVD to make your holidays warmer and brighter.\n\nSpecial Features:\n\n- Portuguese dubbed version\n\n- Entertainment Tonight 1987 - Interview with Kermit the Frog and Jim Henson about A Muppet Family Christmas.\n\n- Perry Como's Kraft Music Hall, December 20, 1965 - A sketch starring Muppet reindeer, including a funny cameo by Jim Henson.\n\n- The Ed Sullivan Show, December 24, 1967 - Arthur Godfrey plays Santa Claus to a gaggle of Muppet monsters.\n\n- The Ed Sullivan Show, December 14, 1969 - Big Bird, played here by Daniel Seagren (instead of Caroll Spinney), dances to &quot;Minuet of the Robots&quot; by Jean-Jacques Perrey, accompanied by dancing &quot;birdwatchers.&quot; Choreographed by Peter Generro.\n\n- The Ed Sullivan Show, Christmas 1992 - Bob Newhart hosted a retrospective of holiday magic from The Ed Sullivan Show, and Kermit the Frog, Miss Piggy, Gonzo, Rizzo and others from The Muppet Christmas Carol appeared to sing &quot;It Feels Like Christmas.&quot;\n\n- A Muppets Christmas: Letters to Santa Clips - Songs by Paul Williams from this 2008 special. &quot;Delivering Christmas,&quot; &quot;It's All About Heart,&quot; &quot;I Wish I Could Be Santa Claus,&quot; and &quot;My Best Christmas Yet.&quot;\n\n- Emmett Otter's Jug-Band Christmas Clips - Songs by Paul Williams from this 1977 special, which is possibly the most beloved Muppet Christmas production. &quot;Barbecue,&quot; &quot;When the River Meets the Sea,&quot; and &quot;Brothers in Our World.&quot;\n\n- The Jimmy Dean Show, December 24, 1964 - Jimmy Dean and Rowlf the Dog share a heartfelt moment and sing &quot;Have Yourself a Merry Little Christmas.&quot; The audio is not high quality, but is presented here in two different mixes.\n\n- A Muppet Family Christmas Clips - When issued on DVD in the U.S., nearly ten minutes is cut from this fan-favorite 1987 special due to music rights issues. Here are most of the &quot;deleted&quot; scenes, sourced from the UK release, along with clips that are shortened from the rare, slightly-longer original airing of the special.\n\n- Saturday Night Live, December 20, 1975 - &quot;Good King Ploobislaus,&quot; a &quot;Land of Gorch&quot; Muppet sketch featuring Candice Bergen.\n\n\n\nRobert Downey, Jr. as Mr. Willowby\nLeslie Nielsen as Baxter\nStockard Channing as Miss Adelaide\nBill Barretta\nJulianne Buescher as Beverly Mouse\nKevin Clash as Father Mouse\nBruce Lanoil\nDavid Rudman as Ned Mouse\nSteve Whitmire as Kermit the Frog\n\nDirector: Jon Stone\nAuthor, book: Robert Barry\nWriter, teleplay: Mitchell Kriegman\nProducer: Ritamarie Peruggi\nExecutive Producer: Michael K. Frith\nOriginal Music: Michael and Patricia Silversher\nCinematographer: Tony Cutrono\nFilm Editor: David Gumpel\nProduction Designer: Val Strazovec\n","torrent":{"xt":"urn:btih:c34209a90b3a886ae4323065489373fbaf4224d5","amp;dn":"Jim+Henson%27s+Muppets+Mr.+Willowby%27s+Christmas+Tree","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c34209a90b3a886ae4323065489373fbaf4224d5","infoHashBuffer":{"type":"Buffer","data":[195,66,9,169,11,58,136,106,228,50,48,101,72,147,115,251,175,66,36,213]},"announce":[],"urlList":[]}}