{"title":"The Recipe Girl Cookbook by Lori Lange","uid":9313478,"size":16592310,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c4565f3fc6cb7dbdf31d6cf679859c92e3653bbb&amp;dn=The+Recipe+Girl+Cookbook+by+Lori+Lange&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"420weedman","files":4,"time":1386437345,"description":"Delicious, family-friendly recipes from popular blogger Recipe Girl\n\nOne of the world's most popular food blogs, RecipeGirl.com is the place to go for easy, family-friendly recipes. With hungry mouths to feed and little time to waste, busy moms and dads need simple options that don't involve a drive-thru, hard-to-find ingredients, or hours spent in the kitchen. The Recipe Girl Cookbook offers all that and more with recipes that use real and fresh ingredients. As a mom herself, author Lori Lange knows how valuable your time is. But she also knows that you won't sacrifice quality for quickness. With 195 simple and simply delicious recipes for everything from breakfast to happy hour to dinner and dessert, plenty of variations and substitutions, and handy icons to call out vegetarian, gluten-free, and dairy-free recipes, family meals will never be the same again.\n- 195 recipes and variations offer plenty of options for busy home cooks\n- Includes vegetarian, gluten-free, and dairy-free recipes, as well as handy tips and substitution ideas for making recipes safe for special diets\n- Includes a bonus chapter on entertaining, sharing 20 themed party menus and tips for easy, successful entertaining\n- Features beautiful full-color photography from acclaimed food photographer Matt Armendariz\n- Author Lori Lange blogs at the hugely popular RecipeGirl.com and develops recipes for several well-known brands","torrent":{"xt":"urn:btih:c4565f3fc6cb7dbdf31d6cf679859c92e3653bbb","amp;dn":"The+Recipe+Girl+Cookbook+by+Lori+Lange","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4565f3fc6cb7dbdf31d6cf679859c92e3653bbb","infoHashBuffer":{"type":"Buffer","data":[196,86,95,63,198,203,125,189,243,29,108,246,121,133,156,146,227,101,59,187]},"announce":[],"urlList":[]}}