{"title":"How Soon is Now The Madmen and Mavericks who made Independent Mu","uid":9364940,"size":1482486,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c4cc267528fe9be89ed6732c04d8290be40949f6&amp;dn=How+Soon+is+Now+The+Madmen+and+Mavericks+who+made+Independent+Mu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"420weedman","files":5,"time":1387394446,"description":"Overview: One of the most tangible aftershocks of Punk was its urgency to prompt individuals into action. Document your reality: do it yourself. From this, a generation of young men were inspired and, with often zero financial planning or business sense, in a bedroom, garage or shed, labels such as Factory, Rough Trade, Mute, 4AD, Beggars Banquet, Warp, Domino and Creation began, shifting the musical landscape and trading on an ethos and identity no brand consultant would now dare dream of. Musicians were encouraged to do whatever the hell they wanted and damn the consequences. From humble beginnings, some of our most influential artists were allowed to thrive: New Order, The Smiths, Depeche Mode, Orange Juice, Cocteau Twins, Sonic Youth, Happy Mondays, Primal Scream, Aphex Twin, Teenage Fanclub, My Bloody Valentine, Autechre, Broadcast, Vampire Weekend, The White Stripes and Artic Monkeys to name but a handful. This is the story, set to an incredible soundtrack, of the enormous scale of the passions, the size of the egos, and the true extent of the madness of the mavericks who had the vision and bloody-mindedness to make the musical landscape exciting again\n","torrent":{"xt":"urn:btih:c4cc267528fe9be89ed6732c04d8290be40949f6","amp;dn":"How+Soon+is+Now+The+Madmen+and+Mavericks+who+made+Independent+Mu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4cc267528fe9be89ed6732c04d8290be40949f6","infoHashBuffer":{"type":"Buffer","data":[196,204,38,117,40,254,155,232,158,214,115,44,4,216,41,11,228,9,73,246]},"announce":[],"urlList":[]}}