{"title":"Sexually Broken--Beretta James conquered by cock!","uid":9374076,"size":1000778515,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:c50a5b5bc878617bdd76d4b5d8f3ea9ee74f8160&amp;dn=Sexually+Broken--Beretta+James+conquered+by+cock%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1387587134,"description":"Beretta James conquered by cock! Takes 10 inches of BBC, strict bondage and brutal deep throating! | Beretta James | Matt Williams\n\nDecember 20, 2013\n\n\nMP4 only.\n\n\nBeretta James is a lush MILFtastic hottie with a perfect ass. Today we are going to bend that perfect ass over a wooden bondage pillar while she is lashed down and stuff her full of dick from both ends, Sexuallybroken style. Bound face down and ass up with a spreader bar keeping her legs spread apart, a thick leather strap cinching her tiny waist down to the post and a vibrator bolted in place, Beretta is about to become completely destroyed by dick.\n\nWe start off inspecting that flawless ass, spreading the cheeks apart to see what we have to work with. We strip off her black high heels and then lay into that ass with our flogger, warming it up to a red rosy glow. A leather blindfold cuts off her vision, reinforcing her helplessness. While she is blindfolded and bound, we simply walk right up and make proper use of her facepussy. Beretta deep throats down the dick until her nose is resting on the belly. Credit where credit is due, this cougar certainly knows how to handle the cock. \n\nWhile her face hole is full, we walk up and take the other side. She moans and cums helplessly, as waves of pleasure rips through her bound body. Beretta is stuffed full from both ends, completely conquered by the cock. The bolted on vibrator whirrs relentlessly away, ripping out orgasm after orgasm from her sensitive pussy. We pound away without mercy, using her like a humping post. Beretta is just a bag of holes for our pleasure.\n\nHer face is slack and clouded, her mouth hole open and leaking, her body totally helpless to whatever we feel like dishing out. We use her until we are bored, and then walk away, leaving the vibrator to continue to pull yet more orgasms out of her tired hole. Beretta is broken down in her bondage, completely gone. It is a good look on her. \n \nScreens  &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2013/12_20bjames7/SexuallyBroken-Beretta-James-Matt-Williams-Beretta-James-conquered-by-cock-Takes-10-inches-of-BBC-strict-bondage-and-brutal-deep-throating.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2013/12_20bjames7/SexuallyBroken-Beretta-James-Matt-Williams-Beretta-James-conquered-by-cock-Takes-10-inches-of-BBC-strict-bondage-and-brutal-deep-throating.php&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:c50a5b5bc878617bdd76d4b5d8f3ea9ee74f8160","amp;dn":"Sexually+Broken--Beretta+James+conquered+by+cock%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c50a5b5bc878617bdd76d4b5d8f3ea9ee74f8160","infoHashBuffer":{"type":"Buffer","data":[197,10,91,91,200,120,97,123,221,118,212,181,216,243,234,158,231,79,129,96]},"announce":[],"urlList":[]}}