{"title":"Revolution.2012.S02E06.avi","uid":9359090,"size":356104042,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c522f601291fa4e3ba19ae904696b30e0978f1ed&amp;dn=Revolution.2012.S02E06.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ziggi1000","files":1,"time":1387271574,"description":"&quot;Dead Man Walking&quot;  October 30, 2013\n \nMiles and Monroe set about making the ranger look like he was killed by the Patriots. They sink his body in the river. The Texas Rangers follow Fry's tracks to the old warehouse and find a gun casing from a Patriot gun. Miles catches Monroe with a Patriot body and Monroe gives him information that the Patriot said before Monroe killed him. Monroe is sitting in a building when someone throws in a stun grenade. He leaves the building to find a number of Patriots outside, all with their guns pointed at him, and he is taken into custody. Instead of the intended war, the Texas Rangers and the Patriots are working together. They present Monroe to the public and say he will not live to see another sunrise if he is found guilty of his crimes by immediate trial. Reporters and old flash cameras are there to capture the moment. Aaron meets Bonnie Webster (Alanna Ubach), who has entered the town with the Texas Rangers. Miles tells Charlie they have to get Monroe out. At night, Miles and Charlie sneak along the top of a building. They see Monroe being moved to a vault in the bank and Miles confronts Rachel about tipping off the Rangers and Patriots that there was going to be a jailbreak. Rachel confesses to telling them. Charlie and Rachel have a confrontation, and Rachel tells her she cannot bear to lose another child, but Charlie says Monroe saved her life. In the courtroom, Monroe is sentenced to death. Monroe's last request is to see Miles. Monroe asks Miles to shake his hand and say goodbye and to find his son by Emma. Miles knows exactly where Monroe's son is. At midnight, Monroe is given the injection by Gene Porter and dies. Miles is broken by the loss of Monroe and is trying to drink his pains away. It is revealed that Gene is working with the Patriots. Allenford tells Neville the direction of the camp his son is being held in, and then refuses to go any farther. Neville tells her he is not letting her go until he lays eyes on his son. They find dead bodies ripped apart, and Allenford reveals it was the work of the Patriot's boot camp. Soldiers fire on them and they run. The main attacker turns out to be Jason, who does not hesitate as he attempts to kill his father. Jason and his group storm through hallways of the warehouse and Jason's vision is blurry. Allenford says that Neville's son is no longer his son and she knows this because her own son has been put through this program in Cuba, and that her husband is a high ranking Patriot that puts country before family. Neville kills the other two who are with Jason, and Neville holds Jason at gunpoint. Jason beats up Neville and is in the process of killing him when Allenford hits him over the head, knocking him unconscious. Rachel stands over Monroe's grave and begins digging.\n \n","torrent":{"xt":"urn:btih:c522f601291fa4e3ba19ae904696b30e0978f1ed","amp;dn":"Revolution.2012.S02E06.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c522f601291fa4e3ba19ae904696b30e0978f1ed","infoHashBuffer":{"type":"Buffer","data":[197,34,246,1,41,31,164,227,186,25,174,144,70,150,179,14,9,120,241,237]},"announce":[],"urlList":[]}}