{"title":"Savage Garden - Savage Garden 320cbr (Big Papi) 1997 Dance Pop","uid":9371546,"size":107594159,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c57a4776fb018c78465ccedbb56af36369ce731b&amp;dn=Savage+Garden+-+Savage+Garden+320cbr+%28Big+Papi%29+1997+Dance+Pop&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1387536990,"description":"Source: 1997 CD\n\n\n\nBy C. Wroble\nIn 1984, the UK pop group Wham! featured its two well-kempt members on the cover of &quot;Make it Big,&quot; the album that spawned &quot;Wake Me Up Before You Go-Go&quot; and a slew of other hits to guarantee interest in the duo's continuances for years to come. George Michael, unarguably more popular, stared away from the camera, while partner in suave Andrew Ridgeley looked straight at it. Just 13 years later, Savage Garden put out its eponymous debut disc, and nearly the same pose was postured by Australians Daniel Johns and Darren Hayes, the latter eyeing the universe while the former eyed any eye to grace the black and white cover. Hayes, of course, was Savage Garden's George Michael; he was the accented lead vocalist to be remembered by face and voice as the band's heartthrob even after its demise. Johns, on the other hand, was less memorable; he and Ridgeley seemed to be mere specialists along for the ride, writing flashy hooks and danceable beats as a fallback if their partners were to lose credibility. Credibility proved not an issue for Savage Garden, as their debut sold 11 million copies (trumping the 7 million of Wham!) and yielded 3 huge hits, the prominent one being &quot;Truly Madly Deeply,&quot; which landed the ever-impossible #1 spot on the Billboard Hot 100. But beyond hogging bureau space in millions of teenage rooms and dropping filler material for thousands of radio stations, &quot;Savage Garden&quot; is easily the best pop album of the 1990s, perfectly mixing harmony, instrumentation, percussion, sensuality, and a surprisingly effortless sense of artiness.\n\nThat artiness, perhaps the make-it-or-break-it feature absent from teen diva albums and boy band albums alike, goes far beyond the retro-cool collage work done for the CD fold-out.\n\nSetting pop standards, like that precursor to Spears, is what much of this album becomes, as is the case with the lead single, &quot;I Want You.&quot; Thank Hayes' nonsensical motor-rap (highlight: &quot;Sweet like a chic a cherry cola&quot;) for the pop-group members strictly used for raps, like Richard &quot;Abs&quot; Breen of 5ive or, most recently, Lil' Kim in the remake collaboration of &quot;Lady Marmalade.&quot; Aside from the rapping, Johns' deranged percussion is the track's centerpiece, sounding somewhat like Radiohead's &quot;Idioteque&quot; when at its most creative. Meanwhile, &quot;Break Me Shake Me&quot; actually teaches how to involve frustration in a dance piece. Taking a drama-club confessional approach to the typical hard-edged pop song, Hayes does little more than whisper over foreshadowing tambourine shakes to mount an approach to his thrash choruses, which seem to gain fury with each installment. That pure emotion, revealed in Hayes' lyrics (&quot;You abused me in a way I've never known&quot;) and garnished by Johns' brilliant multi-instrumentalism, dictates the album, providing it with a collective focal point as to never allow the listener to lose interest.\n\nThe first half of the album is the most important emotion, that of love, most excellently examined in &quot;Universe,&quot; which not only features soft rock keyboards but also some surprisingly witty lyrics, shown when Hayes describes his physical and mental relationship as consisting of &quot;two minds, consensual.&quot; After that section, book-ended by &quot;To the Moon &amp; Back&quot; and the aforementioned &quot;Universe,&quot; Savage Garden becomes energetically sexual with &quot;Carry on Dancing&quot; and &quot;Violet,&quot; the former allowing Hayes to equate &quot;dancing&quot; and &quot;romancing&quot; over a warped piano trance that finds the ability mesmerize in its striking percussion. &quot;Break Me Shake Me&quot; and &quot;A Thousand Words&quot; are bitingly vengeful, an emotional segment that ends in Hayes threatening to spit out a horde of deceptive words, the most powerful being &quot;damnation.&quot; Finally, with &quot;Promises&quot; and &quot;Santa Monica,&quot; Hayes and Johns recover from spite with wisdom, playing the role of the owl, the much-illustrated character throughout their in-case spread. &quot;Promises&quot; is the album's quiet standout, as string and bell accompaniment flutters around flutes and synth effects beneath Hayes' contemplative vocals. In retrospect, after a complete listen, Hayes and Johns seem to have perfected a full transition, which with staying power is able to etch itself into the pop listener's ears, heart, and mind. This album-long transition from love to sex to anger to wisdom seems the blueprint for human life, which makes &quot;Savage Garden&quot; life's inescapable soundtrack.","torrent":{"xt":"urn:btih:c57a4776fb018c78465ccedbb56af36369ce731b","amp;dn":"Savage+Garden+-+Savage+Garden+320cbr+%28Big+Papi%29+1997+Dance+Pop","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c57a4776fb018c78465ccedbb56af36369ce731b","infoHashBuffer":{"type":"Buffer","data":[197,122,71,118,251,1,140,120,70,92,206,219,181,106,243,99,105,206,115,27]},"announce":[],"urlList":[]}}