{"title":"Colombian Teens vol. 3 [DvdRip].avi","uid":9263664,"size":1467918336,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:c5d548165d706f5fbb5e341cc63c48761e748ec9&amp;dn=Colombian+Teens+vol.+3+%5BDvdRip%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FluxXxu","files":-1,"time":1385664628,"description":"\nColombian Teens vol. 3 [DvdRip].avi\n\n\nPosters and Screenshots\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=27712756438648033964.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=27712756438648033964.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=15127306776960396157.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=15127306776960396157.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=62253717288087503512.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=62253717288087503512.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=88845035283037538349.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=88845035283037538349.jpg&lt;/a&gt;\n\n\nCast\n\nJuly, Lina C, Nacho Vidal, Sweet Sugar, Yessica Gold, Yuly\n\n\nDescription\n\n&quot;Spanish stud and XXX director Nacho Vidal is known for his huge, prodigiously hard penis and for the powerful, intense fuck scenes his cock and camera create. He loves putting fresh, unknown girls from exotic corners of the world into his movies, and then putting that meat into the girls. For Colombian Teens 3 Nacho cruises city streets not in search of cocaine or coffee, but the South American country's most precious resource: sexy Latina teens as yet unspoiled by the world of commercial porn. When Nacho Vidal finds schoolgirl Yuly being accosted on a city street, he subdues the attacker and then seduces the buxom, bespectacled teen in the plaid schoolgirl skirt, white socks and tennies. He massages her hefty, natural jugs and she tentatively, then sensually sucks his cock and strips coquettishly for a deep fuck. On the streets at night Nacho hires Lina, a racy Latina streetwalker in a tiny mini skirt that won't cover half of her meaty ass. The hired hottie squats for a blow job and works his thick cock with a two-hand-job. This is a serious &quot;girlfriend experience&quot; with deep kissing and rough, passionate slam-fucking that makes her young pussy gape. Nacho manhandles hot-blooded Colombian teen Sweet Sugar on his living room floor, yanking her by the hair for a deep-throat face-fuck. He shoves his monster meat straight up her ass, making it gape, and butt-fucks her dominantly, his foot clamping down her head. She fucks intensely and squirts a huge, torrential female ejaculation! Nacho finds comely teen cutie July working a mango stand and persuades her that to give porn a try. The young spitfire looks like a natural modeling lingerie and proves adept as Nacho fucks her face to slobbery gag spit, nails her against the wall and fingers her till she ejaculates girl cum! Her Colombian culo undulates hypnotically as she rides prick. Blonde teen Yessica Gold looks curvy in jeans and irresistible in a little, pink nightie and heels. She sits her meaty ass on Nacho's face, then bounces her gash on his fat prick, gasping and snapping her hips and muscular ass for maximum visual appeal. This is sweaty, intimate power-fucking.&quot;\n\n\nTags \n\nHardcore, XxX, Hot, Cumshot, Teen, Latina, Feature, Anal\n\n\nResolution  \n\n624x352\n\n\nDuration  \n\t\n03:06:51 \n\n\nSize      \n\n1.36 GB\n","torrent":{"xt":"urn:btih:c5d548165d706f5fbb5e341cc63c48761e748ec9","amp;dn":"Colombian+Teens+vol.+3+%5BDvdRip%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5d548165d706f5fbb5e341cc63c48761e748ec9","infoHashBuffer":{"type":"Buffer","data":[197,213,72,22,93,112,111,95,187,94,52,28,198,60,72,118,30,116,142,201]},"announce":[],"urlList":[]}}