{"title":"Tudors - The Family Story  (2013 - Retail epub)","uid":9368468,"size":1767314,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c6e18a8c0cafed327d028c472991947d47d5d063&amp;dn=Tudors+-+The+Family+Story++%282013+-+Retail+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Robin1966","files":5,"time":1387476933,"description":"Books : History : English\n\n&quot;A wonderfully fluent portrait of five generations... de Lisle brings an entirely fresh feel to the Tudor story, reminding us of the one thing the monarchs themselves wanted us to forget: the sheer improbability of their royal rule&quot; -- Dan Jones, author of The Plantagenets The Times (Saturday Review) &quot;In de Lisle's hands, this is a deeply human tale, a family tree come to vivid life, rather than a narrative of politics and power structures (Book of the Week)&quot; -- Helen Castor Sunday Telegraph &quot;One of the most interesting of today's historians, with her easy scholarship, fresh interpretation and presentation, Leanda De Lisle succeeds in casting a revealing light on what one had thought familiar. The pace never flags. Time and again she says something new in one of the most exciting and enjoyable books I have read for a long time.&quot; -- Desmond Seward History Today &quot;For those wanting a more grown-up experience of the Tudor past, there are few better places to start the Leanda de Lisle's new study. Many have told this story before. What makes de Lisle's account so fresh is her decision to start her &quot;family story&quot; not in 1485. but three generations earlier. Rarely has [this] story been told as well as here&quot; -- John Adamson Mail on Sunday &quot;Her compellingly written book not only illuminates obscure family members... but also provides fresh perspectives on some of the most familiar figures in our history... a work that elegantly combines wide-ranging research with fluent narrative&quot; -- Nick Rennison Sunday Times (Culture)\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:c6e18a8c0cafed327d028c472991947d47d5d063","amp;dn":"Tudors+-+The+Family+Story++%282013+-+Retail+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6e18a8c0cafed327d028c472991947d47d5d063","infoHashBuffer":{"type":"Buffer","data":[198,225,138,140,12,175,237,50,125,2,140,71,41,145,148,125,71,213,208,99]},"announce":[],"urlList":[]}}