{"title":"Juan Marse - Golden Girl (pdf)","uid":9299575,"size":1632047,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c6fcfb200fb8b5b6fa37089060a173fb1698b82c&amp;dn=Juan+Marse+-+Golden+Girl+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pharmakate","files":-1,"time":1386220528,"description":"**by request**\n\n\nJuan Marse (Helen R. Lane, trans.) - Golden Girl (Little, Brown, 1981). 195 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nJuan Marse (born January 8, 1933 in Barcelona as Juan Faneca Roca) is a Spanish novelist, journalist and screenwriter. In 2008 he was awarded the Cervantes Prize, &quot;the Spanish-language equivalent&quot; to the Nobel Prize in Literature.\n\nThe Spanish title of this book, which was made into a film, is La muchacha de las bragas de oro, &quot;The Girl With the Golden Panties,&quot; a rather more interesting title that the one used by the book's American publisher.\n\nA review: \n\nGolden Girl tells the story of an old Falangist, Luys Forest, busy writing his autobiography at his beach house in Calafell, who is paid a visit by his niece Mariana (the golden girl). The novel explores themes of memory, truth, and the construction of identity. Forest, a writer and former propagandist for Franco's regime, has denounced his fascist past and creates lies and fictions to make himself a nobler and better man than he truly was. Mariana, an earnest hippie is helping him type his autobiography while also critiquing it. He's paternal, she's flirtatious, and their relationship borders on incestuous. Reality, memory, and imagination clash from time to time and in the end they become indistinguishable. It's an excellent translation, the characters are well crafted, and, though slow paced, the novel does have cinematic elements, especially the blurring of fact and fiction that culminates in the finale (the book was in fact turned into a movie). But the novel, because it does not have a lot of action, will appeal most to those who have an affinity for Spain and Spanish history.","torrent":{"xt":"urn:btih:c6fcfb200fb8b5b6fa37089060a173fb1698b82c","amp;dn":"Juan+Marse+-+Golden+Girl+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6fcfb200fb8b5b6fa37089060a173fb1698b82c","infoHashBuffer":{"type":"Buffer","data":[198,252,251,32,15,184,181,182,250,55,8,144,96,161,115,251,22,152,184,44]},"announce":[],"urlList":[]}}