{"title":"Echobelly - On [1995]","uid":9368047,"size":321305423,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c871361103ef58db955fde5497bf692ae67e8d07&amp;dn=Echobelly+-+On+%5B1995%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GenXRock","files":-1,"time":1387468337,"description":"Gaining a different bassist and having longtime studio hound B.J. Cole in on some guest slide guitar didn't appreciably alter the Echobelly approach much -- the post-glam/punk feeling of the poppy music still predominates and Madan still claims the sharp and sly frontwoman role with fire. If nothing on On reaches the total heights of &quot;I Can't Imagine the World Without Me,&quot; it still possesses a few fine moments of note, otherwise generally killing time in its own fashion well enough. Johansson's guitar playing and Madan's singing and lyrics still inevitably call the Smiths shades to the forefront, no matter what. It's something they seem comfortable with at this point, though, and the rest of the band jointly adds a touch more fuzz and sludge in contrast, which makes a nice combination. Touches like the singsong sass on &quot;Go Away,&quot; which suits the sentiment of the lyrics to a T, while Johansson usually comes up with one killer riff or part per song that elevates what would be okay tunes just that little bit higher. Cole's own contributions, like the great electric slide wail on &quot;Something Hot in a Cold Country,&quot; don't hurt either. Sean Slade and Paul Kolderie's production remains up to the general level of that noted duo's other work: loud, cutting, and sounding great. &quot;King of the Kerb,&quot; an album standout and a fine single from the band, benefits not merely from the strange, nagging lead guitar melody from Johansson but said production, with a rich sound in the instrumental lead-in and a well-mixed chorus. Madan's wittiest moment probably comes with &quot;Pantyhose and Roses,&quot; a cutting portrayal of sexual objectification and fantasy, while her most heartfelt is the passionate &quot;Nobody Like You,&quot; a fun and desire-filled celebration of a loved one. (4/5)","torrent":{"xt":"urn:btih:c871361103ef58db955fde5497bf692ae67e8d07","amp;dn":"Echobelly+-+On+%5B1995%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c871361103ef58db955fde5497bf692ae67e8d07","infoHashBuffer":{"type":"Buffer","data":[200,113,54,17,3,239,88,219,149,95,222,84,151,191,105,42,230,126,141,7]},"announce":[],"urlList":[]}}