{"title":"The Man Who Killed Boys - Clifford L. Linedecker.epub","uid":9314904,"size":3673607,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c90686a47ef04bd586400f4e649cc622d511af06&amp;dn=The+Man+Who+Killed+Boys+-+Clifford+L.+Linedecker.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1386451155,"description":"A true story of mass murder in a Chicago suburb.\n\nSuccessful businessman, community benefactor, good friend and neighbor-- and perverted mass murderer.\n\nOver a period of three years, John Wayne Gacy, Jr. sexually tortured and murdered 33 boys. His friends and neighbors in his unassuming Illinois community never suspected a thing. Gacy was a Jekyll-and-Hyde figure, leading an outwardly normal life, but secretly brutalizing dozens of young men in a hidden lair, and concealing their bodies under the floorboards of his suburban home.\n\nThrough extensive personal interviews with those who knew Gacy, veteran true-crime scribe Clifford L. Linedecker takes us on a shocking ride through Gacy's life, delving deep into the man's troubled past, recounting his appalling series of murders, and recreating the drama of his trial-- which resulted in his execution by lethal injection in 1994. Gruesome and horrifying, The Man Who Killed Boys reveals stark terror set amid the daily lives of an ordinary community.","torrent":{"xt":"urn:btih:c90686a47ef04bd586400f4e649cc622d511af06","amp;dn":"The+Man+Who+Killed+Boys+-+Clifford+L.+Linedecker.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c90686a47ef04bd586400f4e649cc622d511af06","infoHashBuffer":{"type":"Buffer","data":[201,6,134,164,126,240,75,213,134,64,15,78,100,156,198,34,213,17,175,6]},"announce":[],"urlList":[]}}