{"title":"Darkness, Darkness - John Harvey  (2014 - Retail epub)","uid":10248577,"size":1158765,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c9441671f22a08e700245511a3c4a830fcef6410&amp;dn=Darkness%2C+Darkness+-+John+Harvey++%282014+-+Retail+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Robin1966","files":4,"time":1401321681,"description":"Books : Fiction : English\n\nThe final DI Charlie Resnick novel, from the Cartier Diamond Dagger winner and Sunday Times bestselling author of Cold in Hand.\n\n\n\n&quot;In this masterful unearthing of the grudges and resentments left behind by the Miners' Strike of three decades ago, John Harvey has found the perfect case for Resnick to get his teeth into. All the ingredients are here: social history, the problem of male violence, the shadow of death, and, of course, the search for a decent cup of coffee. Anyone new to Resnick's world should probably start here; John Harvey has saved the best for last.&quot; (Jon McGregor)\n\n&quot;Darkness, Darkness is so good that it makes me grateful not to have Charlie Resnick for competition any more, but as a reader I'll mourn his loss. If only every series of crime novels could end with such grace and style.&quot; (John Connolly)\n\n&quot;There is no end to Charlie Resnick. He lives in the imaginations of all those lucky readers who have picked up a book and travelled with him like an old friend. Darkness, Darkness is yet another superb telling of the character by John Harvey. As distinctly as I remember reading the first Resnick I will always remember this one. Rich in wistful telling, the story holds your heart steady in a tight fist. It doesn't let you go. It doesn't let you let go of the man either.&quot; (Michael Connelly)\n\n&quot;Not since D H Lawrence has a writer so captured the Nottinghamshire vernacular and place. In this atmospheric novel the crime is real: seedy and un-glamorised and the detective, Charlie Resnick, delving into a cold case, is older, wiser and like all good detectives, doing things his own sweet way. King of Crime John Harvey here demonstrates with trademark rationed lyricism how he earned his crown: he offers up a pitch-perfect ending for Resnick and the series that's masterful, poignant and true.&quot; (Jill Dawson)\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:c9441671f22a08e700245511a3c4a830fcef6410","amp;dn":"Darkness%2C+Darkness+-+John+Harvey++%282014+-+Retail+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9441671f22a08e700245511a3c4a830fcef6410","infoHashBuffer":{"type":"Buffer","data":[201,68,22,113,242,42,8,231,0,36,85,17,163,196,168,48,252,239,100,16]},"announce":[],"urlList":[]}}