{"title":"Nicki Bluhm &amp; The Gramblers [2013][EAC.Log,Cue.FLAC]","uid":9331380,"size":294798239,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ca00b336fb232820bc9950f54ef5e05e8c1b55ba&amp;dn=Nicki+Bluhm+%26amp%3B+The+Gramblers+%5B2013%5D%5BEAC.Log%2CCue.FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dickspic","files":15,"time":1386776490,"description":"Artist: Nicki Bluhm &amp; The Gramblers\nRelease: Nicki Bluhm &amp; The Gramblers\nReleased: 2013\nLabel: Little Sur Records\nCatalog#:LSR004\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: Americana,rock\n\nimage\n\n\n01. Little Too Late (5:03)\n02. Hey Stranger (3:40)\n03. Nothin' (4:54)\n04. Till I'm Blue (3:45)\n05. Ravenous (4:32)\n06. Deep Water (3:31)\n07. Go Go Go (3:19)\n08. Might Get Blessed (2:34)\n09. Check Your Head (3:42)\n10. Always Come Back (3:15)\n11. Willow Tree (2:28)\n\n\n\n\nOne of the most valuable aspects in a fair number of appreciated Alt-Country and Americana exponents is the capacity of ranging between different genres in their career and often in a single piece of work.\n\nMaking themselvels show to a wider public with the Van Sessions, a series of on-the-road videos like the Hall&amp;Oates &quot;I Can't Go For That&quot; cover that went viral, the North California based singer/songwriter Nicki Bluhm, after a couple solo releases, joints his partner Tim Bluhm of the Mother Hips (guitar, keyboards and vocals) and the other Gramblers members (bassist Steve Adams of ALO, drummer Mike Curry, Dave Mulligan guitar and vocals, Deren Ney lead guitar) for a collection of songs that span Rock, Country and Soul in a enjoyable and colorful set.\n\nSupported by mellow harmonies and enriched with first class arrangements, since its first spin the simple structure of the eleven tracks is what permits a straightaway and gratifying full impact with this self titled &quot;Nicki Bluhm and the Gramblers&quot;.\n\nInspired by the likes of Linda Ronstadt and Emmylou Harris, the resolute Nicki vocals, whether they're sultry and powerful or sweet and warm always seem to keep the pace of whatever style every single tune calls for.\n\nIn the beguiling &quot;Little too late&quot;, a potential airplay hit, funk and rock vibes start kicking in, while a soulful vein distinguish the slow paced &quot;Nothing&quot; and the murder 60's soul ballad &quot;Check Your Head&quot;. West Coast strong influences in the rythm of the glittering &quot;Deep Water&quot; utterly amalgamate with the twangy note of &quot;Hey Stranger&quot;.\n\nThe most roots oriented tune is the Nicki and Tim duet &quot;Til I'm Blue&quot;, a gem of extraordinary sweetness and beauty that would be perfect for a road trip soundtrack. &quot;Ravenous&quot; is an intriguing jump into the 70's early FM sound where echoes of the Fleetwood Mac Buckingham/Nicks period find complete expression in the silken Nicki lead.\n\nThe pretty &quot;Go Go Go&quot; that entertains with a rousing rocker attitude and the even more upbeat mark in the Southern Rock of &quot;Hold you breath&quot; are another example of how deftly and accurate the group is skilled in changing direction.Then back to a simple as much as effective melodic thread, &quot;Always come back&quot; is an heartfelt ode to the Bay Area origins.\n\nAs a matter of fact, the band versatility and the cohesion acquired since it began touring a couple of years ago are the secret of this finely crafted disc that certainly will take an important place in the 2013 Americana production..","torrent":{"xt":"urn:btih:ca00b336fb232820bc9950f54ef5e05e8c1b55ba","amp;dn":"Nicki+Bluhm+%26amp%3B+The+Gramblers+%5B2013%5D%5BEAC.Log%2CCue.FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca00b336fb232820bc9950f54ef5e05e8c1b55ba","infoHashBuffer":{"type":"Buffer","data":[202,0,179,54,251,35,40,32,188,153,80,245,78,245,224,94,140,27,85,186]},"announce":[],"urlList":[]}}