{"title":"Bottom Line #2  - Anal Interracial Porn XXX","uid":9377021,"size":2930379150,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:cc101a8e3326db6fc0e89400b3a6adcbd3789e14&amp;dn=Bottom+Line+%232++-+Anal+Interracial+Porn+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"KidAtomic","files":-1,"time":1387637731,"description":"Sean Michaels' Bottom Line #2 \n\nIn Sean Michaels' Bottom Line 2, the celebrated director/performer joins four butt-blessed babes for interracial scenes glorifying their rear assets. Cytherea, who at the beginning of the decade became a porn semi-legend for her astonishing ability to squirt multiple, monstrous female ejaculations, brings her special talent to the first scene. The leggy brunette looks gorgeous in her yellow corset, black fishnets and heels, and with blonde highlights in her long, brown hair. After some oral cock worship she rides Sean's big, black bone, hunkering down to grunt and gasp, her round cheeks tiny in his big hands. Suddenly she lifts herself and floods his meat with a torrential shower of girl cum. Between desperate fuck strokes she graphically gushes a total of six ejaculations, leaving herself delirious, visibly weak-kneed and panting for air. Sex doesn't get any more real. Another highlight is star Dana DeArmond's vignette, which explores the cuckold fetish. Playing the wife of Sean's best friend, she wears a black lacy lingerie outfit to seduce the unsuspecting stud. Soon the married slut is riding his pole and sucking it deeply, all the while narrating the scene with nasty talk about how she loves cheating on her husband with this superior black cock. On a dining table with her legs cranked up by her head, Dana takes Sean's dark meat way up her hungry, round ass ... and at the end of the scene she reveals that the whole escapade has been captured on camera for her cuckold husband's pleasure. Raven Black has the biggest butt in this movie, and her fishnets can't contain it any better than her black leather corset can confine her big knockers. (Raven could almost be a long lost Kardashian...) She gives Sean a long blow job and a serious, wanton rim job peppered with filthy talk. When she rides cock her butt cheeks look like big pillows, and after he climaxes on her face and in her hair she declares herself his cum bitch. Then there's Totally Tabitha, a statuesque blonde MILF whose scene starts with a soliloquy about her love for big, black cock delivered in her New Yawk accent. Outdoors on a chaise longue she rides Sean's prick as he grips her big guns; she worships his meat, sucks her pussy juice from his cock and takes his cream on her cunt. The four scenes here are unified by succulent female butts, but each delivers an individual flavor.\n\n    Scene 1. Cytherea, Sean Michaels\n    Scene 2. Totally Tabitha, Sean Michaels\n    Scene 3. Raven Black, Sean Michaels\n    Scene 4. Dana DeArmond, Sean Michaels\n\nLength 2 hrs. 31 mins.\nRating XXX\nReleased Jul 27 2010\nProduction Year 2010\nStudio  Buttman Magazine Choice\n\nActresses:\n    Cytherea [Facial Squirt IR]\n    Dana DeArmond [Anal Bald IR]\n    Raven Black [Facial IR]\n    Totally Tabitha [IR]\n\nActors:\n    Sean Michaels\n","torrent":{"xt":"urn:btih:cc101a8e3326db6fc0e89400b3a6adcbd3789e14","amp;dn":"Bottom+Line+%232++-+Anal+Interracial+Porn+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc101a8e3326db6fc0e89400b3a6adcbd3789e14","infoHashBuffer":{"type":"Buffer","data":[204,16,26,142,51,38,219,111,192,232,148,0,179,166,173,203,211,120,158,20]},"announce":[],"urlList":[]}}