{"title":"Clarc (GOG)","uid":10189032,"size":225782216,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cc8f0b79b9f77bae7f9e76dfeb5bb71a6449b803&amp;dn=Clarc+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Sarah116","files":1,"time":1400616736,"description":"Hey guys, here clarc. I saw that a user uploaded a torrent for this game yesterday but for some odd reason. It been deleted so i decided to upload it. Im sorry but this game does not come with any gog extras. It just the game only. I will be uploading &quot;kentucky route zero&quot; next with the latest patch. Hope you guys enjoy and please help seed.\n\n\n---------------------------\n\n\nWhat's cool about it:\n\n- Winner of the Deutscher Computerspielpreis 2014 (German Computer Games Award) for Bestes Mobiles Spiel (Best Mobile Game).\n\n- Features more than 100 spatial puzzle with 10+ hours of story-driven gameplay.\n\n- Detailed comic-style visuals with (almost) hand-painted textures.\n\n- Hilariously drunk robots dancing to funky German techno music.\n\n\n\nOverview:\n\nCLARC is an isometric, grid-based puzzle game with fast-paced arcade elements. It features comic style visuals in various different graphical themes, from the inside of a chaotic factory to the surface of Mars to the interior of an intruding enemy spaceship where you think, run, and fight through heaps and heaps of carefully designed puzzle and action areas.\n\nOur hero, Clarc #37, is a simple, hard-working maintenance robot, living in a decaying nuclear missile factory. Ever since the old supercomputer has disappeared, the rest of the facility has fallen into utter chaos. The discovery that diesel has thrilling effects on robotic circuits lead to a fierce shift in priorities: Every robot has since been focusing on drinking instead of working. Everyone except Clarc. So when a less-than-peaceful spaceship enters the stage to disarm and dismantle this out-of-control doomsday device of a partying factory, Clarc is the one to save the day. He has to overcome his programming to rescue his fellow robots and, of course, his newfound friend, the lovely atomic bomb, Clara.","torrent":{"xt":"urn:btih:cc8f0b79b9f77bae7f9e76dfeb5bb71a6449b803","amp;dn":"Clarc+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc8f0b79b9f77bae7f9e76dfeb5bb71a6449b803","infoHashBuffer":{"type":"Buffer","data":[204,143,11,121,185,247,123,174,127,158,118,223,235,91,183,26,100,73,184,3]},"announce":[],"urlList":[]}}