{"title":"The Starting Line - Discography (2001-2007) [FLAC]","uid":9336275,"size":1377777361,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cd07eb89b708092f076894056a62e8cf108e9951&amp;dn=The+Starting+Line+-+Discography+%282001-2007%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"politux","files":-1,"time":1386859787,"description":"\n  The Starting Line - Discography (2001-2007) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Punk-Pop, Alternative\n  Source: CD \n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  2001 With Hopes of Starting Over\n  2002 Say It Like You Mean It\n  2003 Make Yourself at Home\n  2005 Based on a True Story\n  2007 Direction (Japan)\n\n  Pennsylvanian punk-poppers the Starting Line originally came together in 1999 via version 2.0 of the old &quot;vocalist wanted&quot; flyer hanging at the local record store. Guitarist Matt Watts was playing with a few bands throughout his teenage years, but after seeing Ken Vasoli's AOL profile, he invited him to jam. Vasoli was soon installed as the bassist and singer, joining Watts, second guitarist Mike Golla, and drummer Tom Gryskiewitz to form Sunday Drive. Though barely out of high school, Sunday Drive started lining up shows and recording demos, and aggressively marketed everything with the aid of buddy old pal AOL and listings on MP3.com. Cali indie We the People took notice of the MP3s and soon offered a deal; however, punk-pop powerhouse Drive-Thru saw an opportunity in the group's fresh faces and accessible melodies, and swooped in to take control of the resulting demos. Sunday Drive wasn't going to argue -- with its highly successful roster (Something Corporate, Midtown, etc.) and Geffen distribution deal, Drive-Thru was a dream come true. By 2000, the quartet had become the Starting Line, and issued the With Hopes of Starting Over EP. \n\n  Warped Tour dates followed, the band's Internet presence remained strong, and when its debut full-length, Say It Like You Mean It, dropped in 2002, it was met with enthusiastic kid support. The band again spent the summer as part of its second Warped Tour, and its video clip for the heartfelt emo pop ballad &quot;Best of Me&quot; did quite well at MTV2. The Make Yourself at Home EP appeared before the year's end. In May 2005, the band issued their sophomore effort, Based On A True Story. Performance dates on the annual Vans Warped Tour followed that summer and even though their popularity increased, Geffen de-prioritized the album and gave very little promotional support to the single. After the group wiggled free from their contract, Virgin president Jason Flom caught one of their live shows and scooped up the band to his label. In 2007, the group began recording Direction, an album dedicated to their brand of concise, straight-forward, pop-punk tunes.","torrent":{"xt":"urn:btih:cd07eb89b708092f076894056a62e8cf108e9951","amp;dn":"The+Starting+Line+-+Discography+%282001-2007%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd07eb89b708092f076894056a62e8cf108e9951","infoHashBuffer":{"type":"Buffer","data":[205,7,235,137,183,8,9,47,7,104,148,5,106,98,232,207,16,142,153,81]},"announce":[],"urlList":[]}}