{"title":"In Bed With The Tudors (2013 - Retail Epub)","uid":9368477,"size":3341005,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cd68de632d3a8cabd971edd7bddbf5d279bd91bc&amp;dn=In+Bed+With+The+Tudors+%282013+-+Retail+Epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Robin1966","files":5,"time":1387477308,"description":"Books : History : English\n\nLearn what went on behind closed doors in the Tudor court. Illegitimate children, adulterous queens, impotent kings, and a whole dynasty resting on their shoulders. Sex and childbirth were quite literally a matter of life or death for the Tudors - Elizabeth of York died in childbirth, two of Henry VIII's queens were beheaded for infidelity, and Elizabeth I's elective virginity signalled the demise of a dynasty. Amy Licence guides the reader through the births of Henry VII and Elizabeth of York's two sons, Arthur and Henry, Catherine of Aragon's subsequent marriages to both of these men, Henry VIII's other five wives and his mistresses, and the sex lives of his daughters. This book details the experiences of all these women, from fertility, conception and pregnancy through to the delivery chamber, on to maternal and infant mortality. Each woman's story is a blend of specific personal circumstances, set against their historical moment: for some the joys were brief, for others it was a question that ultimately determined their fates.\n\nAbout the Author\nAmy Licence has been a teacher for over a decade. She has an MA in Medieval and Tudor Studies and has published several scholarly articles on the Tudors. She lives in Canterbury.\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:cd68de632d3a8cabd971edd7bddbf5d279bd91bc","amp;dn":"In+Bed+With+The+Tudors+%282013+-+Retail+Epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd68de632d3a8cabd971edd7bddbf5d279bd91bc","infoHashBuffer":{"type":"Buffer","data":[205,104,222,99,45,58,140,171,217,113,237,215,189,219,245,210,121,189,145,188]},"announce":[],"urlList":[]}}