{"title":"Sheryl Crow - The Very Best of Sheryl Crow 2003","uid":9319715,"size":187706469,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ce74257c498f967fcc22a6124b9f7de70f478997&amp;dn=Sheryl+Crow+-+The+Very+Best+of+Sheryl+Crow+2003&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Big-Papi","files":-1,"time":1386528938,"description":"Source: 2003 CD\n-\nSheryl Crow - The Very Best of Sheryl Crow 320cbr (Big Papi) 2003 \n-\nBy Busy Body \nThere are very few remaining artists who can really showcase true talent and acclaim while still making an impact on the charts. Shery Crow is one of these very few. Since her 1993 breakthrough debut album &quot;Tuesday Night Music Club,&quot; she has proven time and time again that women can really make it big in this business. She is a critics-darling with ordinary looks and an average voice, but strap a guitar on her, and she'll prove why she's lasted for ten years in this tough and competitive world of music.\n\n&quot;The Very Best Of&quot; is the most essential collection package you will come across all year, with ten years' worth of awesome lyrics, catchy melodies and superb production. It has wisely not been called Greatest Hits, because anyone will tell you that the songs in Sheryl's career have been a little hit-and-miss. However, when Sheryl has a hit on her hands, she knows it and so does the world. How many times has your local radio station played a Sheryl Crow song to death in the mid-Nineties? It happened over and over for years, and when looking back, it's not hard to understand why.\n\nHer debut album provided Sheryl with the mammoth classic &quot;All I Wanna Do,&quot; which starts off this compilation. Perhaps Sheryl's best-known song, this is a country/rock anthem that is quite literally one of the all-time great songs. Another three songs from that particularly vivid debut album follow, in the form of &quot;Leaving Las Vegas,&quot; &quot;Strong Enough,&quot; and &quot;I Shall Believe.&quot; The first two were big hits, while the latter is more of a crowd-pleaser that always gets fans going at her live shows. No less than four singles from Sheryl's self-titled sophomore masterpiece from the fall 1996 dominate the album. These four singles are truly the best of Sheryl, and are worth alone the price of this album! The first song from that second album is &quot;Everyday Is A Winding Road,&quot; which was one of the most heavily-spinned songs of that awesome decade, while &quot;If It Makes You Happy&quot; is one of the greatest and heaviest rock anthems I've ever heard. &quot;A Change Would Do You Good&quot; was another huge hit, and with a guitar melody that borders on insanely-catchy, it's not hard to see why! &quot;Home&quot; rounds off the collection of hits from the self-titled album, and it's a beautiful country ballad where even Sheryl's vocals seem whispered.\n\nWe get only three songs from Sheryl's third album &quot;The Globe Sessions,&quot; which is a bit of a disappointment because the songs from that album were all utterly awesome. &quot;My Favourite Mistake&quot; is the lead single, and it's just a stripped-down rock song, with rough and raw vocals and a beautiful chorus that warms the heart. &quot;The Difficult Kind&quot; is Sheryl's most criminally-underrated song ever. This is a masterpiece in ever sense of the word - listen and be amazed. &quot;There Goes The Neighborhood&quot; is one of Sheryl's most up-tempo tracks ever. The jazz-force is high on this classy and zesty number where Sheryl lets it all hang out. We get two songs from Sheryl's latest studio album &quot;C'mon, C'mon,&quot; which is a bit of a blessing in disguise as that wasn't her best album. &quot;Soak Up The Sun&quot; was the summer tune of 2002, and had everyone grooving, while &quot;Steve McQueen&quot; is a firm fan favourite.\n\nThis brings us to the latest new material that features on here. Firstly we have a cover of the Cat Stevens classic &quot;The First Cut Is The Deepest.&quot; This version has flopped in the UK, barely scraping the Top 40, but it's very underrated in my eyes. &quot;Light In My Eyes&quot; is another new song just for this album, and it really is Grammy-worthy. This takes Sheryl right back to her roots, with a catchy melody and brilliant lyrics. &quot;Let's Get Free&quot; closes the album, but it's a bit of a poor song which I feel should have been left off the album. &quot;Picture&quot; is Sheryl's mammoth duet with Kid Rock from last year, and it's also included on here.\n\nOVERALL GRADE: 10/10\n\nSheryl Crow's &quot;The Very Best Of&quot; is my tip for the best 'greatest hits' package of 2003. Fans and casual listeners have been waiting ages for this, and it's finally arrive in such a grand way. All of Sheryl's biggest hits from the past ten years (and then some!) are included for your listening pleasure. Once you finish listening to this, you'll not only feel compelled to buy all of Sheryl's amazing studio albums if you don't already own them, but you'll feel certain that this rock Goddess has a long and shining career ahead of her. With a new studio album due in 2005, the only way is up for Sheryl Crow! She hasn't faltered yet. Her albums just gets better and better, and I feel certain that Sheryl will maintain this in the remainder of her career.","torrent":{"xt":"urn:btih:ce74257c498f967fcc22a6124b9f7de70f478997","amp;dn":"Sheryl+Crow+-+The+Very+Best+of+Sheryl+Crow+2003","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce74257c498f967fcc22a6124b9f7de70f478997","infoHashBuffer":{"type":"Buffer","data":[206,116,37,124,73,143,150,127,204,34,166,18,75,159,125,231,15,71,137,151]},"announce":[],"urlList":[]}}