{"title":"Mule - 3 Albums 1992 - 1994  [FLAC] - Kitlope","uid":9302221,"size":615354110,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cf33ee58739104fc80804d4e5fa7377302b6efe6&amp;dn=Mule+-+3+Albums+1992+-+1994++%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Kitlope","files":30,"time":1386262009,"description":"File Type: FLAC Compression 6\nCd recorder: Plextor PX-716SA\nCd Ripper: EAC 0.99 prebeta 3\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTrackers:udp://tracker.openbittorrent.com:80, udp://tracker.publicbt.com:80, \nudp://tracker.istole.it:6969\nTorrent Hash: CF33EE58739104FC80804D4E5FA7377302B6EFE6\nFile Size: 586.84 Mb\nLabel: Quarterstick Records\n\n\nAlbums, Years &amp; Catalog # in this Torrent\n\n\nMule - Self Titled 1993 QS15CD *\nMule - Wrung 1994 QS25CD *\nMule - If I Don't Six 1994 QS29CD *\n\n\n* Denotes My Rip\n\n\nPlease help seed these FLACs! \n\n\n\nFrom Wiki:\n\nPreston Wright Long is the lead singer and guitar player for the bands Wig, Mule and Reelfoot (also known as P.W. Long's Reelfoot). Purported to be the brother of the frontman of The Laughing Hyenas but this is untrue.\n\nLong, who is very close with his personal details appears to have been reared in the Ypsilanti area (see Mule's &quot;Obion,&quot; and its reference to an &quot;Ypsilanti Man&quot;). He eventually wound up in Detroit.\n\nHis earliest work was with the band Wig, and it is his voice that you hear on the Lying Next to You record. Sometime in the early 1990s, Long began a side project with the Laughing Hyenas' rythmn section, Kevin Munro and Jim Kimball. They put together a concoction of field hollers, backwoods legends, hellbilly canon and mixed it with a semi-punk, semi-metallic musical assault that was best described as northern redneck, but intelligent, clamor.\n\nCalling themselves Mule, they released a musical single in 1991 or 1992 containing the song Tennessee Hustler. Their first self-titled album, produced by Leonard John (purported to be Nirvana producer Steve Albini), debuted shortly thereafter.\n\nWhile it had the raucousness of the Hyenas, and certain punk and alternative sensibilities, Mule was quite different. The album opened with P.W. shouting &quot;We left town to the sound of buckshot rain&quot; on Mississippi Breaks.\n\nAs P.W. himself later admitted, he didn't really know how play to guitar when he started with Mule, or at least not all that &quot;slickly&quot; to use his word. Instead, he used a variety of open tunings and such, coupled with a just a simple feel for what was right, to create his sound. Never bounded by the need for classic guitar solos, P.W. still put the guitar at the forefront with innovative melody lines and breaks.\n\nThe self titled album continued on with I'm Hell, the rawking What Every White Nigger Knows, the eerie Drown, the trip into Old NorthWest Folk Music with Now I Truly Understand, the duet with Kevin on Mama's Reason to Cry, Lucky and Sugarcane Zuzu with its admonition from Pbone's grandpappy that &quot;You can wish in one hand, and shit in the other, and see which one fills up first.&quot;\n\nMule's first album ended up on Spin's Ten Best Albums of 1993 You Didn't Hear list and prompted endless touring by the band. New songs were always in progress, with P.W. sometimes simply humming or yoodling the lyrics during live performances over the new music but before lyrics were complete.\n\nMule followed up their debut album with the EPs Wrung and the album If I Don't Six in 1994. Both are mid 90s punkabilly/country metal standards, with &quot;Wrung&quot; in particular fitting the definition of hard to define. The song/story of &quot;Searchlight&quot; is evil, mean and foreboding. The down and dirty call and response duet by P.W. and Kevin on &quot;Rope and the Cuckold&quot; is another highlight. &quot;If I Don't Six&quot; went in a slightly different direction, with some piano, a bit more soul but just as much ass whuppin'. In particular, Obion, Nowhere's Back, and Pent are songs of raw power, loneliness, depression and yet beautiful soulfulness.\n\nLong left the band in 1996, after their relocation to Philadelphia.\n\nLong then formed the band Reelfoot with bassist Dan Maister, and Mac McNeilly, drummer with The Jesus Lizard, releasing the albums We Didn't See You on Sunday and Push Me Again in 1997 and 1998 respectively. After this, Long went on a musical hiatus, broken by occasional gigs. During this time he directed the music video for the song You're the Reason by Hank Williams III. Long also started writing, contributing CD reviews to magazines and being the New York nightclub and restaurant critic for London's Crush Guide magazine.\n\nIn 2002, the band Shellac, who were curating the All Tomorrow's Parties music festival in Rye, asked Long to appear, and he shared the stage with bands such as Wire and The Fall. After this, Long released his first solo album, Remembered, in 2003.\n\nP.W. Long currently lives in Texas. He has worked as a contributor to the now-defunct weekly New York Sports Express. His latest solo album, on vinyl only, is God Bless the Drunkard's Dog with the song Let'em Roll showing up in a recent Iraq war documentary film.\n\nMr. Long would also remind you that he is neither an economist, nor a historian.\n\n\nAlbums in this Torrent\n\n\n\n\nMule - Self Titled 1992\n\n\nTracks:\n\nMississippi Breaks\nWhat Every White Nigger Knows\nI'm Hell\nDrown\nNow I Truly Understand\nMama's Reason To Cry\nLucky\nSugarcane Zuzu\n\n\n\n\n\nMule - Wrung 1994\n\nTracks:\n\nAss\nWe know Your Drunk\nSearchlight\nThe Rope and the Cuckold\n\n\n\n\nMule - If I don't Six 1994\n\n\nTracks:\n\nHayride\nX &amp; 29\nThe Beauteous\nNowhere's Back\nObion\nA Hundred Years\nSpearfish\nPiano\nPent\n\n\nEnjoy Mule :)\n","torrent":{"xt":"urn:btih:cf33ee58739104fc80804d4e5fa7377302b6efe6","amp;dn":"Mule+-+3+Albums+1992+-+1994++%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf33ee58739104fc80804d4e5fa7377302b6efe6","infoHashBuffer":{"type":"Buffer","data":[207,51,238,88,115,145,4,252,128,128,77,78,95,167,55,115,2,182,239,230]},"announce":[],"urlList":[]}}