{"title":"The Blow (2013) [FLAC]","uid":9308034,"size":202378463,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cf58e9208ff0b385586302c50090596824ff1a77&amp;dn=The+Blow+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"politux","files":-1,"time":1386353660,"description":"\n  The Blow (2013) [FLAC]\n\n  Genre: Electronic\n  Styles: Synth Pop, Indie Electronic\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Make It Up\n  02 A Kiss \n  03 From the Future \n  04 I Tell Myself Everything \n  05 Invisible \n  06 Like Girls \n  07 Hey \n  08 The Specter \n  09 Not Dead Yet\n  10 You're My Light \n\n  Seven years between albums is the kind of gap that can make people forget why they liked a band in the first place, but Paper Television was such a bold indie pop statement that it lingered in the memories of the Blow's fans. The project's self-titled album is the first with Melissa Dyne, who began working with Blow founder Khaela Maricich not long after she finished her Paper Television commitments. The Blow arrives after a long wait, a new collaboration, and a new home base (Brooklyn), yet it picks up very close to where Maricich's last album left off. While it trades in the same kind of brisk electro-pop that sounded so vibrant on Paper Television, nothing quite reaches the breathtaking heights of that album's best moments -- the charming album opener &quot;Make It Up,&quot; with its breathy beats, comes the closest. Granted, songs like &quot;Parentheses&quot; were such a unique mix of indie quirk and pop immediacy that trying to replicate them is a tall order (and probably a futile one). Instead, Maricich revisits the cerebral feel of her pre-Paper Television work and filters it through that album's dazzling pop. \n\n  She's much more detached on these songs, examining life and love at a remove: &quot;Hey&quot; is an almost painfully self-aware examination of heartache with the chorus &quot;I can see now/I did this to myself,&quot; and Maricich sounds more than a little disgusted when she sings &quot;I can see the future beckoning with its dirty little finger.&quot; Details like these are why she remains a unique and remarkably quotable songwriter, and on The Blow she masters the kind of arch storytelling that St. Vincent kept alive in her absence. &quot;Like Girls&quot; is a surreal vignette of femininity and sexuality, telling a looping story where a pink powder puff becomes a handgun; &quot;The Specter&quot; is an elaborate tableau of lust, boredom, and waiting to be invited to the beyond by Death. Songs such as the rambling &quot;I Tell Myself Everything,&quot; where a line like &quot;One good heartbreak and you'll sing for a decade&quot; is tossed off, suggest that the album's distance might be a haven from too many feelings, but Maricich does bare her heart occasionally. &quot;You're My Light&quot; reaffirms that the Blow can do genuine emotion without sacrificing any cleverness; &quot;Invisible,&quot; which nails just how negating breakups feel, is somewhat paradoxically one of the most engaging songs here with its booming drums and wounded flutes. Song for song, The Blow is arguably a more consistent set of songs than Paper Television was, but its aloof wit ultimately makes for slightly smaller pleasures than what came before it.","torrent":{"xt":"urn:btih:cf58e9208ff0b385586302c50090596824ff1a77","amp;dn":"The+Blow+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf58e9208ff0b385586302c50090596824ff1a77","infoHashBuffer":{"type":"Buffer","data":[207,88,233,32,143,240,179,133,88,99,2,197,0,144,89,104,36,255,26,119]},"announce":[],"urlList":[]}}