{"title":"The Science of Superman by Mark Wolverton.pdf","uid":9366398,"size":30502039,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d08e909c438abe2a79ee893b6fcfd5fba3655f8b&amp;dn=The+Science+of+Superman+by+Mark+Wolverton.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MaxiDownloads","files":-1,"time":1387421450,"description":"This is a PDF e-Book of &quot;The Science of Superman&quot; from Mark Wolverton.\n\nYou will believe a man can fly!\n\nHe is known as the Man of Steel -- the Last Son of Krypton. For more than half a century, Superman has been an American icon and the world's first and most recognizable super hero. From his beginnings as the featured character in his own comic book, through multiple incarnations on radio, newspaper syndication, television, and the movies, Superman has emerged as the flagship hero of a publishing empire. In fact, the Man of Steel has become so ubiquitous, it's as if he were real.\n\nBut what if he were real? What if the Kryptonian named Kal-El, a humanoid being whose world orbited a far-off red dwarf star, was actually raised here on Earth? Would, in fact, such a being be capable of achieving the amazing feats of power commonly associated with Superman? And if so, how could his powers be scientifically explained? \n\nIn &quot;The Science of Superman,&quot; gifted science writer Mark Wolverton takes up the challenge and answers these very questions. Examining Superman's powers through the lens of modern science, Wolverton explains the fundamental biological and genetic differences between Earthlings and Kryptonians that allow Superman to exercise extraordinary abilities on our planet. For the first time anywhere, you'll understand the logic and science that underlie Superman's &quot;super powers.&quot; You'll never look at the Man of Steel the same way again.","torrent":{"xt":"urn:btih:d08e909c438abe2a79ee893b6fcfd5fba3655f8b","amp;dn":"The+Science+of+Superman+by+Mark+Wolverton.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d08e909c438abe2a79ee893b6fcfd5fba3655f8b","infoHashBuffer":{"type":"Buffer","data":[208,142,144,156,67,138,190,42,121,238,137,59,111,207,213,251,163,101,95,139]},"announce":[],"urlList":[]}}