{"title":"Pixeljunk Monsters v1.1 (Native)","uid":9370312,"size":617516671,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:d1cb74bcd9f1c5ab7a7e8c8ef557b3ecadc9c988&amp;dn=Pixeljunk+Monsters+v1.1+%28Native%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Pazazz","files":1,"time":1387511062,"description":"Game has been tested on OSX 10.9 works perfect.  MY seeding speed is slow so if the first few of you who DL this wouldnt mind please seed it untill this toreent is established...thanks, enjoy\n\nsorry for the no title pic, just wont accept my bayimg tag for some reason...weird\n\n\n                               PIXELJUNK MONSTERS V1.1\n\nInspired by the popular and addictive &quot;tower defense&quot; genre, PixelJunk Monsters takes the simple real-time strategy concept of building, researching and base defending and presents it in a uniquely attractive style. With meticulously hand-drawn 2D art, PixelJunk Monsters recreates the look of a classic with crisp graphics designed for optimal viewing in Full 1080p HD. The player controls a defender-of-the-forest character in a lush 2D environment. The player's goal is to strategically defend the pathway to his homebase from an onslaught of various threatening monsters. In between waves of monster attacks, the player scrambles to reinforce his defenses by collecting gold coins and jewels from fallen enemies to finance new towers and research deadlier weapons. Eventually, the player can harness the elements throughout the 20 different stages to cast lightning storms across the forest. Gamers can enjoy PixelJunk Monsters with a friend in offline co-op mode, which requires careful strategy and communication. \n\n\n\n\n\n&lt;h2&gt;hmmm&lt;/h2&gt;\n\n","torrent":{"xt":"urn:btih:d1cb74bcd9f1c5ab7a7e8c8ef557b3ecadc9c988","amp;dn":"Pixeljunk+Monsters+v1.1+%28Native%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1cb74bcd9f1c5ab7a7e8c8ef557b3ecadc9c988","infoHashBuffer":{"type":"Buffer","data":[209,203,116,188,217,241,197,171,122,126,140,142,245,87,179,236,173,201,201,136]},"announce":[],"urlList":[]}}