{"title":"The Training Of O--ToO-34188 Daisy Ducati and Owen Gray","uid":9270517,"size":3593012691,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d205bfd806f31ffed0e6171629975c2fa8c21a82&amp;dn=The+Training+Of+O--ToO-34188+Daisy+Ducati+and+Owen+Gray&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1385767962,"description":"Training a Slave to Take it in the Ass, Day Three\n\nNov 29, 2013 - Performers: Owen Gray  and  Daisy Ducati \n\n\nMP4 and WMV + Pics.\n\n\nDucati is hungry for dick. But she is going the get it the way we want to see her take it: in that hot fucking ass. Even more, she is going to earn it first. \n\nI want to know how much she will suffer for it. I clamp her sensitive little nipples to the ceiling and make her pull against them to grind her cunt on a vibe while I berate her. She squeals and squirms, and as the predicament gets harder and harder, so does my dick. That is a good sign, Daisy. Good girl. Keep it up. \n\nYes she can suck dick, but she is too dainty about it. I want filth. I want drool. I want to see this hot bitch devour that thick cock so hard that she is gagging on it. Choking on it. Worshiping it. Only then is she allowed to fuck it. \n\nI've been burning this girl's thighs up all week and today is no exception. I want cowgirl. I want it now, yesterday, and tomorrow. I want this slut to work that cock with her slutty pussy harder than she ever has. At Training of O the Slaves do the Work. That means the Slaves do the Fucking. Hot bitches bouncing on hard cocks. Now. I want her to fuck it like this is the last fuck she is ever going to get, and I am here to see that is exactly what we get. \n\nHer asshole is so tight and fresh that it has taken three days of trying to get a cock into it. This is the day, Daisy, that you really are going to take it for us. I will make you take that dick deeper into your slutty asshole than you ever thought possible, and you will have the most intense orgasms while doing so. Now, you are on your way to being an Anal Slut.\n\nScreens &lt;a href=&quot;\nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=34188&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=34188&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:d205bfd806f31ffed0e6171629975c2fa8c21a82","amp;dn":"The+Training+Of+O--ToO-34188+Daisy+Ducati+and+Owen+Gray","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d205bfd806f31ffed0e6171629975c2fa8c21a82","infoHashBuffer":{"type":"Buffer","data":[210,5,191,216,6,243,31,254,208,230,23,22,41,151,92,47,168,194,26,130]},"announce":[],"urlList":[]}}