{"title":"Alternative Views - The Pedophile Conspiracy [xyz]","uid":9309275,"size":451407413,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d3cab82956fa2900eb436949231357b5b2a5eb69&amp;dn=Alternative+Views+-+The+Pedophile+Conspiracy+%5Bxyz%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"one_last_round","files":11,"time":1386377104,"description":"the description of the crimes can be graphic.  Please only download if you are over 16 or 18.  This can be found on youtube and is a news investigation into pedophile. \n\nThe tragic and shocking abuse of boy prostitutes is discussed by Dr. Tom Philpott and former Editor of _The Daily Texan_, Mark McKinnon, who has written articles on the subject. Philpott has found that these children are frequently physically abused, even tortured and killed. Many of the men who participate in this &quot;practice&quot; are among some of the most respected people at the top levels of the U.S. corporate and governmental structures. We discuss prominent cases of sexual abuse of boys and possible connections between child prostitution and the murder of black children in Atlanta. The program is enhanced by the use of segments of two 1979 documentaries _Boys for Sale_, produced for Channel 11 in Houston and Channel 13 in Atlanta.\n\n Run time: 59:14\n Recorded October, 1981\n News 1984\n Copyright December, 1983 ???\n\n 127. BOYS FOR SALE (PART II)\n\n Because this tragic, national scandal has largely been ignored by the mass media, our concluding segment focuses on the press coverage and on the handling of the situation by the law enforcement and judicial systems. The program looks closely at the boys themselves: their backrounds, how they got into &quot;the life,&quot; why they stay in it and how they feel about themselves. We also reveal the extent of the threats and violence toward the people who have been active in exposing the situation and bringing it to the attention of the public.\n\n Run time: 58:18\n Recorded October, 1981\n Copyright October, 1981\n\n\n Now having watched it, this is a great expose and possibly the best on child trafficking.  One child got killed after being on camera.  The people exposing this got shot at and lived.  Not sure if they are still alive or have now been killed off. Best to pray for these children and the people that are doing it.\n\nCheck me out on facebook @ Craig Woyak Productions \n Two good torrent sites concen.org conspiracyhub.com ","torrent":{"xt":"urn:btih:d3cab82956fa2900eb436949231357b5b2a5eb69","amp;dn":"Alternative+Views+-+The+Pedophile+Conspiracy+%5Bxyz%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3cab82956fa2900eb436949231357b5b2a5eb69","infoHashBuffer":{"type":"Buffer","data":[211,202,184,41,86,250,41,0,235,67,105,73,35,19,87,181,178,165,235,105]},"announce":[],"urlList":[]}}