{"title":"Mantaray - Some Pop [1994]","uid":9386913,"size":316865637,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d7bda0dd2223e69a4b65b4320528606d4987e880&amp;dn=Mantaray+-+Some+Pop+%5B1994%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GenXRock","files":-1,"time":1387818738,"description":"Mantaray was one of those bands that always got pushed to one side just like other bands that didn't conform to  the Oasis pulp and Blur formula.Funny thing is Mantaray were making music that was just as good as song on &quot;Modern life is rubbish&quot; which was being held as the Great Britpop album!.\n\nSo we have Mantarays 1st ablum &quot;Some pop&quot; which was released in 1994 and had a slight nod to the Mod and Freakbeat movement of the 60's and in all reality is a fantastic album.They were apart of the &quot;new wave of the new wave&quot; that emerged around 1994 which included bands like Thurman, Menswe@r, These animal men and S*M*A*S*H. Mantaray were gainging speed and toured like hell through 1994 honing their sound which was always apart from the rest of the Britpop bands of the time (bands started to introduce trumpets around mid 95). Stand out tracks are &quot;Insomniacs dream&quot;, &quot;Without a doubt&quot; and &quot;closet hetro&quot; to name but a few, these were in essence the raw driving power of the album, all snarls and big teeth but still wearing a skinny tie!.\n\nBy the time the 2nd album hit &quot;The red and the blues&quot; Britpop was gearing down and changing its sound.\nNew bands like Sussed and The space monkeys had a more 90s baggy sound and this was also the case for Mantarays 2nd effort. The album had a more Madchester sound that can be found in the opening track &quot;Know where to find you&quot; and the track &quot;Always tomorrow&quot; but it still had flourishings of the mod pop we loved from the 1st album.\n\nWhat set Mantaray and other &quot;NWOTNW&quot; bands were simple straight forward 3 minute pop songs that  smacked you in the face sung  by skinny indie boys who did way too much Speed!. And for a time it was perfect  and still is, Over the years the term &quot;Britpop&quot; has been blighted by bands like Oasis and Blur and its true those bands were a part of the scene. But the real Britpop were bands like Mantaray and all those small bands on small indie labels.\n\nWhen the worde INDIE actually stood for something !!!!\n\nfrom &quot;Pogoing to Britpop&quot;","torrent":{"xt":"urn:btih:d7bda0dd2223e69a4b65b4320528606d4987e880","amp;dn":"Mantaray+-+Some+Pop+%5B1994%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7bda0dd2223e69a4b65b4320528606d4987e880","infoHashBuffer":{"type":"Buffer","data":[215,189,160,221,34,35,230,154,75,101,180,50,5,40,96,109,73,135,232,128]},"announce":[],"urlList":[]}}