{"title":"[XLGirls] Maggie (Rookie Nookie / 12.13.2013)","uid":9348243,"size":401766480,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d8375559e7d2b0f2dec54388872d04305c1019e0&amp;dn=%5BXLGirls%5D+Maggie+%28Rookie+Nookie+%2F+12.13.2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"chkm8te","files":1,"time":1387073594,"description":"[XLGirls] Maggie (Rookie Nookie / 12.13.2013)\n\nIt's Maggie's first time getting fucked on-camera but definitely not her first time fucking. The girl is super-sexy and she knows it but she doesn't flaunt her sexuality the way a professional porn star flaunts it. If anything, Maggie is very much the girl-next-door type. She's moved quickly from solo modeling to full-on XXX sex scenes. Immediately, in fact. Maggie could easily become of the most highly-rated girls. Maggie is reading a book when she's interrupted by her horny guy friend. Looking at Maggie and her big boobs drives him crazy. Never hesitate to make a move when a girl built like this is relaxing in bed. He comes on strong and plays with her heavy mams. Maggie says she loves to have a man caress, pinch, squeeze and fondle her tits and his handiwork has Maggie reaching for his sausage. They don't waste any time. She gives him a blow job while he's dangling out of his fly. His hands hold her head, guiding it up and down. Maggie likes a man to direct her in bed. She keeps her hands off his cock and her righteous knockers as he fills her mouth, pumping in and out, a hands-free blow job. She straddles him and continues to give him lip service, licking his shaft and balls, placing his dick between her immense love-pillows. It's Maggie's turn for oral pleasure. Her stud parts her legs wide and lowers his head to give her head, spreading her pussy-petals and tongue-drilling her pink slit. Maggie is extremely flexible and limber and he is able to push her legs all the way back so she is really spread wide. Now is the time to wedge his cock into Maggie and to deliver the wood. The bone dance begins. Maggie often looks directly into the lens although this is not a P.O.V. scene. &quot;The thought of men watching me and wanting me makes me more excited. I am happy to share myself. I enjoyed this experience and I want to have more. I used to be very shy about sex. Now I am changing.&quot; Enjoy Maggie, another bone-stiffening, bodacious babe, someone to celebrate and hope to see again.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=e5qjqzsexn642evhr6ex.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=e5qjqzsexn642evhr6ex.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=t5m8ytysztdgxq8i672w.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=t5m8ytysztdgxq8i672w.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:d8375559e7d2b0f2dec54388872d04305c1019e0","amp;dn":"%5BXLGirls%5D+Maggie+%28Rookie+Nookie+%2F+12.13.2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8375559e7d2b0f2dec54388872d04305c1019e0","infoHashBuffer":{"type":"Buffer","data":[216,55,85,89,231,210,176,242,222,197,67,136,135,45,4,48,92,16,25,224]},"announce":[],"urlList":[]}}