{"title":"Spaceforce.Constellations.RIP-Unleashed ","uid":9352190,"size":174997745,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d9738abe2dd77672bbb9e4581218532c3d935898&amp;dn=+Spaceforce.Constellations.RIP-Unleashed+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"7","files":38,"time":1387151490,"description":" Spaceforce.Constellations.RIP-Unleashed \n\n Spaceforce Constellations \n\n NOTE: 'scene' release from 2012-Jul-18 \n\n RIPPED: Nothing \n\n Genre: Strategy \n Developer: Dreamatrix \n Publisher: Dreamatrix \n\n System Requirements: \n ~~~~~~~~~~~~~~~~ \n\n     Minimum: \n\n         OS: Windows XP / Windows Vista / Windows 7/Windows 8 \n         Processor: 1000 MHz Pentium or AMD equivalent \n         Memory: 256 MB RAM \n         Graphics: DirectX 9 Compatible Graphics Card \n         DirectX: Version 9.0c \n         Hard Drive: 500 MB available space \n         Sound Card: DirectX 9.0c compatible sound card \n\n     Recommended: \n\n         OS: Windows XP / Windows Vista / Windows 7/Windows 8 \n         Processor: 1000 MHz Pentium or AMD equivalent \n         Memory: 512 MB RAM \n         Graphics: DirectX 9 Compatible Graphics Card \n         DirectX: Version 9.0c \n         Hard Drive: 500 MB available space \n         Sound Card: DirectX 9.0c compatible sound card \n\n Description: \n ~~~~~~~~ \n\n An action-packed strategy game of galactic conquest! Welcome to a new experience in gameplay and battle your way through a series of devastating space feuds, for supremacy across the universe. Unleash your firepower and launch an arsenal of special attacks to destroy the enemy. \n\n Explore the galaxy and distant constellations, where resources, new life forms and fearsome adversaries abound. Destroy your opponents with lasers and missiles, along with a dozen special attacks and weapons you can earn through mining and search for life mini games. \n Place spaceships in combat formation at the battlefront, keeping in mind that the vulnerable and missile attack ships, should be positioned behind the stronger crafts that are equipped with lasers and abundant health points, in order to engage the enemy and withstand attacks that would otherwise destroy inferior spaceships. When all the crafts of either opposing fleet have been destroyed, the battle is over. \n\n If you win, but have damaged crafts, return to the nearest base and mobilise available ships for the next mission. As the game progresses, depending on your leadership status, you have the option of selecting up to four spaceships with different abilities in every space station and a total of six in battle formation. \n Each spaceship can be upgraded by collecting experience points during combat. The current status is denoted by rank signs. Ships with more experience can withstand greater damage and deliver more powerful hits. \n\n The scan button helps detect resources, which can be found by scanning and mining different sectors of the galaxy. Collecting crystals is strategically essential, because special weapons cannot be acquired without them. Without these special weapons, you will be incapable of completing specific missions. \n There are three types of crystals and their various combinations are required for special attacks. Use the crafting system in space stations to create the sort of crystal needed for the desired weapon. \n\n The search for life will grant you life points. While claiming life points, you will get promotions with rewards and additional crystals. \n Engage in one-on one battles and lead your mother-ship against the enemy's. The battle of the mother-ship is a turn based card collision. The results of all mother-ship battles can be tracked in the space base Hall of fame panel, where your rank is displayed. \n\n Install Notes: \n ~~~~~~~~~ \n\n 1. Unpack the release with WinRAR or equivalent \n 2. Install by running unl-spco.exe \n 3. Start game with Constellations.exe \n\n And finally enjoy it !!! \n\n :P \n\n PS: Files are packed according to (0-day) scene rules ... \n\n The uploaded files are ZIPped. \n\n Inside the ZIPped files are the RAR files. \n\n How to unzip all files in an easy way: \n\n Select all ZIP files, right click and click Extract files... \n","torrent":{"xt":"urn:btih:d9738abe2dd77672bbb9e4581218532c3d935898","amp;dn":"+Spaceforce.Constellations.RIP-Unleashed+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9738abe2dd77672bbb9e4581218532c3d935898","infoHashBuffer":{"type":"Buffer","data":[217,115,138,190,45,215,118,114,187,185,228,88,18,24,83,44,61,147,88,152]},"announce":[],"urlList":[]}}