{"title":"Death by Supermarket, 2nd edition The Fattening, Dumbing Down an","uid":9360212,"size":2166972,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d9d5c92e1eb7792a37f6b0a4ffaa216a4d2a3dd5&amp;dn=Death+by+Supermarket%2C+2nd+edition+The+Fattening%2C+Dumbing+Down+an&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"420weedman","files":4,"time":1387299448,"description":"The epidemics of obesity, disease, low IQ, and depression are the result of a new source of malnutrition caused by chemically loaded, nutrient dead 'science fiction' food made in factories. Nancy Deville masterfully links America's obsession with factory food and our growing reliance on the pharmaceutical industries. This well-researched guide based on scientific studies reveals the imminent danger behind the low fat/low cholesterol diet and links the introduction of this diet to the proliferation of high-fructose corn syrup, vegetable oil, endocrine disrupting soy, neurologically damaging aspartame, and other unhealthy ingredients that pervade factory food. You do not have to stay fat, depressed, or sick, tethered to pharmaceuticals and dreading old age. It's never too late to begin reversing the effects of factory food. &quot;Death By Supermarket&quot; shows you how to quit dieting and taking drugs, provide your body and brain with nutritional building blocks, and reclaim your genetic potential - including your ideal body weight - by choosing a historically eaten diet of real, whole, living food.","torrent":{"xt":"urn:btih:d9d5c92e1eb7792a37f6b0a4ffaa216a4d2a3dd5","amp;dn":"Death+by+Supermarket%2C+2nd+edition+The+Fattening%2C+Dumbing+Down+an","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9d5c92e1eb7792a37f6b0a4ffaa216a4d2a3dd5","infoHashBuffer":{"type":"Buffer","data":[217,213,201,46,30,183,121,42,55,246,176,164,255,170,33,106,77,42,61,213]},"announce":[],"urlList":[]}}