{"title":"Jerry E. Smith - HAARP - BroÅ„ ostateczna.pdf","uid":9322067,"size":11113142,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d9e0da8d48474bc88e10295f47d4fac5f7d08a1d&amp;dn=Jerry+E.+Smith+-+HAARP+-+Bro%C5%84+ostateczna.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"conspiracyPDF","files":1,"time":1386569932,"description":"Jerry E. Smith - HAARP - BroÅ„ ostateczna\n\nMost people were introduced to the High-frequency Active Auroral Research Project (HAARP) in 1995 when Dr. Nick Begich and Jeane Manning exposed the &quot;research&quot; station on the North Slope of Alaska in the book Angels Don't Play This HAARP. Begich agree that to believe that this powerful technology will not be used to further military and political agendas is naive.\n\n&quot;What could a nation or a conspiracy do with weapon that can 'fry' men's minds? What if you could induce emotions, fear or rage, at will? What if you could do it over a large area, affecting enemy troops on their way to battle? Whole cities? Even entire continents?&quot; Smith asks.\n\nOne has to admit that such talk is the territory of conspiracy &quot;theorists&quot; and belongs in the science fiction department of the local library. However, the published science, much of which is also available through your public library, and recorded history, support the likelihood that HAARP will be used against people to achieve evil ends.\n\n&quot;We live in an age where science fiction is becoming fact faster than the futurists can get their visions into print,&quot; Smith observes.\n\nIndeed.\n\nIf you found Angels Don't Play This HAARP fascinating, then HAARP: The Ultimate Weapon of the Conspiracy will be the next logical step in understanding what HAARP means to those upon whom it will be used and those who desire to have access to such powerful weapons.\n","torrent":{"xt":"urn:btih:d9e0da8d48474bc88e10295f47d4fac5f7d08a1d","amp;dn":"Jerry+E.+Smith+-+HAARP+-+Bro%C5%84+ostateczna.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9e0da8d48474bc88e10295f47d4fac5f7d08a1d","infoHashBuffer":{"type":"Buffer","data":[217,224,218,141,72,71,75,200,142,16,41,95,71,212,250,197,247,208,138,29]},"announce":[],"urlList":[]}}