{"title":"Elsevier Reflectors Formed by Inflation.pdf","uid":9261213,"size":5164921,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc0325a42633460d29bfa2ecba4f108bb683eb20&amp;dn=Elsevier+Reflectors+Formed+by+Inflation.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1385626973,"description":"Abstract\nParaboloids of revolution over 1 meter in diameter have been formed from flat sheets by inflation without the use of a mold or template. Quality is adequate for microwave we and for most high-concentration applications for focusing solar energy. The process is suitable for making reflectors in ones or twos to special focal lengths and diameters. but could also be automated for production runs.\n\n\nIntroduction\nParabolic reflectors a few meters in diameter are required for a number of purposes such as microwave relay antennas, solar concentrators, searchlight mirrors and astronomical telescopes. The cost is extremely high for telescope mirrors where surface accuracy of a fraction of an optical wavelength is required, but even where surface tolerance may be relaxed to 1 mm or so, as with centimeter-wave antennas, the cost is not low. For example, the cost will generally be orders of magnitude higher than the material cost. The reason for this lies with the mode of manufacture. Several techniques depend upon the construction of a steel mold or dies, as with vacuum forming and pressing (sheet metal), a graphite mold (glass dumping) or a mold made from plaster or other soft material (fiberglass). The initial cost of the mold is substantial and has to be spread over the number of reflectors manufactured. An unattractive feature of a valuable mold is that the focal length is frozen so that no flexibility is gained that might allow the mold to be adapted to other focal lengths later. Templates are cheaper than molds and have been used for spinning microwave antennas from sheet metal.\n","torrent":{"xt":"urn:btih:dc0325a42633460d29bfa2ecba4f108bb683eb20","amp;dn":"Elsevier+Reflectors+Formed+by+Inflation.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc0325a42633460d29bfa2ecba4f108bb683eb20","infoHashBuffer":{"type":"Buffer","data":[220,3,37,164,38,51,70,13,41,191,162,236,186,79,16,139,182,131,235,32]},"announce":[],"urlList":[]}}