{"title":"Stitch 'N Bitch - Debbie Stoller.epub","uid":9396060,"size":6765701,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:df0e84f9739edccff9f454b164fe7756c31bea87&amp;dn=Stitch+%27N+Bitch+-+Debbie+Stoller.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mohammad_AT","files":1,"time":1387985605,"description":"Knitting is hot, with 4 million newcomers in the last few years joining a core group of 38,000,000 knitters nationwide. And these are primarily young, creative, connected chicks with sticks who are coming together in living rooms, knitting cafes, and chic yarn stores, and making everything from funky hats to bikinis.\n\nIn Stitch 'n Bitch, Debbie Stoller-founder of the first Stitch 'n Bitch knitting group in New York City-covers every aspect of knitting and the knitting-together lifestyle: the how-to, the when-to, the what-to, the why-to. Writing with wit and attitude (The Knitty-Gritty, Blocking for Blockheads), she explains the different types of needles and yarns (and sheep, too) and all the techniques from basic to fancy, knit to purl to cast-off. She also shares her special brand of corrective surgery for when things go wrong, and offers fun and informative sidebars on such topics as how to find the best yarn for less, how to make a buttonhole, knitting etiquette, and what tools to keep in your knitting bag. At the heart of the book are forty stylish patterns: Alien Scarf, Big Bad Baby Blanky, Mohair Hoodie, Kitty and Devil Hat, Cell Phone Cozy, and Wonder Woman Bikini. And for anyone interested: how to start a Stitch 'n Bitch group.","torrent":{"xt":"urn:btih:df0e84f9739edccff9f454b164fe7756c31bea87","amp;dn":"Stitch+%27N+Bitch+-+Debbie+Stoller.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df0e84f9739edccff9f454b164fe7756c31bea87","infoHashBuffer":{"type":"Buffer","data":[223,14,132,249,115,158,220,207,249,244,84,177,100,254,119,86,195,27,234,135]},"announce":[],"urlList":[]}}