{"title":"Suffer the Children - Craig Dilouie","uid":10243240,"size":1025477,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:df379a56720d9e2a509373c61f5ecd364f04ba60&amp;dn=Suffer+the+Children+-+Craig+Dilouie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1401256355,"description":"One day, the children die. Three days later, they come back.\nAnd ask for blood.\nWith blood, they stop being dead. They become the children they once were.\nBut only for a short time. \nToo soon, they die again. And need more blood to live ...\n\nThe average body holds ten pints of blood.\nHow far would you go for your child?\n\n**\n\nReview\n\n&quot;Not for the faint of heart.&quot; -Jonathan Maberry, author, Extinction Machine\n\n&quot;A stark, brutal and chilling vision of the end of days.&quot; -David Moody, author, Hater\n\n&quot;It will shake you to the core.&quot; -Joe McKinney, author, The Savage Dead\n\n&quot;Tense enough so that you can almost hear the clock ticking.&quot; -Jack Ketchum, author, The Girl Next Door\n\n&quot;The most disturbing book I've ever read.&quot; -Peter Clines, author, Ex-Heroes\n\n&quot;The most chilling, compelling and convincing apocalyptic novel I've ever read.&quot; -John Dixon, author, Phoenix Island\n\n&quot;A remarkable tapestry of raw emotion, loss and guilt, soaked with terror.&quot; -Stephen Knight, author, The Gathering Dead\n\n&quot;A relentless burn of a novel.&quot; -Jason Bovberg, author, Under the Skin\n\n&quot;Rips out your heart and leaves you hanging on every word.&quot; -Jackie Druga, author, The Flu\n\n&quot;Brutal, painfully realistic and absolutely horrifying.&quot; -Eloise J. Knapp, author, The Undead Situation\n\n&quot;Will haunt you long after you finish reading.&quot; -Gareth Wood, author, Rise\n\n&quot;Craig DiLouie shows us yet again why he is one of the horror community's most skilled writers.&quot; -Bowie Ibarra, author, Down the Road\n\n&quot;Grabs you by the gut and doesn't let go until the final page.&quot; -Scott Baker, author, Rotter World\n\nAbout the Author\n\nCraig DiLouie is the author of the highly successful zombie novels The Killing Floor, The Infection, and Tooth and Nail, as well as The Great Planet Robbery, a science fiction novel, and Paranoia, a psychological thriller. He lives with his family in Calgary, Canada, and blogs regularly about horror media at CraigDiLouie.com.","torrent":{"xt":"urn:btih:df379a56720d9e2a509373c61f5ecd364f04ba60","amp;dn":"Suffer+the+Children+-+Craig+Dilouie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df379a56720d9e2a509373c61f5ecd364f04ba60","infoHashBuffer":{"type":"Buffer","data":[223,55,154,86,114,13,158,42,80,147,115,198,31,94,205,54,79,4,186,96]},"announce":[],"urlList":[]}}