{"title":"Jeeves and the Wedding Bells (2013) Sebastian Faulks (multi)","uid":9365319,"size":1438855,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e01c3ae2e3ae24954332706eff88effe4b2a4e09&amp;dn=Jeeves+and+the+Wedding+Bells+%282013%29+Sebastian+Faulks+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"7","files":-1,"time":1387400342,"description":"Jeeves and the Wedding Bells by Sebastian Faulks\n\n\nFormat: mobi/epub/azw3\nLength: 272 pages\nGenre: Historical/Humour\nDate: 7 November 2013\n\nA gloriously witty novel from Sebastian Faulks using P.G. Wodehouse's much-loved characters, Jeeves and Wooster, fully authorised by the Wodehouse estate.\n\nP.G. Wodehouse documented the lives of the inimitable Jeeves and Wooster for nearly sixty years, from their first appearance in 1915 (Extricating Young Gussie) to his final completed novel (Aunts Aren't Gentlemen) in 1974. These two were the finest creations of a novelist widely proclaimed to be the finest comic English writer by critics and fans alike.\n\nBertie Wooster, recently returned from a very pleasurable soujourn in Cannes, finds himself at the stately home of Sir Henry Hackwood in Dorset. Bertie is more than familiar with the country house set-up: he is a veteran of the cocktail hour and, thanks to Jeeves, his gentleman's personal gentleman, is never less than immaculately dressed.\n\nOn this occasion, however, it is Jeeves who is to be seen in the drawing room while Bertie finds himself below stairs - and he doesn't care for it at all.\n\nLove, as so often, is at the root of the confusion. Bertie, you see, has met Georgiana on the C?te d'Azur. And though she is clever and he has a reputation for foolish engagements, it looks as though this could be the real thing. However, Georgiana is the ward of Sir Henry Hackwood and, in order to maintain his beloved Melbury Hall, the impoverished Sir Henry has struck a deal that would see Georgiana becoming Mrs Rupert Venables.\n\nBut why would this necessitate Bertie having to pass himself off as a servant when he has never so much as made a cup of tea? Could it be that the ever-loyal, Spinoza-loving Jeeves has an ulterior motive?\n\nAuthor:\n\nSebastian Faulks was born in April 1953. Before becoming a full-time writer in 1991, he worked as a journalist. His French trilogy - The Girl at the Lion d'Or, Birdsong and Charlotte Gray (1989-1997) - established him in the front rank of British novelists. UK sales of Birdsong exceed 2,500,000 copies, and for this novel he was named &quot;Author of the Year&quot; by the British Book Awards in 1995. It is regularly voted one of the nation's favourite books. Charlotte Gray has also sold over a million copies and was filmed with Cate Blanchett in the main part. ","torrent":{"xt":"urn:btih:e01c3ae2e3ae24954332706eff88effe4b2a4e09","amp;dn":"Jeeves+and+the+Wedding+Bells+%282013%29+Sebastian+Faulks+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e01c3ae2e3ae24954332706eff88effe4b2a4e09","infoHashBuffer":{"type":"Buffer","data":[224,28,58,226,227,174,36,149,67,50,112,110,255,136,239,254,75,42,78,9]},"announce":[],"urlList":[]}}