{"title":"[AtrociousRips] Scooby Doo Meets The Boo Brothers (1987) (VHSRip","uid":9262989,"size":1541065866,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e034c9357d002edae2b28019470d382fb45912e1&amp;dn=%5BAtrociousRips%5D+Scooby+Doo+Meets+The+Boo+Brothers+%281987%29+%28VHSRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"popularboy9","files":1,"time":1385653153,"description":"This is a VHS Rip of Scooby Doo Meets the Boo Brothers from a 2000 tape. The movie originally aired in 1987 on one of those stupid Saturday Morning movie things that Hanna-Barbera would do.\n\n\nEnter a world of a bad plot, bad voice acting, random stupid characters, and a script with &quot;like&quot; all over the damn place! If you came here to see how bad Saturday Morning cartoons were in the late-80s, this VHS Rip shows a good example of one.\n\n\nRipped with a Dazzle * DVD Recorder HD.\n\n\nVideo Quality is A-. The quality is excellent for a compressed AVI despite one or two glitches, including one tape malfunction for about half a second approximately 56 minutes into the rip. The colors are not faded at all, and Warner Bros. did a marvelous job at restoring this piece of crap to digital (wait, this ain't digital if it's VHS!)\n\n\nAudio Quality is C. The quality is fair due to some audiable ground loop or buzzing in mainly the right channel of the rip. The voice acting of this film can also get on your nerves.\n\n\nThis VHS is copyright 1987 Hanna-Barbera Productions, and copyright 2000 Warner Home Video. \n\n\nPlease give AtrociousRips credit if you use our rip for reviews, and whatnot. It's unlikely, but if a review does happen with our VHS rip then please give us credit.","torrent":{"xt":"urn:btih:e034c9357d002edae2b28019470d382fb45912e1","amp;dn":"%5BAtrociousRips%5D+Scooby+Doo+Meets+The+Boo+Brothers+%281987%29+%28VHSRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e034c9357d002edae2b28019470d382fb45912e1","infoHashBuffer":{"type":"Buffer","data":[224,52,201,53,125,0,46,218,226,178,128,25,71,13,56,47,180,89,18,225]},"announce":[],"urlList":[]}}