{"title":"Stossel.2014.05.29.[Food Fight].Fox Business.CF.avi","uid":10272828,"size":343388844,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e288b6d42fcf75b9eb1eee981082ccda68b0b26d&amp;dn=Stossel.2014.05.29.%5BFood+Fight%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"skJGZV6z","files":-1,"time":1401612727,"description":"----------\n\nSTOSSEL - [Food Fight] - Fox Business Network\n2014, May 29, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\n\nGMO FOOD: 90% of all corn grown in America is genetically modified - it grew from a seed that scientists altered. Michael Hansen of Consumers Union says this puts people in danger. Jon Entine of the Genetic Literacy Project says opposition to GMOs is just scaremongering.\n\nFED UP WITH THE FOOD POLICE: Katie Couric's new movie Fed Up claims &quot;95% of America will be overweight or obese in two decades.&quot; What?! Couric and the filmmakers won't return our call to explain that and other dubious claims in her new movie.\n\nORGANIC FOODS: Liz Reitzig of Nourishing Liberty is upset about all the chemicals in food. She says we should only buy organic.\n\nSATURATED FAT: All my life I avoided butter and bacon because I knew they contained too much saturated fat. Today, new research suggests we were misled. &quot;The Big Fat Surprise&quot; author Nina Teicholz explains.\n\nDON'T EAT ANYTHING WITH A FACE: Vegans avoid anything that comes from an animal. &quot;Eco Vegan Gal&quot; Whitney Lauritsen says &quot;eating meat is unnecessary given all of the nutrients&quot; in plants. But &quot;The Paleo Solution&quot; author Robb Wolf argues that meat is healthy.\n\nFOOD FREEDOM: Michelle Obama explained that even if kids don't want to eat so-called healthy food, America will give it to them anyway. &quot;Keep Food Legal&quot; founder Baylen Linnekin says it is not government's job to protect public health because &quot;food freedom&quot; is a basic right.\n\nEAT GLOBALLY: The latest food fad: &quot;eat local.&quot; But Pierre Desrochers of the University of Toronto says we need to help the planet and eat globally.\n\nMY TAKE: Government peddles myths about obesity. Politicians claim kids from poor neighborhoods get fat because there's little healthy food near their homes. They and Michelle Obama call poor neighborhoods &quot;food deserts.&quot; But then, oops, research showed that there's more access to supermarkets in poor neighborhoods.\n\nMy non-profit, Stossel in the Classroom, ran an essay contest this year inviting students to write on &quot;Food Nannies: Who Decides What You Eat?&quot; Since I was so depressed after I learned we have to pay for Michelle Obama's food schemes, I decided to cheer myself up by talking to first and second place winners Madeline Peltzer and Caroline Clauson. The high school kids say even if government advice and mandates make us healthier (doubtful), they are still wrong because they impinge on freedom.\n\n9PM ET on Fox Business Network","torrent":{"xt":"urn:btih:e288b6d42fcf75b9eb1eee981082ccda68b0b26d","amp;dn":"Stossel.2014.05.29.%5BFood+Fight%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e288b6d42fcf75b9eb1eee981082ccda68b0b26d","infoHashBuffer":{"type":"Buffer","data":[226,136,182,212,47,207,117,185,235,30,238,152,16,130,204,218,104,176,178,109]},"announce":[],"urlList":[]}}