{"title":"Little Village - Little Village [1992][EAC.Log,Cue.FLAC]","uid":9329050,"size":325886359,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e2ddf1d01be7b781e1d008ec645c31495175f659&amp;dn=Little+Village+-+Little+Village+%5B1992%5D%5BEAC.Log%2CCue.FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dickspic","files":14,"time":1386695461,"description":"Artist: Little Village\nRelease: Little Village\nReleased: 1992\nLabel: Reprise\nCatalog#:26713\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: americana\n\nimage\n\n\n01 - Solar Sex Panel\n02 - The Action\n03 - Inside Job\n04 - Big Love\n05 - Take Another Look\n06 - Do You Want My Job\n07 - Don't Go Away Mad\n08 - Fool Who Knows\n09 - She Runs Hot\n10 - Don't Think About Her When You're Trying To Drive\n11 - Don't Bug Me When I'm Working\n\n\n\n\nSometimes you just can't get lightning to strike in the same place twice, no matter how hard you try, and the sole album from Little Village serves as proof. In 1987, guitarist Ry Cooder, bassist Nick Lowe, and drummer Jim Keltner backed up singer and songwriter John Hiatt on his album Bring the Family; the album was hailed as an instant classic, but negotiations to reassemble the group for Hiatt's next album failed. Five years later, the four musicians were persuaded to give working together another try, but this time instead of backing Hiatt, they'd form a band called Little Village, with all the members writing collectively and Hiatt, Cooder, and Lowe trading off on vocals. The idea certainly sounded promising, and there's no denying that these guys play together brilliantly; Little Village rocks harder than Bring the Family, with Keltner and Lowe generating a bucketful of groove, and Cooder chiming in with a man-sized portion of his trademark funky guitar. But while the songs on Bring the Family were powerful, personal, and often deeply moving, here the band sounds like they're just looking to make a good-time party album, and while it is indeed a good time, the results just aren't as satisfying; bald spots and bad driving may be funny, but love and family are the kind of stuff that sticks with you. Also, while Little Village was supposed to be a democracy, it's significant that John Hiatt ended up with the lion's share of the vocals, and most of the songs sound like, well, like John Hiatt songs, which is by no means a bad thing, but with writers and vocalists of the caliber of Nick Lowe and Ry Cooder on board, it's a shame we don't hear more from them. After one album and one tour, Little Village called it a day, and while the album shows they knew how to work together, the finished product is just good fun, rather than the second instant classic they were shooting for..","torrent":{"xt":"urn:btih:e2ddf1d01be7b781e1d008ec645c31495175f659","amp;dn":"Little+Village+-+Little+Village+%5B1992%5D%5BEAC.Log%2CCue.FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2ddf1d01be7b781e1d008ec645c31495175f659","infoHashBuffer":{"type":"Buffer","data":[226,221,241,208,27,231,183,129,225,208,8,236,100,92,49,73,81,117,246,89]},"announce":[],"urlList":[]}}