{"title":"Mannheim Steamroller - Christmas in the Aire 320cbr (Big Papi) 1","uid":9363565,"size":105539426,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e3192a316455814f830f5bff87b180fe4578e30e&amp;dn=Mannheim+Steamroller+-+Christmas+in+the+Aire+320cbr+%28Big+Papi%29+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1387375735,"description":"Source: 1995 CD\n\n\nBy Bellagio\nOne of the most difficult things imaginable is coming up with Christmas music which is, even in the slightest way, unique. We've all heard Nat King Cole's gorgeous, silken voice on the old standards, and, Lord Help Us, how many of Bing's croonings can you take? Over the years, Mannheim Steamroller has produced three fine albums, mixing up the standards (some in synthesized and modernized form) with other ancient pieces that had long ago fallen off the play list. This latest studio Christmas album could well be the best of the group.\nMany have criticized it as being too formulaic, or simply as being too like the previous efforts. Maybe so. The others are awfully good as well. You know, I hate to break this to the critics but since Bach's Christmas Oratorio and Correlli's concertos in the 18th century, and Mendelsohn and Tchaikovsky in the 19th, there hasn't been a whole lot of good ground-breaking Christmas music written. If you're looking for new thing, Christmas isn't exactly the best place to start.\n\nThat said, this particular CD is chock-full of wonderful Christmas melodies, some of which you probably haven't heard before, produced and presented to meet Manneheim Steamroller's extremely high standards. Standout tracks include: Mendelsohn's &quot;Joy To The World&quot; -- in a version as rambunctuous as anything you could get from Arthur Fiedler; &quot;Pat A Pan&quot; -- a wonderfully simple melody, like fudge it is Christmas perfection. You will wonder why it isn't more famous than it is; &quot;Gagliarda&quot;, with it's evocations of a medieval feast in the long room of a great castle; and &quot;Los Peces El Rio&quot;, Spanish mystery and flair, rarely heard far north of Mexico.\n\nnull Maybe, being the third such Christmas CD from the group, it isn't a completely unique or new experience. I have yet to have someone show me anyone else that is producing great Christmas music which incorporates new sounds while retaining tradition, which is the very nature of the holiday.","torrent":{"xt":"urn:btih:e3192a316455814f830f5bff87b180fe4578e30e","amp;dn":"Mannheim+Steamroller+-+Christmas+in+the+Aire+320cbr+%28Big+Papi%29+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3192a316455814f830f5bff87b180fe4578e30e","infoHashBuffer":{"type":"Buffer","data":[227,25,42,49,100,85,129,79,131,15,91,255,135,177,128,254,69,120,227,14]},"announce":[],"urlList":[]}}