{"title":"Moyna (1978) Bengali - Xvid 2cd - No Subs [DDR]","uid":9360523,"size":1317717827,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e523c26d88334a1241f7091575903fbfd18cf6d5&amp;dn=Moyna+%281978%29+Bengali+-+Xvid+2cd+-+No+Subs+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":-1,"time":1387307052,"description":"Moyna (1978) Bengali - Xvid 2cd - No Subs [DDR]\n\nCast: Ranjit Mullik, Suman Mukherjee, Utpal Dutt, Asit Baran, Dilip Ray, Padma Devi, Subrata Chatterjee, Molina Devi, Arati Bhattacharya\n\nDirector: Ashim Banerjee\nMusic Director: Anupam Mukherjee\nMusic by Anupam Mukhopadhyay, Sachin Ganguli, Anupam Mukhopadhyay, Sachin Gangopadhyay, Anupam Mukherjee, Sachin Ganguly, Anupam Mukherjee \n\nSongs are included in MP3s\nMoyna 1978 Bengali 00. Title Music and Screen Credits, Anupam Mukherjee\nMoyna 1978 Bengali 01. Tentul Gachhe Phalechhe, Arati Mukhopadhyay, Hashi Mukhopadhyay, Mazumder, Mukherjee\nMoyna 1978 Bengali 02. Riniki Jhiniki Bole 1, Arati Mukhopadhyay, Satyen Gangopadhyay, Anupam Mukherjee\nMoyna 1978 Bengali 03. Jadi Naiba Thaki, Arati Mukherjee, Gauriprasanna Mazumder, Anupam Mukherjee\nMoyna 1978 Bengali 04. Haal Fashion-Er Babu, Tarun Banerjee, Satyen Ganguly, Anupam Mukherjee\nMoyna 1978 Bengali 05. Short Song Unknown-2\nMoyna 1978 Bengali 06. Shamla Gaanyer Kajla Meye, Hemanta Mukherjee, Arati Mukherjee, Satyen Ganguly, Anupam Mukherjee\nMoyna 1978 Bengali 07. Nayan Salile, Arati Mukhopadhyay, Satyen Gangopadhyay, Anupam Mukherjee\n\nMoyna 1978 Bengali 08. Riniki Jhiniki Bole 2, Manabendra Mukhopadhyay, Arati Mukhopadhyay, Satyen Gangopadhyay, Anupam Mukherjee\nMoyna 1978 Bengali 09. END SONG\n\nSYNOPSIS:- Moyna (1978)\nRaj Narayan was a zamindar. He loved two things - playing with the lathi and spending nights with women. On the occasion of his daughter's rice ceremony his mentor came to his house. He advised Raj's wife Ratna to go and pray to Maa Kali at Gouripur. One day when Raj was going to the temple with his wife and daughter. But suddenly the boat sank. The villagers of Palashpur rescued Raj. Raj became insane. Ratna recovered in hospital. Their daughter Ankhi was rescued by a fisherman and his wife. They named the girl Maina. She loved a rich man's son Sagar. But Sagar's father Babul did not agree to acknowledge their affair. He insulted Paran. Maina fled with Sagar with the help of Anjana. Pappu attacked Sagar, Raj rescued them. At that time Ratna got the advice through a dream and decided to go to Gauripur. On the way she met Raj. A pendant proved that Maina was Raj's daughter. \nMaina finally married Sagar and Raj returned home.\n\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 786 kbps\nVideo Resolution: 352x272\nVideo Aspect Ratio: 1.294:1\nFrames Per Second: 25.000\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 224kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: Bengali\nRunTime: 1:57:47\nSubtitles: NONE\nRipped by: Trinidad [DDR]   \nDuration: 1:57:47","torrent":{"xt":"urn:btih:e523c26d88334a1241f7091575903fbfd18cf6d5","amp;dn":"Moyna+%281978%29+Bengali+-+Xvid+2cd+-+No+Subs+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e523c26d88334a1241f7091575903fbfd18cf6d5","infoHashBuffer":{"type":"Buffer","data":[229,35,194,109,136,51,74,18,65,247,9,21,117,144,63,191,209,140,246,213]},"announce":[],"urlList":[]}}