{"title":"Call Center Girl 2013 CamRip [buhaypirata]","uid":9365593,"size":1091907747,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e5624b69c9a238abefd3fb51102f818bcdb44bbf&amp;dn=Call+Center+Girl+2013+CamRip+%5Bbuhaypirata%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"back2basic31","files":-1,"time":1387405966,"description":"                               Call Center Girl 2013\n\n         --------------------------------------------------------------\n                          For More Pinoy Movies and Music\n                              &lt;a href=&quot; http://buhaypirata.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://buhaypirata.net/&lt;/a&gt;\n         --------------------------------------------------------------\nCALL CENTER GIRL, directed by Don Cuaresma and topbilled by Pokwang, is funny in spots and heartwarming in others. Mainly it coasts along on the sheer charm of its lead star (whose star somewhat dimmed for a while or so). Early on, Pokwang (a mother of three and wife to Jestoni Alarcon, who had to work abroad to augment the family income) rues that her &quot;absenteeism&quot; has caused a rift between her and the youngest, Jessy Mendiola, a rift that will simmer and boil until things explode. Alarcon's untimely demise sets things in motion as Pokwang (Terry) tries to redeem her standing with her daughter. Pokwang's infectious charm and brand of humor propel the movie forward and many of the scenes are outright funny (the other costarring comics mostly play it straight, or with deadpan faces while delivering zingers). As Pokwang jockeys herself into her daughter's workplace (specifically, an underperforming BPO team led by an ornery Enchong Dee), one can simply predict the rest of the movie. (One can even sense that the cat-and-mouse bickering between Mendiola and Dee will end in a tentative romance). Dee's demoralized call center team gets a boost (in more ways than one) when Pokwang turns everything upside down. A beach outing will define the dynamics between Pokwang and her resentful daughter, and between Pokwang and Dee (who has issues with his mother, who abandoned him early on). Curiously, Dee actually nailed the job that Mendiola covets dearly. Whether in the gags galore (and there are plenty!) or in the weepy parts, Pokwang is always spot-on, especially with her feeble initial attempts at call-center accents and diction. Pokwang may remind veteran viewers of a comedienne in the 1950s, Menggay, who had exactly the same roles Pokwang has landed. Endearing yet comical at the same time, Alarcon's character has been cremated and Pokwang lugs around the urn containing his ashes even at the beach outing. Alarcon's brief scenes, early in the movie, shows his gift for comedy. The largely veteran cast compensate for the inadequacies of Jessy Mendiola as an actress; the seemingly sportsmanlike attempt of Enchong Dee to pay court to a girl with a &quot;harana&quot; (serenade) may amuse some but annoy others. His singing voice won't win competitions (why do the three TV networks force many of its young hunks (and lasses) to sing?). Don Cuaresma (mainly noted as a director of TV soaps, although in 2006 he megged a John Lloyd Cruz-Bea Alonzo-Anne Curtis movie, ALL ABOUT LOVE) stages most of the scenes neatly, the jokes hit their mark, and this comedy is literally overflowing with talent (who have little screen time, but appreciated by this critic): Ogie Diaz (as Pokwang's nagging brother), K Brosas and John Lapus as Pokwang (and Mendiola's) workmates at the BPO, and Chokoleit (as a job-hirer who takes pity on Pokwang), Pooh, Rufa Mi and Jason Gainza in very brief roles. Arron Villaflor and Dianne Medina play the two other children, while Ejay Falcon plays a secretly married lout (who wants to swindle Mendiola out of her well-earned dollars) and Alex Castro plays a handsome, seemingly manly workmate whose sexuality may be in question (several times, he bumps into Enchong Dee intimately). Cameos by Camille Prats, Thou Reyes and Janice de Belen (as Enchong's mom) make the film even busier than it is, wittily written by Enrico Santos, Kriz G. Gazmen and Hyro Aguinaldo. Pokwang's solo movie, A MOTHER'S STORY, was a box-office failure (and must have hurt her deeeply). I hope CALL CENTER GIRL fares better: Pokwang and her antics are worth anyone's time (and movie ticket), and she deserves just a little more time as a bona fide movie star\n\n\n                                      \n                                       Cast\n\n                                      Pokwang\n                                    Enchong Dee\n                                   Jessy Mendiola\n                                     John Lapus\n                                    Ejay Falcon\n                                      K Brosas\n                                      Chokoleit\n\n\n                                      General\n\n\n                      Title: ............................Call Center Girl\n     IMDb Link : ....................... http://www.imdb.com/title/tt3361152/\n                      Genre : ........................... Comedy\n                  Released Date : ............27 November 2013\n                    Country : ......................... Philippines\n                      Ripper : .......................... PRiNCE'DJ\n\n                                       Video\n\n                                 Codec: H.264/AVC\n                                    Format: MKV\n                                   Size: 1.01 GB\n                                 Bitrate: 1200 KBPS\n                               Resolution: 640 x 480\n                                 Duration: 01:43:57\n                            Frame Rate: 25 frames/second\n\n\n                                       Audio\n\n                                     Codec: MP3\n                                 Bitrate: 192 KBPS\n                                Frequency: 44100 HZ\n                                  Language: Tagalog\n                                Subtitle: No Subtitle\n\n                                     Screenshot\n\n                      &lt;a href=&quot; http://imageshack.us/a/img34/4930/bo60.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://imageshack.us/a/img34/4930/bo60.jpg&lt;/a&gt;\n\n                                      Website\n                             &lt;a href=&quot; http://buhaypirata.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://buhaypirata.net/&lt;/a&gt;\t\t","torrent":{"xt":"urn:btih:e5624b69c9a238abefd3fb51102f818bcdb44bbf","amp;dn":"Call+Center+Girl+2013+CamRip+%5Bbuhaypirata%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5624b69c9a238abefd3fb51102f818bcdb44bbf","infoHashBuffer":{"type":"Buffer","data":[229,98,75,105,201,162,56,171,239,211,251,81,16,47,129,139,205,180,75,191]},"announce":[],"urlList":[]}}