{"title":"The Legend of Dragoon [Ntsc] [Psx] Psone","uid":9327902,"size":2368339344,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:e62826f55f4d2233bb0388aea2dc7468f04a2765&amp;dn=The+Legend+of+Dragoon+%5BNtsc%5D+%5BPsx%5D+Psone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sonywo","files":-1,"time":1386676221,"description":"\n\nThe Legend of Dragoon is a role-playing video game developed and published by Sony Computer Entertainment for the PlayStation. It was released in Japan on December 2, 1999, in North America on June 11, 2000, and on January 19, 2001 in Europe.\n\nDespite mixed critical reception, the game has amassed a very large fanbase following, including several online petitions for a remake or prequel/sequel. The game was rereleased on PlayStation Network in May 2012.\n\nThe Legend of Dragoon features three modes of play: the field map, a battle mode, and an overworld map. The field map is used whenever the player enters a town, dungeon, or landmark. It consists of a pre-rendered background image overlayed with real-time 3D character models and animated effects, such as the movement of water or light shafts. Battle mode is a real-time 3D environment that resembles the current field map. Turn-based battles occur between playable characters and CPU-controlled enemies. Standard actions such as attack, defend, item and escape are present. The world map is used when the player moves between towns or other geographical locations. The World Map doesn't allow for free movement, and instead the player follows a guided path between destinations. ","torrent":{"xt":"urn:btih:e62826f55f4d2233bb0388aea2dc7468f04a2765","amp;dn":"The+Legend+of+Dragoon+%5BNtsc%5D+%5BPsx%5D+Psone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e62826f55f4d2233bb0388aea2dc7468f04a2765","infoHashBuffer":{"type":"Buffer","data":[230,40,38,245,95,77,34,51,187,3,136,174,162,220,116,104,240,74,39,101]},"announce":[],"urlList":[]}}