{"title":"Afterlives of The Rich and Famous - Sylvia Browne.epub","uid":9345001,"size":2565816,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e6d7b6b58b29cf94eff4e325f4e265c7b641c954&amp;dn=Afterlives+of+The+Rich+and+Famous+-+Sylvia+Browne.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1387020099,"description":"In AFTERLIVES OF THE RICH AND FAMOUS, renowned psychic Sylvia Browne explains exactly what happens to our spirits when our bodies stop living. She describes what the Other Side is like, and how the celebrities that we have lost are coping in the world beyond. She begins with a brief biography of each celebrity, which helps lend important context to what is happening to them now in the afterlife. She then shares whatever information the celebrities care to discuss with her. Her insights include their regrets, their private thoughts, their role in the afterlife, details of who they visit on earth, and their plans for reincarnation if they have any. It is also fascinating to discover which celebrities strike up friendships and spend time together on the Other Side!\n\nCelebrities featured include: Elvis Presley, (Princess) Diana Spencer, Patrick Swayze, Anna Nicole Smith, Brittany Murphy, Heath Ledger, Marilyn Monroe, Paul Newman, Clark Gable, Cary Grant, George Harrison, Michael Jackson and John Lennon.","torrent":{"xt":"urn:btih:e6d7b6b58b29cf94eff4e325f4e265c7b641c954","amp;dn":"Afterlives+of+The+Rich+and+Famous+-+Sylvia+Browne.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6d7b6b58b29cf94eff4e325f4e265c7b641c954","infoHashBuffer":{"type":"Buffer","data":[230,215,182,181,139,41,207,148,239,244,227,37,244,226,101,199,182,65,201,84]},"announce":[],"urlList":[]}}