{"title":"GnernAnal.StreetMeatAsia.com.mp4","uid":9370273,"size":746662870,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e76f60879cad67bf8751c08c224d1effd2703743&amp;dn=GnernAnal.StreetMeatAsia.com.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sarah.jensen","files":-1,"time":1387509666,"description":"Chained to the bathroom cabinet, naked, legs splayed out, with a mouthful of sperm, Ngern is quite accepting of her situation. She works at the precious metal exchange, she is the tea lady. All the high flying gold and silver traders shout orders down the phone and throw bits of paper at each other. Deals go on and prices fluctuate. Ngern is quite in awe of all the traders, and does not really know what the fuck they are doing, except that they are on a higher level that she is. Ngerns serves tea, coffee and biscuits. She also serves up an easy blow job, or a fuck across the trading room desk, whenever any of the high fliers feels like a quicky. She will do anything for anyone she feels is on a higher level than herself. She actually gets used relatively infrequently, the traders all have their own hi society stuck up girlfriends and hookers that often come round and get fucked in the VIP rooms and the lift. But, in recognition of her devoted service to the exchange, she was awarded a pair of silver leggings, to make her look and feel good. The horrible truth is that Ngern is even more stuck up than anyone else at the exchange. Easy though she maybe for any trader, anyone else that she feels is on the same level as herself does not get a look in. If you meet her and cannot convince her that you are amongst the worlds wheeler dealer elite, she won't want to know. I am not totally sure she believed me when I told her that I was a film star, something in my confident manner, but if fucking worked. As soon as it dawned on her that I might be slightly superior, she became quite subservient. A bloody good fuck, beautiful chunky little figure with firm wide titties. She took my cock straight down her throat. I fucked her in the toilet, she seemed quite at home. I fucked her asshole, her chubby tits bobbing, and her head swaying, with her thick black hair matted with sweat. She seemed quite at ease with my bell end up her rectum, her sphincter gliding up and down the shaft of my cock. Knowing her position in society, from her own point of view, Ngern was totally accepting of her condition. Chained to the bathroom cabinet, my sperm dripping out of her mouth onto her chin, and dripping out of her anus onto the ceramic floor sticking to her buttocks, the thought going through Ngerns mind was, how do I serve tea now with my hands chained up? To get the most out of this video, watch it between billion dollar trades and flicking bits of paper. ","torrent":{"xt":"urn:btih:e76f60879cad67bf8751c08c224d1effd2703743","amp;dn":"GnernAnal.StreetMeatAsia.com.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e76f60879cad67bf8751c08c224d1effd2703743","infoHashBuffer":{"type":"Buffer","data":[231,111,96,135,156,173,103,191,135,81,192,140,34,77,30,255,210,112,55,67]},"announce":[],"urlList":[]}}