{"title":"The Jimi Hendrix Experience - Crosstown Traffic [promo].VOB","uid":9340058,"size":163149824,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e7e38419e1d319b0a56626112ed21579c985ffed&amp;dn=The+Jimi+Hendrix+Experience+-+Crosstown+Traffic+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1386913371,"description":"The Jimi Hendrix Experience - Crosstown Traffic [promo].VOB\n\n\nHQ rare promo music video from a promo DVD. &quot;Crosstown Traffic&quot; is a song written by Jimi Hendrix. It was the second single released from the album Electric Ladyland by The Jimi Hendrix Experience. It peaked at #52 on the Billboard Hot 100, and at #37 on the pop singles chart in the United Kingdom.\n\nUnlike many of the tracks on the album, this recording features the full line-up of the Experience with Hendrix, Noel Redding, and Mitch Mitchell. Hendrix also plays a makeshift kazoo made with a comb and tissue paper in tandem at points with his lead guitar, and backing vocals are performed by Redding along with Dave Mason.\n\nCover versions of the song are numerous, having been recorded by Gil Evans, Charlie Daniels, Hed P.E. the Red Hot Chili Peppers, Living Colour, the Ariya Astrobeat Arkestra and played in concert by countless others. In 1991, it was recorded by Emily Symons and the Channel 7 Australia ensemble Farmhouse.\n \nThe Jimi Hendrix Experience was an English-American rock band that formed in Westminster, London, in October 1966. Composed of singer, songwriter, and guitarist Jimi Hendrix, bassist and backing vocalist Noel Redding, and drummer Mitch Mitchell, the band was active until June 1969. During this time they released three successful studio albums. After Redding left the band in mid-1969, Hendrix and Mitchell continued to work together on other projects. The Experience reunited in 1970, with Billy Cox on bass, until Hendrix's death in September. Redding died in 2003, and Mitchell died in November 2008.\n\nWidely recognized as hugely influential in the development of the hard rock and heavy metal music genres during the late-1960s and beyond, the Experience was best known for the skill, style and charisma of their frontman, Hendrix, who has since been called one of the greatest guitarists of all time by various music publications and writers. All three of the band's studio albums, Are You Experienced (1967), Axis: Bold as Love (1967) and Electric Ladyland (1968), were featured in the top 100 of the Rolling Stone list of The 500 Greatest Albums of All Time, at positions 15, 82 and 54 respectively. In 1992, the Jimi Hendrix Experience was inducted into the Rock and Roll Hall of Fame.\n(video has a 5 semi-transparent blue dots at the bottom right)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Crosstown_Traffic_(song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Crosstown_Traffic_(song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/KAENHAaFd&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/KAENHAaFd&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x576 (4:3) 25fps 8000kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD LPCM, 16 bit]\n   Duration: 00:02:20\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.1\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:e7e38419e1d319b0a56626112ed21579c985ffed","amp;dn":"The+Jimi+Hendrix+Experience+-+Crosstown+Traffic+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7e38419e1d319b0a56626112ed21579c985ffed","infoHashBuffer":{"type":"Buffer","data":[231,227,132,25,225,211,25,176,165,102,38,17,46,210,21,121,201,133,255,237]},"announce":[],"urlList":[]}}