{"title":"Imam Anwar al-Alwiki Lectures on Islam","uid":9308013,"size":4216945321,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e88ad30662abf57215c08c8d42b0f321a5c1c942&amp;dn=Imam+Anwar+al-Alwiki+Lectures+on+Islam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Bamboo_Delight","files":2,"time":1386352958,"description":"I had to reseed this because the other location was messed up.\n\nImam Anwar al-Alwiki Lectures on Islam\n\nImam Anwar al Alwiki was blown up into tiny little pieces by a CIA drone because he was \na Muslim jihad murdering maniac who was preaching &quot;holy war&quot; against European and \nAmerican people. (Hooray for the CIA!) But in every way, he was an ordinary, everyday \nMuslim who smiles in your face while planning your murder. As a Muslim preacher and Imam, \nhe traveled around teaching Muslims why they should be good Muslims and kill everybody \nthey meet and steal everything they can get their hands on and rape all the women. He recorded \nhis lectures in English for English-speaking Muslims so that they can go crazy in the \nEnglish-speaking world, too, like all good Muslim should. Imam Alwiki taught Muslims \nhow to be good Muslims. But the CIA proved that there is a wonderful way of making good \nMuslims even better.\n\nFortunately, for the free people of the world, this murdering Muslim pig left a series of English \nlanguage lectures telling the world just how bizarre, demented and evil Islam really is. As a \nMuslim cleric, Alwiki had delved into the fables and lies of Muslim literature to tell us all how \nwonderful Muslim lies really are. But his delusion about what Islam really is, does not prevent \nthe un-biased listener from understanding that this really is the case -- all Muslims are servants\nof devils. \n\nChristians, Hindus, Buddhists and all religious people should listen to the inside\ninformation about Islam that Alwiki teaches. As Mohammad taught &quot;War is deceit.&quot; So, in\nthe perpetual Jihad (&quot;Holy War&quot;) that Islam is waging against the entire world, when a Muslim\ntells you that &quot;Islam is the religion of peace&quot;, in fact, he is lying and trying to deceive you.\n\nIslam is a demonic religion of lies, murder, thievery and slavery. It makes big promises about \nwhat a Muslim will get in Paradise -- mansions of gold, green gardens full of delicious fruit each \nas big as a house, 72 virgins to screw for eternity, etc. But in exchange for these incredible \npromises, the Muslim must murder the people of the world, steal everything he can get his \nhands on, rape the women of the world, enslave the people of the world, and burn down \neverything. That's what makes a good Muslim and that's how a Muslim proves to his demon \ngod Allah that he is worthy to enter paradise just like the voices in Mohammad's head promised.\n\nThese lectures were not given all sugar-coated to a non-Muslim audience so as to deceive them \ninto accepting Islam. These lectures were given to English-speaking Muslim audiences in London \nand Los Angeles, teaching them the history of Islam and the finer points of killing people and \nsubverting nations through perpetual Jihad. Once you listen to these lectures, you will know \neverything and every secret about Islam. They were not meant for the non-Muslim; they were \nmeant for the average thieving and murdering Muslim, just like the ones living near to you \nright now.\n\nThese lectures are many hours and so are divided into 12 parts: \n\n1.The Life of Mohammad Part 1 (16 Lectures)\n2.The Life of Mohammad Part 2 (18 Lectures)\n3.Abu Bakr (15 Lectures)\n4.Companions Of The Ditch (6 Lectures)\n5.Lives of the Prophets (64 Lectures)\n6.Umar Ibn al-Khattab (18 Lectures)\n7.Stories from Hadeeths (4 Lectures)\n8.Jihad (11 Lectures)\n9.The Constants of Jihad (6 Lectures)\n10.The Hereafter Part 1 (9 Lectures)\n11.The Hereafter Part 2 (12 Lectures)\n12.Allah is Preparing Us for Victory (2 Lectures)\n\nAfter listening to these lectures, you will understand that (1) Europe, the USA, Australia and \nall countries of European descent are under assault and (2) what we have been told by the \nJews in the Media about Islam is nothing but lies. The Jews claim to fight against Islam today, \nbut historically the Jews have always been allies of the Muslims because both are opposed to \nChristianity and both believe that they cannot win world domination unless Christianity and \nEuropean, Western Civilization is destroyed. Both strive for genocide of the white, Western \npeoples.\n\nAs you will come to understand by listening to these lectures, the only difference between a \nmoderate Muslim and a fanatical Muslim is that the fanatical Muslim wants to kill you today \nwhile the moderate Muslim is patiently waiting until tomorrow to kill you.\n\nLearn the facts about Islam straight from the camel's mouth. Alwiki was a deluded maniac \njust as all Muslims are deluded by the lies of Mohammad (mhrh).\n","torrent":{"xt":"urn:btih:e88ad30662abf57215c08c8d42b0f321a5c1c942","amp;dn":"Imam+Anwar+al-Alwiki+Lectures+on+Islam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e88ad30662abf57215c08c8d42b0f321a5c1c942","infoHashBuffer":{"type":"Buffer","data":[232,138,211,6,98,171,245,114,21,192,140,141,66,176,243,33,165,193,201,66]},"announce":[],"urlList":[]}}