{"title":"The Dowry Bride - Shobhan Bantwal.epub","uid":9368511,"size":696041,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e8d12cd24e87d0bb23b2b6b59d19b5cf37e7828c&amp;dn=The+Dowry+Bride+-+Shobhan+Bantwal.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1387478248,"description":"One sultry night, a young bride overhears an extraordinary conversation. The voices speak of a plot to murder a wife who has failed to produce a child and whose family has failed to produce the promised dowry...\n\nMegha is sick with horror when she realizes she is the intended victim. Her husband -- the very man who tied the sacred necklace of marriage around her neck -- and his mother are plotting to kill her! In the moment of panic, she runs for her life. Frantically racing through Palgaum's deserted streets, her way lit only by the lights strung up for the Diwali festival, her single goal is to escape death by fire. But fleeing from her would-be-killers seems impossible -- unless she can find someone to help her...\n\nTo approach her best friend would bring scandal to an innocent woman's doorstep, and turning to her own strict, conservative family is out of the question. Instead, with nothing but the sari she wears and a memory of kindness, Megha finds her way to Kiran, the one man who has shown her friendship and respect. Hiding her in his apartment, Kiran becomes her protector. But the forbidden attraction that grows between them can only bring more danger...\n\nCaught between tradition and the truths buried in her heart, a dowry bride will discover the real cost of the only things worth having in life...","torrent":{"xt":"urn:btih:e8d12cd24e87d0bb23b2b6b59d19b5cf37e7828c","amp;dn":"The+Dowry+Bride+-+Shobhan+Bantwal.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8d12cd24e87d0bb23b2b6b59d19b5cf37e7828c","infoHashBuffer":{"type":"Buffer","data":[232,209,44,210,78,135,208,187,35,178,182,181,157,25,181,207,55,231,130,140]},"announce":[],"urlList":[]}}