{"title":"Le Plus Grand Cabaret du Monde - The Best of 2013","uid":9427681,"size":30231826460,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:e9bd855be28b5146dc4ace3b96544828efbc6d64&amp;dn=Le+Plus+Grand+Cabaret+du+Monde+-+The+Best+of+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LotosYar","files":-1,"time":1388741121,"description":"This is the best show on TV and one of the longest. It is sort of like a circus, with a series of acts, magicians, illusionists, jugglers, acrobats, dance comedy, most mostly weird and unique things you can't categorise. Every week they come up with perhaps a hundred performers I have never seen before. I have no idea where they find them all or what these performers do when they are not on the show. I have never thing anything like these acts anywhere else.\nThe camera lovingly studies each of the perfect bodies of the performers, who love to strut, so it is also quite sexy. So many times I just want to stand up and cheer the acts are so astounding or original or baffling.The show nearly always ends with a rousing song/dance and everyone in the audience joins in. This guaranteed will put a smile on your face.\n\n\nBlu-ray disc (custom) contains: \n01. Les Devils 02. Felipe Mejias 03. Diana Vedyashkina 04. Bernard Bilis 05. Darcy Oake 06. Les Devils 07. Eike von Stuckenbrok 08. Dani Lary 09. Copa Rio 10. Felix 11. Sept doigts de la main 12. Bernard Bilis 13. Los Vivancos 14. Enzo Weyne 15. Sasha Batuev 16. Dani Lary 17. Peter Marvey 18. Dan Sperry 19. Alan Sulc 20. Oksana Pylypchuk 21. Leonid Beliakov 22. Dani Lary 23. Duo Wang Yang 24. Strahlemann &amp; Sohne 25. Marko Karvo 26. Eric Borner 27. Reuben Moreland 28. Les etoiles du cirque de Pekin 29. Michael Trautman 30. Les etoiles du cirque de Pekin 31. Mickael Ross 32. Jerome Murat 33. Mihail Ermakov 34. Natalia Tolstikova 35. James Mor 36. Hans Klok 37. Trio Sunrise 38. Alexander Shtifanov 39. Very Bad Team 40. David Burlet 41. Guilhem Julia 42. Dani Lary 43. Illuminate 44. Sos &amp; Victoria 45. La troupe Grechuskhin 46. Umbilical Brothers 47. Bernard Bilis 48. Huang Zheng 49. Dani Lary 50. Saltare 51. Anelya 52. Les etoiles du cirque de Pekin 53. Mr &amp; Mrs G 54. Kirill Rebkovets 55. Gaetano Triggiano 56. Marco Zoppi 57. Dani Lary 58. Sophie Edelstein 59. Les Etoiles du cirque de Pekin 60. Neil Croswell 61. Daylis &amp; Daramis 62. Housh Ma Housh 63. Txema 64. Huang Zhu Lin 65. Richard Forget 66. Les Etoiles du cirque de Pekin 67. Les Etoiles du cirque de Pekin 68. Les Etoiles du cirque de Pekin 69. African Queens 70. Patrick Sebastien\n\nduration: 06:04:44 \nVideo: H.264, 1920x1080, 25.000 fps, 10200 Kbps\nAudio: AC3, 2.0 ch, 48000 Hz, 384 Kbps\t","torrent":{"xt":"urn:btih:e9bd855be28b5146dc4ace3b96544828efbc6d64","amp;dn":"Le+Plus+Grand+Cabaret+du+Monde+-+The+Best+of+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9bd855be28b5146dc4ace3b96544828efbc6d64","infoHashBuffer":{"type":"Buffer","data":[233,189,133,91,226,139,81,70,220,74,206,59,150,84,72,40,239,188,109,100]},"announce":[],"urlList":[]}}