{"title":"Sexually Broken--Tiny Amber Rayne deepthroats 10 inches of black","uid":9328318,"size":1144245680,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:ea0acfa834966248c1f725f926653c2b7a995978&amp;dn=Sexually+Broken--Tiny+Amber+Rayne+deepthroats+10+inches+of+black&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"merzedes","files":-1,"time":1386684385,"description":"\nTiny Amber deepthroats 10 inches of black cock, Rough ANAL sex and bondage, brutal orgasms! | Amber Rayne | Matt Williams\n\nDecember 9, 2013\n\n\nMP4 only.\n\n\nTiny little Amber Rayne only LOOKS like the girl next door. The truth is that behind the mild looking exterior lies a wanton filthy unapologetic pervert willing to try just about anything. We don't really have a chance in hell of sexually breaking this girl, today will be a walk in the park for her, but we are going to have fun trying. We start with our little pervert on her knees bound in a simple and classic chest tie beside the legendary Sexuallybroken bed. Her mouth hole is at just the right height for the 10 inches of furious black thunder that walks up and owns her skull.\n\nAmber rises to the challenge and brings her A-game to the deepthroating. Like a magician making a rabbit disappear, Amber makes every inch of Jack vanish down her well-trained gullet. Enough with the warmup. Shifting quickly, Jack throws her bound body onto the bed and proceeds to really lay into her. Splaying her legs open wide, he owns her hole and then rag doll fucks her all over the bed, flipping her around to get access to whichever end he desires. Without giving Amber a chance to get on top of it or catch her breath, a second dick is added to the mix. With a cock on both sides of her, Amber is turned into a porn slut sandwich. Teamwork for the win.\n\nNot content with using every inch of the bed while Amber's bound holes are powerfucked into next week, we add more rope to the mix just to really drive the point home how completely screwed she is. Her ankles are crossed over, tied down and folded up over her head. Once she is folded in half like a piece of paper, Jack writes his name on the walls Amber's pussy with his cock. Unable to move or shift for even a hint of relief, all tiny Amber Rayne can do is limply endure every inch of BBC Jack is dishing out. The added vibrator sends Amber rocketing into sexual subspace and her eyes fog over in bliss.\n\nWe might not of sexually broken this little slut, but we most certainly got her attention. If the wide grin dancing across her sex stoned face is any indication. You are welcome my dear. \n\nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2013/12_09arayne6/SexuallyBroken-Amber-Rayne-Matt-Williams-Tiny-Amber-deepthroats-10-inches-of-black-cock-Rough-ANAL-sex-and-bondage-brutal-orgasms.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2013/12_09arayne6/SexuallyBroken-Amber-Rayne-Matt-Williams-Tiny-Amber-deepthroats-10-inches-of-black-cock-Rough-ANAL-sex-and-bondage-brutal-orgasms.php&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:ea0acfa834966248c1f725f926653c2b7a995978","amp;dn":"Sexually+Broken--Tiny+Amber+Rayne+deepthroats+10+inches+of+black","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea0acfa834966248c1f725f926653c2b7a995978","infoHashBuffer":{"type":"Buffer","data":[234,10,207,168,52,150,98,72,193,247,37,249,38,101,60,43,122,153,89,120]},"announce":[],"urlList":[]}}