{"title":"The Art of Toshiko Takaezu - In the Language of Silence (Art Scu","uid":9335543,"size":110993756,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ea5388a9db02abd0ba6c2c8bce66e307b845c4e0&amp;dn=The+Art+of+Toshiko+Takaezu+-+In+the+Language+of+Silence+%28Art+Scu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"STBGD","files":-1,"time":1386846224,"description":"Peter Held, &quot;The Art of Toshiko Takaezu: In the Language of Silence&quot;\nISBN: 0807834823 | 2011 | PDF | 160 pages | 105 MB\n\nTracing the artistic development of renowned potter Toshiko Takaezu, this masterful study celebrates and analyzes an artist who holds a significant place in the post-World War II craft movement in America.\nBorn in Hawaii of Japanese descent in 1922, Takaezu has worked actively in clay, fiber, and bronze for over sixty years. Influenced by midcentury modernism, her work has transformed from functional vessels to abstract sculptural forms and installations. Over the years, she has continued to draw on a combination of Eastern and Western techniques and aesthetics, as well as her love of the natural world. In particular, Takaezu's vertical closed forms have become a symbol of her work, created through a combination of wheel-throwing and hand-building techniques that allowed her to grow her vessels vertically and eased the circular restrictions of the wheel. In addition to her art, Takaezu is renowned for her teaching, including twenty years at Princeton University.\nThis beautifully illustrated book offers the first scholarly analysis of Takaezu's life work and includes essays by Paul Smith, director emeritus of the American Craft Museum, and Janet Koplos, former senior editor of Art in America. Jack Lenor Larsen, an internationally known textile designer, author, and collector, provides a foreword.","torrent":{"xt":"urn:btih:ea5388a9db02abd0ba6c2c8bce66e307b845c4e0","amp;dn":"The+Art+of+Toshiko+Takaezu+-+In+the+Language+of+Silence+%28Art+Scu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea5388a9db02abd0ba6c2c8bce66e307b845c4e0","infoHashBuffer":{"type":"Buffer","data":[234,83,136,169,219,2,171,208,186,108,44,139,206,102,227,7,184,69,196,224]},"announce":[],"urlList":[]}}