{"title":"No Age - An Object (2013) [FLAC]","uid":9350891,"size":177243344,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:eaa068c4abe70b58e866d21d5e870cee5affa5c3&amp;dn=No+Age+-+An+Object+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"politux","files":-1,"time":1387120898,"description":"\n  No Age - An Object (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Rock, Noise Pop, Lo-Fi\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 No Ground\n  02 I Won't Be Your Generator\n  03 C'mon, Stimmung\n  04 Defector Ed\n  05 An Impression\n  06 Lock Box\n  07 Running From A-Go-Go\n  08 My Hands, Birch and Steel\n  09 Circling with Dizzy\n  10 A Ceiling Dreams of a Floor\n  11 Commerce, Comment, Commence\n\n  Los Angeles art punks No Age have always strained uneasy ambience out of the energy of hardcore and vice versa. In their earliest recordings, the duo landed somewhere between the sloppy youthful explosions of Void, My Bloody Valentine's fuzz-buried pop, and the churning ambient darkness of Gas. As they developed over increasingly well-produced albums like 2008's Nouns up until 2010's Everything in Between, No Age sought to either smooth out the edges or play up the contrasting elements of their sound, moving through phases of riff-heavy punk and unexpectedly open and sophisticated songwriting alike as they went on. Siphoning equal influence from the disparate scenes of dead-broke D.I.Y. culture and the art world, all of the impossible angles in the No Age equation find their culmination in third proper album An Object. A marked return to the experimental clouds of formless ambient sound is one of the first things fans will notice about the album, but where early EPs and subsequent singles compilation Weirdo Rippers moved between defined songs and humming dream-sequence fuzz, tracks like &quot;Running from A-Go-Go&quot; and &quot;An Impression&quot; successfully incorporate noise and waves of distortion as instruments in their lonely arrangements. Tracks like these represent one character that An Object takes on, finding No Age at their most introspective and subdued. \n\n  The incredible &quot;I Won't Be Your Generator&quot; falls into this side of the album as well, finding the same propulsive balance between emotional vulnerability and caustic noisiness that made Sonic Youth's Daydream Nation a perfect album. Amid these roaming lucid dreams are Ramones-meets-Ride blasts of punk like &quot;C'mon, Stimmung&quot; and the one-chord Krautcore of album opener &quot;No Ground.&quot; Marrying the airy heaven-sent guitars of the Durutti Column with both the abrasive immediacy of hardcore and the patient unfolding of classic shoegaze acts like Medicine and Loop only works because No Age have been coming to this point with their dream punk sound since the beginning. The series of dichotomies that makes their music as appropriate for all-ages shows at skate parks and stark white-walled gallery backdrops reaches its apex here, and even the relatively short running time of less than a half hour makes sense for the overall statement. Unlike earlier releases, no sound or idea lingers too long or whips by too quickly and nervously. The clashes in sound become the very skeletons for the songs, and the songwriting is more fearless and honest than ever before, marking a distinct maturity for No Age and resulting in their best work to date.","torrent":{"xt":"urn:btih:eaa068c4abe70b58e866d21d5e870cee5affa5c3","amp;dn":"No+Age+-+An+Object+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eaa068c4abe70b58e866d21d5e870cee5affa5c3","infoHashBuffer":{"type":"Buffer","data":[234,160,104,196,171,231,11,88,232,102,210,29,94,135,12,238,90,255,165,195]},"announce":[],"urlList":[]}}