{"title":"Saffire - 2001 - Ain't Gonna Hush! FLAC","uid":9343118,"size":350317140,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:eb99eb0dd2ced83695a664a8dbffaca92ed93aaa&amp;dn=Saffire+-+2001+-+Ain%27t+Gonna+Hush%21+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"eika256","files":-1,"time":1386971970,"description":"Saffire - 2001 - Ain't Gonna Hush!\n\nThe first studio album in five years from the band finds them for the most part, having a rocking good time and placing an emphasis on the boogie-woogie end of the blues. Instrumentally and vocally they keep getting better and better, with pianist Ann Rabson a particular standout for her vibrant keyboard work. While they live up to their image of empowered, strong women, evident in &quot;Ain't Gonna Hush,&quot; &quot;It Takes a Mighty Good Man,&quot; and the lovely, if not very bluesy, &quot;Unlove You,&quot; it's obvious from songs like &quot;Let the Gin Do the Talking,&quot; &quot;Prop Me up Beside the Jukebox,&quot; and the almost bawdy &quot;Footprints on the Ceiling&quot; that they also enjoy a good time. In fact, these lighter songs, whether covers or band originals, are what works best, keeping the foot tapping and a smile on the face -- &quot;Coffee Flavored Kisses,&quot; with its elaborate doo wop backing vocal arrangement, is a prime example. When they turn more serious, the songs simply don't work as well. Gayle Adegbalola's &quot;Blues for Sharon Bottoms&quot; is heartfelt, and torn straight form the news, but it's musically and lyrically awkward, which detracts from the power it needs to hit home. And her &quot;Happy Birthday to Me,&quot; which is probably meant to be tongue-in-cheek, ends up coming across as a hefty dose of self-pity. Those two aside, it's hard to find anything to criticize in this release, which has been far too long coming. As a trio they go from strength to strength, and even if their original focus has changed from vintage blues, they still do what they do very well indeed, and show that women of a certain age can have a home in the music. (AllMusic)\n\nTrack list:\n01 - Ain't Gonna Hush\n02 - It Takes a Mighty Good Man\n03 - Coffee Flavored Kisses\n04 - Nobody Ever Touched Me There\n05 - He Really Makes It Hard For Me To Sing The Blues\n06 - Blues For Sharon Bottoms\n07 - You Got To Tell Me\n08 - Footprints On The Ceiling\n09 - Let The Gin Do The Talking\n10 - Unlove You\n11 - Prop Me Up Beside The Jukebox\n12 - Birthday Suit\n13 - Happy Birthday To Me\n14 - Once In A While\n15 - If I Should Die Tonight\n\nPersonnel:\nGaye Adegbalola: Composer, Guitar, Harmonica, Vocals, Vocals (Background) \nAndra Faye: Bass, Fiddle, Guitar, Mandolin, Vocals, Vocals (Background)\nAnn Rabson: Composer, Guitar, Piano, Vocals, Vocals (Background)\n\nEnjoy and share!","torrent":{"xt":"urn:btih:eb99eb0dd2ced83695a664a8dbffaca92ed93aaa","amp;dn":"Saffire+-+2001+-+Ain%27t+Gonna+Hush%21+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb99eb0dd2ced83695a664a8dbffaca92ed93aaa","infoHashBuffer":{"type":"Buffer","data":[235,153,235,13,210,206,216,54,149,166,100,168,219,255,172,169,46,217,58,170]},"announce":[],"urlList":[]}}