{"title":"The Complete Yes Minister by Jonathan Lynn , Antony Jay","uid":9349831,"size":3725350,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ebaa74365520e65316c38cc0e82a451e5740d80d&amp;dn=The+Complete+Yes+Minister+by+Jonathan+Lynn+%2C+Antony+Jay&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1387104951,"description":"We have had diaries from other Cabinet Ministers, but none I think which have been quite so illuminating... It is a fascinating diary... It is shorter than Barbara Castle's... and although it is rather more accurate than Dick Crossman's, it is distinctly funnier' - Lord Allen of Abbeydale (formerly Permanent Secretary at the Home Office) in The Times 'It has an entertainment and educational value which is unique. It is uproariously funny and passes the acid test of becoming more amusing at every subsequent reading... I will go so far as to claim that in the characters of Jim Hacker and Sir Humphrey Appleby, Messrs Lynn and Jay have created something as immortal as P.G. Wodehouse's Bertie Wooster and Jeeves' - Brian Walden in The Standard\n\nThe Complete Yes Minister\nEditorial Reviews\nThe British TV series Yes Minister (shown here on PBS) began as an innocuous spoof on the vagaries of politicians and civil servants. Its popularity increased as it developed a deepening satiric perception of how the British are actually governed: Ministers are kept in the dark by their civil service advisers as much as possible; their sole domain is &quot;making policy,&quot; while the civil servants get on with running the country and making sure the politicians get the blame. In turning their scripts into a book, the authors have gone beyond a simple recounting of the episodes. Presented as actual memoirsthe diary of James Hacker, Minister for the Department of Administrative Affairs, augmented by material from his two civil service advisers, Sir Humphrey Appleby and Bernard WooleyYes Minister is an amusingly literate, sharply satirical account of the exchanges of quid pro quo necessary to run any government. The book surpasses its TV origins and stands firmly on its own merits. On the bestseller lists in England for over three years, this provocative satire could well be considered a British Doonesbury. 25,000 first printing.","torrent":{"xt":"urn:btih:ebaa74365520e65316c38cc0e82a451e5740d80d","amp;dn":"The+Complete+Yes+Minister+by+Jonathan+Lynn+%2C+Antony+Jay","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebaa74365520e65316c38cc0e82a451e5740d80d","infoHashBuffer":{"type":"Buffer","data":[235,170,116,54,85,32,230,83,22,195,140,192,232,42,69,30,87,64,216,13]},"announce":[],"urlList":[]}}