{"title":"Lifting The Chaderi - My Life as an Afghan Refugee - Anisa Mahmo","uid":9359971,"size":595684,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ecfc7a8f05dbad7e28000ff110b04508aaa15489&amp;dn=Lifting+The+Chaderi+-+My+Life+as+an+Afghan+Refugee+-+Anisa+Mahmo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1387293678,"description":"In Afghanistan, the chaderi is the veil that some women wear to cover their entire bodies and faces. During the Taliban era, all women were made to wear this tent-like garment. However, in the liberal 1970s, women in the capital city of Kabul typically wore Western-style clothing. After war breaks out and her country is overcome with bombs and death, 22-year-old Anisa must don the veil for the first time and flee her country as a refugee. The journey is long and dangerous, over a treacherous mountain pass. She leaves most of her family and friends behind in order to find peace in a land where she can be free: America. As a new nurse-midwife, Anisa struggles to adapt to American life and overcome her cultural limitations and anxieties. A true story of how a heart filled with love and hope for a better life inspires immense bravery, reminding us that the power of family can always be felt, no matter how inconceivable the distance. Discover what you'll find, when you lift the chaderi. &quot;Lifting the Chaderi: My Life as an Afghan Refugee&quot; is a memoir written by Anisa Mahmoud Ulrich. One of 13 children growing up in Kabul, Afghanistan in the 1960s, Anisa battles anxiety attacks and a speech impediment. Although her mother is illiterate, she insists that Anisa and her sister complete nursing school, despite constant criticism from conservative family members who do not believe women should be educated. An opportunity to study in Santa Cruz, California puts 19-year-old Anisa at risk when she returns to the Communist regime in Afghanistan just prior to the Soviet invasion of 1979. Like many Afghans at the time, she and several family members decide to escape. They make the hazardous journey over the Torkham pass into Pakistan, leaving her dear parents and family. The journey takes them to Istanbul, Italy, and finally to Rhode Island, where they slowly rebuild their lives as refugees. Anisa marries an Afghan man, also a refugee, only to find herself in an abusive marriage. As the violence escalates, she must escape once again, this time while supporting herself and her two children as a nurse. Eventually she goes against her culture and does the unthinkable: she divorces her husband and marries an infidel - an American man, also divorced with two children. Anisa finally returns to Kabul 30 years later, after years of war and the Taliban have ravaged her country. She finds that her journey as a refugee has given her the strength and courage to give more to her family in Kabul than she ever thought possible. Author: Anisa Mahmoud Ulrich Editor: Lisa Drittenbas Photographer: Ashley Nicole Ulrich","torrent":{"xt":"urn:btih:ecfc7a8f05dbad7e28000ff110b04508aaa15489","amp;dn":"Lifting+The+Chaderi+-+My+Life+as+an+Afghan+Refugee+-+Anisa+Mahmo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecfc7a8f05dbad7e28000ff110b04508aaa15489","infoHashBuffer":{"type":"Buffer","data":[236,252,122,143,5,219,173,126,40,0,15,241,16,176,69,8,170,161,84,137]},"announce":[],"urlList":[]}}