{"title":"Star Wars - John Rose playing the great pipe organ at the Cathed","uid":9243676,"size":162019752,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ededad2ea6ae6d074242cf958880cf354713abf3&amp;dn=Star+Wars+-+John+Rose+playing+the+great+pipe+organ+at+the+Cathed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"}{eywood","files":14,"time":1385331534,"description":"Music from Star Wars\nA 20th Century Fox Film\nComposed by John Williams\nTranscribed for organ by Robert Edward Smith\n\nPerformed by John Rose playing the great pipe organ at the Cathedral of St. Joseph, Hartford, CT\n\nProduced and engineered by Michael Nemo\n\nLineage: LP &gt; Adobe Audition 1.5 (click/noise elimination, compression, track splitting) &gt; TLH (SBE fix, flac 8)\n\n   I've had this album for years but never played it much.  I don't remember where I found it, but being a Star Wars afficianado, I thought it was unusual enough to require owning.  I finally decided to bring it to the digital realm in August 2010, but upon doing so I was plagued by problems.  As the liner notes below illustrate, no dynamic processing was used in recording this album, and that resulted in what is the quietest recording I've ever heard.  The sound of the music is actually lower than the sound of the needle riding on the record in a lot of spots.  Add to that some wear and tear from the years its been around, and it was a very noisy record.  there was quite a bit of surface noise on it, and the slightest flaw was amplified a hundred fold by the need to crank the volume up so much in remastering.  I ran an automated click filter on this twice, then painstakingly went through and removed the remaining clicks and artifacts manually.  And I do mean painstakingly.  It took me a week to clean this album up!  I then decided to go against the original production team's decision and ran some dynamics processing on the file to try to level out the volume dynamics a bit.  Finally I took the remaining rumbly noise (sampled from between the tracks)  and removed it.  I took a fresh noise sample from the end of each song and used it on that track.  The result is what you hear before you.  A small portion of the reverberation decay was lost in noise reduction, but you'd agree it was necessary if you heard the signal to noise ratio on this thing.  I added a little bit of digital reverb to restore the decay to a more natural sound.  \n\nI hope everyone who likes Star Wars and soundtracks in general enjoys this.  I doubt there are many copies of this around anymore.  Now that this is transferred I may even consider selling the LP to someone who plays records regularly.\n\n01 Main Title\n02 The Desert &amp; Robot Auction\n03 the Princess Appears\n04 Inner City\n05 Cantina band\n06 Mouse Robot &amp; Blasting Off\n07 Ben's Death &amp; TIE Fighter Attack\n08 Princess Leia's Theme\n09 The Last Battle\n10 The Throne Room &amp; End Title\n","torrent":{"xt":"urn:btih:ededad2ea6ae6d074242cf958880cf354713abf3","amp;dn":"Star+Wars+-+John+Rose+playing+the+great+pipe+organ+at+the+Cathed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ededad2ea6ae6d074242cf958880cf354713abf3","infoHashBuffer":{"type":"Buffer","data":[237,237,173,46,166,174,109,7,66,66,207,149,136,128,207,53,71,19,171,243]},"announce":[],"urlList":[]}}