{"title":"101 Strings Orchestra - The Glory of Christmas","uid":9313739,"size":154193755,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ee62197c1d480f5ed132de0d5cf2e7a26f21b191&amp;dn=101+Strings+Orchestra+-+The+Glory+of+Christmas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1386441428,"description":"Source: 1990 CD\n-\n101 Strings Orchestra - The Glory of Christmas 320cbr (Big Papi) 1990\n-\nBy M. Ellis\n101 Strings &quot;The Glory of Christmas&quot; is quickly becoming a personal holiday favorite. The music ranges from a wonderful simplicity to certain majestic moments that can't help but propel the listener into the true beauty and solace that is Christmas music when performed and arranged properly.\n\nAs much as I love the old traditional standards of the season ( Nat King Cole, Bing, Como, etc), nevertheless it is the beautiful orchestrations and arrangements of these timeless songs that truly fill out the Christmas season.\n\nTwo highlights of the CD are &quot;While Sheppards Watched Their Flocks&quot; and the medley of &quot;Good King Wenceslas&quot; and &quot;Jingle Bells&quot;. True, one doesn't necessarily fit those two songs in a category for a medley, still the production works very well. In one song we are treated to the religious (real) reason for the season and the fun simplicity of a song all of us grew up listening to in days certainly more innocent.\n\nPerhaps where the CD doesn't quite hit the mark is in some of the choral arrangements. While certainly acceptable, they are not the CD's zenith.\n\n101 Strings &quot;The Glory of Christmas&quot; is very good because it is not overly-pretentious. It is a wonderful CD for anyone who likes to listen to the soothing sounds of Christmas next to a crackling fire with a glass of your favorite beverage close by","torrent":{"xt":"urn:btih:ee62197c1d480f5ed132de0d5cf2e7a26f21b191","amp;dn":"101+Strings+Orchestra+-+The+Glory+of+Christmas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee62197c1d480f5ed132de0d5cf2e7a26f21b191","infoHashBuffer":{"type":"Buffer","data":[238,98,25,124,29,72,15,94,209,50,222,13,92,242,231,162,111,33,177,145]},"announce":[],"urlList":[]}}