{"title":"Bon Jovi-Keep the Faith 320cbr (Big Papi) 1992","uid":9330491,"size":158271319,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ee8ad8dc968d4c5a2efeec6f19247a7c75ebc236&amp;dn=Bon+Jovi-Keep+the+Faith+320cbr+%28Big+Papi%29+1992&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1386718149,"description":"Source: 1992 CD\n-\nBon Jovi-Keep the Faith 320cbr (Big Papi) 1992\n-\nBy Jay Lenderman\n[code]Slippery When Wet made them superstars. New Jersey established them as a great rock band, but Keep The Faith just proves that Bon Jovi is not just another band from the 80's. There are the trademark Bon Jovi songs with the catchy chorus and guitar riffs, but it's the songs that are different to Bon Jovi fans that makes this album work. The opening track I Believe is a solid rock that grabs your attention and it is followed by the title track which is a departure from anything on the New Jersey album. I'll Sleep When I'm Dead is a typical Bon Jovi sing-a-along that's fun to listen to and In These Arms is a cool rock ballad for the ladies, but it was Bed Of Roses that got all of the women to cry. It was also the biggest hit off of the album. The best track would have to be Dry County. Jon Bon Jovi is at his best vocally and Richie Sambora pulls off an excellent guitar riff that will blow your socks offf. The most underrated song would have to be Fear. This song definitely stands out on this album compared to the other songs. To give you my honest opinion, this is Bon Jovi's best album and I am a huge Bon Jovi fan. The songs are more solid and put together than any other Bon Jovi tune. This album also proves than Bon Jovi can be taken seriously as artists and not just another 80's rock band lying by the waste side.[/code]","torrent":{"xt":"urn:btih:ee8ad8dc968d4c5a2efeec6f19247a7c75ebc236","amp;dn":"Bon+Jovi-Keep+the+Faith+320cbr+%28Big+Papi%29+1992","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee8ad8dc968d4c5a2efeec6f19247a7c75ebc236","infoHashBuffer":{"type":"Buffer","data":[238,138,216,220,150,141,76,90,46,254,236,111,25,36,122,124,117,235,194,54]},"announce":[],"urlList":[]}}