{"title":"09-Pradhanmantri Episode 9 of Pradhanmantri-Split in Congress pa","uid":9434431,"size":204644727,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ef410003db5846db8d10b76a99f2d1676db3ee38&amp;dn=09-Pradhanmantri+Episode+9+of+Pradhanmantri-Split+in+Congress+pa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"meanmeen","files":-1,"time":1388870544,"description":"Pradhanmantri is an Indian television politics-based reality series/documentary series, hosted by actor-director Shekhar Kapur on Hindi news channel ABP News, which premiered on July 13, 2013. It aims to bring to the audience the never seen before facts of Indian history. The weekly programme chronicles the history of India from 1947 to the present day. The TV series is hosted by the renowned film-maker, actor and host Shekhar Kapur,and directed by Puneet Sharma. The show is a unique attempt to present the changes in the country during the tenures of 13 Indian Prime Ministers in the last 65 years. The show airs every Saturday at 10 PM on ABP news.ries also aired the news telecast of death of Indira Gandhi on Doordarshan by Salma Sultan. Initially conceptualised for 23 episodes, the TV series was extended to 26 episodes with the last episode aired on 4 January 2014. Pradhanmantri series is now re-telecasted in Bengali on ABP Ananda from 14 December 2013,which is hosted by Bengali actor Dhritiman Chatterjee.","torrent":{"xt":"urn:btih:ef410003db5846db8d10b76a99f2d1676db3ee38","amp;dn":"09-Pradhanmantri+Episode+9+of+Pradhanmantri-Split+in+Congress+pa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef410003db5846db8d10b76a99f2d1676db3ee38","infoHashBuffer":{"type":"Buffer","data":[239,65,0,3,219,88,70,219,141,16,183,106,153,242,209,103,109,179,238,56]},"announce":[],"urlList":[]}}