{"title":"Complete Marvel Chronology  CMC 1971","uid":9421411,"size":5802427776,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ef78d037865c87da460ca69b580bccc60dfa6b06&amp;dn=Complete+Marvel+Chronology++CMC+1971&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"7","files":-1,"time":1388599015,"description":"About the Complete Marvel Chronology by PeteThePIPster\n\nThe Complete Marvel Chronology (CMC) is version 2.0 of the Marvel Chronology (MC).\n\nThe MC was created by cyager69 aka Chuck, who uploaded Marvel comics beginning with Fantastic Four 001 (Nov 61) through to the issues published in Jun 1997.\n\nWhen Chuck was unable to continue the uploads I took over the MC and uploaded the remainder of the issues through to December 2008. Additional uploads added various titles not cover-dated with a specific month (the 'Decades' uploads) and seven Fill packs added new scans for issues missing when the original uploads were done for the 70's through to the 90's.\n\nWith none of Chuck's original uploads online, the decision was to either upload the original version of 1961-1996 or go with a brand new, full version incorporating the missing genres, such as romance, western and humour, and including the imprints which Chuck intended to upload following the completion of the MC.\n\nThe CMC will cover Marvel's entire seventy year history. At present I am uploading the years beginning with 1960 and these uploads will continue right through to December 1996. After that I have not finalised what will follow, but the likelihood will be that I go back to upload the 39-59 period, and then upload the 97-09 period again. When I do upload version 2.0 of 97-09 there will be many additions and many new scans.\n\nNews and Notes\n\nCMC 1971 01-12 sees all the issues released that year uploaded in one go. From here the number of issues released each year begins to increase quite quickly, by 1975 the number of issues is over 600!\n\nThis affects the uploads in two ways - it will probably take me longer to compile each upload, and it may take longer to complete seeding when the size of the torrent is around 15gb or more.\n\nWhat may happen is that each upload may follow around 10 days after the previous one rather than 7 days as is typical now. i'll monitor how things go and report on this again.\n\nAquaman So why is Aquaman in a Marvel upload? Well, Steve Skeates writes this final issue (056 in April) and in 1974 he will also write the final issue of Sub-Mariner (072 in September) where a mysterious hand presses a button and destroys a space vessel. As that hand belongs to Aquaman, who is not actually credited in Sub-Mariner for legal reasons, the first cross-over between Marvel and DC takes place!\n\nAcknowledgments\n\nBooks used as research material in completing the CMC include -\n\nMarvel Chronicle - Tom DeFalco\nMarvel Vault - Roy Thomas and Pete Sanderson\nTales of the Implosion - Tom Lammers\nStandard Catalogue of Comics 5th Edition\n\nThanks to PeteThePIPster for his amaziness and ability to put all this together.\n\nThanks to all the scanners, editors and uploaders who make the scans available.\n\nThanks for the support of all those who seed the CMC.\n\nThanks to Chuck for creating the MC.\n\nMore info and pictures at\n &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-%E2%98%BA%E2%99%8B%E2%99%82%E2%98%A0%E2%98%80%E2%98%AE-%C6%AE%E2%98%AF%C2%AE%C2%AE%C6%90%C6%9D%E2%98%A8%C2%A7-%E2%98%AE%E2%98%80%E2%98%A0%E2%99%82%E2%99%8B%E2%98%BA?pid=16044#pid16044&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-%E2%98%BA%E2%99%8B%E2%99%82%E2%98%A0%E2%98%80%E2%98%AE-%C6%AE%E2%98%AF%C2%AE%C2%AE%C6%90%C6%9D%E2%98%A8%C2%A7-%E2%98%AE%E2%98%80%E2%98%A0%E2%99%82%E2%99%8B%E2%98%BA?pid=16044#pid16044&lt;/a&gt;","torrent":{"xt":"urn:btih:ef78d037865c87da460ca69b580bccc60dfa6b06","amp;dn":"Complete+Marvel+Chronology++CMC+1971","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef78d037865c87da460ca69b580bccc60dfa6b06","infoHashBuffer":{"type":"Buffer","data":[239,120,208,55,134,92,135,218,70,12,166,155,88,11,204,198,13,250,107,6]},"announce":[],"urlList":[]}}