{"title":"The Complete Prose of Woody Allen.pdf","uid":9371069,"size":2886678,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f03d6960c0e91b2903ce8d86ac37db15e57229b2&amp;dn=The+Complete+Prose+of+Woody+Allen.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1387528426,"description":"Although Woody Allen is best known for his cult movies, he is also a writer of wit and skill. This collection offers 52 pieces of hilarity, deadpan weirdness and outlandish ideas. Do you want to hear about the time Hitler went for a haircut? Or why Woody reveres Socrates? Have you ever wondered what would have happened if the Impressionists had actually been dentists? You can learn much about history - the piece on the invention of sandwiches is eye-opening - or modern life in this selection of thoughts, observations, diaries and stories from one of the most original minds and wonderfully comic voices of our time.\n\nEditorial Reviews\nReview\nBorn in 1935, Allen Stewart Konigsberg (better known as Woody Allen) is today one of the most influential figures in cinema. He has written and directed such memorable films as Annie Hall and Manhattan, and has acted in over 40 films. He is also the author of three books--Getting Even (1971), Without Feathers (1975), and Side Effects (1980). The Complete Prose of Woody Allen brings these memorable titles together for one bumper collection--a must-have for Allen addicts.\nGetting Even is a collection of 17 of Allen's magazine pieces from the late 1960s discussing such bizarre topics as the invention of the sandwich, laundry lists, death, obesity, and, of course, rabbis.\n\nWithout Feathers delivers more of Allen's New Yorker-style humor. Worthy stand-outs include &quot;If the Impressionists Had Been Dentists,&quot; a genius piece that puts oral surgery in a whole new, much more exciting, light.\n\nFinally, Side Effects compiles Allen's best New Yorker essays from the late 1970s. Although not as outrageously funny as his previous books, this is still a classic piece of comedy. --Naomi Gesinger\n\nReview\n'It's no secret that Allen's short stories are just as entertaining and accomplished as his films... Allen's witty stories satirise contemporary society and classic modern literature in a style that is characteristically breathless, off the cuff and brilliant' OBSERVER","torrent":{"xt":"urn:btih:f03d6960c0e91b2903ce8d86ac37db15e57229b2","amp;dn":"The+Complete+Prose+of+Woody+Allen.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f03d6960c0e91b2903ce8d86ac37db15e57229b2","infoHashBuffer":{"type":"Buffer","data":[240,61,105,96,192,233,27,41,3,206,141,134,172,55,219,21,229,114,41,178]},"announce":[],"urlList":[]}}