{"title":"Mean Cuckold 2 (NEW 2013 Evil Angel) [DVDRip]","uid":9259701,"size":2810760617,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f04571497a13a5b6e0a88334692b8b936bc6bcf7&amp;dn=Mean+Cuckold+2+%28NEW+2013+Evil+Angel%29+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chkm8te","files":1,"time":1385609098,"description":"Mean Cuckold 2 (NEW 2013 Evil Angel) [DVDRip]\n\nNikita Von James, Evan Stone, Jessica Bangkok, Kurt Lockwood, Karen Fisher, Ryan McLane, Jeremy Conway, Cali Carter, Jimmy Broadway, Marcelo, Dirk Huge, Dominik Kross\n\nHow much can a poor guy take? Ask Glenn King or any of the long-suffering male submissives of 'Mean Cuckold 2.' In the fetish-niche director's new movie, heartless dommes and their alpha lovers join perverse vignettes that portray sexual betrayal and degradation. For pathetic beta-boys, being made to endure and even facilitate their own cuckolding is psychosexual humiliation they can get off on. Wimpy Jeremy Conway is excited that his busty blonde girlfriend, Nikita Von James, has agreed to let him host a swinger party. His dream becomes his nightmare when Nikita invites only one guest, beefy Evan Stone! Suddenly, three's a crowd; Jeremy's reduced to licking Nikita's erogenous zones while Evan fucks her!\nMarcelo and his gorgeous Asian wife, Jessica Bangkok, have financial problems. Along comes wealthy entrepreneur Kurt Lockwood with an indecent proposal: $500 to fuck Jessica... and Marcelo has to watch. Jessica leaps at this opportunity to shatter her husband's pride. Super-stacked blonde BBW Karen Fisher won't have sex with husband Jimmy Broadway, but when a younger dude wants to collect on one of Jimmy's drunken wagers, Karen eagerly smothers her loser hubby with her massive ass while hungrily sucking on a real man's big black cock. The interracial lovers ridicule the size of Jimmy's penis, fucking literally inches from his face. Finally, sultry young blonde Cali Carter torments boyfriend Dominik Kross by cheating on him - with a priest! The extreme infidelities depicted in 'Mean Cuckold 2' are terrifying thrills and thrilling terrors!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=c8us3qygisnc4ygeths6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=c8us3qygisnc4ygeths6.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=fi9z8bybcsq1f572t3l1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=fi9z8bybcsq1f572t3l1.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:f04571497a13a5b6e0a88334692b8b936bc6bcf7","amp;dn":"Mean+Cuckold+2+%28NEW+2013+Evil+Angel%29+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f04571497a13a5b6e0a88334692b8b936bc6bcf7","infoHashBuffer":{"type":"Buffer","data":[240,69,113,73,122,19,165,182,224,168,131,52,105,43,139,147,107,198,188,247]},"announce":[],"urlList":[]}}