{"title":"EnigmaT Set Rips { Cuts } - December 13th, 2013","uid":9341233,"size":331868911,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f140d07fc5319dfdfcff2426a4983334eb8bf15b&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+December+13th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"EnigmaT","files":38,"time":1386894716,"description":"Airbase - Escape (Daniel van Sand Remix) (ASOT 643 Rip)-enTc.mp3\nAndreas Rodlund &amp; Matt Hewie feat. Jonny Rose - All We Have (Josef Bamba &amp; Lars Aar Remix) (Cut From Schossow Set)-enTc.mp3\nArisen Flame - War Of Angels (ASOT 643 Rip)-enTc.mp3\nArmin van Buuren pres. Gaia - Aisha (Hazem Beltagui Melo Bootleg) (ASOT 643 Rip)-enTc.mp3\nBoss Axis - Tranquilla (Fabian Schumann Remix) (Cut From Schossow Set)-enTc.mp3\nCamerata Vs The Defcon Allstars &amp; Tom Colontonio - The Sun (Original Mix) (Cut From Above Clouds Set)-enTc.mp3\nChris Lake feat. Jareth - Helium (Cut From Schossow Set)-enTc.mp3\nCosmic Gate - So Get Up (Ben Gold Remix) (ASOT 643 Rip)-enTc.mp3\nDamian Wasse - Prison Break (Passenger 75 Intro Edit) (Cut From Shiver Set)-enTc.mp3\nDankann - And God Said (Club Mix) (ASOT 643 Rip)-enTc.mp3\nDanny Cullen - Elathan (GDJB Rip)-enTc.mp3\nDavid Broaders &amp; Attractive Deep Sound - Evening Falls (GDJB Rip)-enTc.mp3\nDavid Forbes - Foldback (David Forbes 2014 Refit) (-Short- ASOT 643 Rip)-enTc.mp3\nDreamy - What Did I Do (Emotional Mix) (Cut From Above Clouds Set)-enTc.mp3\nDunkan - Never Too Late (Sergey Shemet Remix) (ASOT 643 Rip)-enTc.mp3\nEstigma - Artemis (Allen &amp; Envy Remix) (Cut From Allen &amp; Envy Set)-enTc.mp3\nFlatlex - Phaethon (Inteyes Remix) (Cut From Jerom Set)-enTc.mp3\nHarry Square - True Story (GDJB Rip)-enTc.mp3\nIntomek - Tcame (Ally Brown Remix) (Cut From Allen &amp; Envy Set)-enTc.mp3\nLush &amp; Simon feat. Rico &amp; Miella - Drag Me To The Ground (Original Mix) (Cut From Shiver Set)-enTc.mp3\nManufactured Superstars feat. Danni Rouge - Like Satellites (Andy Duguid Remix) (Cut From Shiver Set)-enTc.mp3\nMarkus Schulz - Destino (GDJB Rip)-enTc.mp3\nMatt Darey aka Tekara feat. Lucy Cotter - I Breathe In You (Aeron Aether Epic Breaks Mix) (Set Rip)-enTc.mp3\nMax Stealthy - Scattered Clouds (Joost Remix) (Cut From Jerom Set)-enTc.mp3\nMixail - A New Age (-Short- ASOT 643 Rip)-enTc.mp3\nNick Callan - Inner Thoughts (ASOT 643 Rip)-enTc.mp3\nObsidian Radio feat. Jan Johnson - Love Like This (Allen &amp; Envy Remix) (Cut From Allen &amp; Envy Set)-enTc.mp3\nObsidian Radio feat. Jan Johnston - Love Like This (Beautiful Needs) (Allen &amp; Envy Remix) (ASOT 643 Rip)-enTc.mp3\nPaul Hided - In Search Of serenity (Alex Blest Remix) (Cut From Above Clouds Set)-enTc.mp3\nPurelight - Remember (ASOT 643 Rip)-enTc.mp3\nPvR - High Frequencies (Original Mix) (Cut From Above Clouds Set)-enTc.mp3\nRodion Poddubsky - Aura (Tvardovsky Remix) (Cut From Darey Set)-enTc.mp3\nSouthside Spinners - Luvstruck (Chris North 2013 Rework) (Cut From Asprey Set)-enTc.mp3\nStyle of Eye - Kids (Cut From Schossow Set)-enTc.mp3\nSultan &amp; Ned Sheperd - No Good vs. Cosmic Gate Crushed vs. Fatboy Slim - Eat Sleep Rave Repeat (Armin van Buuren Mashup) (ASOT 643 Rip)-enTc.mp3\nThiesen &amp; Senza vs Those Random Boys - 123456 Do It (Cut From Schossow Set)-enTc.mp3\nTimewave - Against the Wall (Digital Department Remix) (GDJB Rip)-enTc.mp3\nWitness45 - Aurora (Original Mix) (Cut From Allen &amp; Envy Set)-enTc.mp3\n","torrent":{"xt":"urn:btih:f140d07fc5319dfdfcff2426a4983334eb8bf15b","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+December+13th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f140d07fc5319dfdfcff2426a4983334eb8bf15b","infoHashBuffer":{"type":"Buffer","data":[241,64,208,127,197,49,157,253,252,255,36,38,164,152,51,52,235,139,241,91]},"announce":[],"urlList":[]}}