{"title":"CSI: Crime Scene Investigation series by Max Allan Collins","uid":9319777,"size":2191880,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f1470cbbdce74d3704a00d7769039ed35e68bb97&amp;dn=CSI%3A+Crime+Scene+Investigation+series+by+Max+Allan+Collins&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1386529788,"description":"Max Allan Collins has earned an unprecedented ten Private Eye Writers of America Shamus nominations for his historical thrillers, winning twice for his Nathan Heller novels, True Detective and Stolen Away. A Mystery Writers of America Edgar nominee in both fiction and non-fiction categories, Collins has written five suspense novel series, film criticism, short fiction, songwriting, trading-card sets, and movie/TV tie-in novels, including Air Force One, The Mummy Returns, the New York Times bestselling Saving Private Ryan, CSI: Double Dealer (from the CBS series), and The Scorpion King. \nHe scripted the internationally syndicated comic strip Dick Tracy from 1977 to 1993 and has written the Batman comic book and newspaper strip. His graphic novel, Road to Perdition, has been made into a DreamWorks feature film starring Tom Hanks and Paul Newman, directed by Sam Mendes.He has also published under the name Patrick Culhane. He and his wife, Barbara Collins, have written several books together. Some of them are published under the name Barbara Allan. \n\nDouble Dealer: Meet the little known and even less understood heroes of police work in Las Vegas - the forensic investigators, as they work to untangle the evidence behind the yellow police tape. Wednesday, 5.30am: in an off-the-strip, somewhat-out-of-the-way casino, a room service waiter rounds a corner and stumbles across a killer, and a corpse. Homicide detective Jim Brass summons Grissom and company to the scene. As Brass follows his instincts, Warrick and Sara folow evidence the killer left behind, and Nick and Catherine investigate a murder that's fifteen years new. Although focused at first on the perpetrator's deadly double-tap signature, Grissom will soon make the most troubling discovery of all: the inexplicable interest of FBI agent Rick Culpepper.\n\nSin City: LAS VEGAS, NV. Lynn Peirce, devoted wife and mother, has disappeared without a trace--but her best friends have an audio tape of her husband threatening to cut her up into little pieces. Stripper Jenna Patrick, on the other hand, has just been found--strangled to death in a private room of the club where she worked. Crime Scene Investigation director Gil Grissom and his CSI team must uncover the evidence and unravel the truths behind both shocking murders.\n\nCold Burn: For veteran investigator Gil Grissom and company, Las Vegas crime scene cases are never simple. The experts' cutting-edge scientific methods and old-fashioned detective work must work overtime as they struggle to make sense of the evidence behind the yellow police tape.\n\nBody of Evidence: Early one quiet Monday morning, in an empty executive office, assistant Janice Denard begins to prepare for another ordinary day - but instead discovers evidence of horrific crimes, shocking photographs left abandoned in a printer. Now, with the help of the LVPD's computer forensics experts, the CSI team must track through hardware and software, deception and deceit to find the perpetrators. But while Willows and Stokes investigate the once well-hidden secrets now revealed in print, Grissom, Brown, and Sidle uncover new and disturbing evidence in a high-profile media case...the brutal murder of the Mayor's long-missing secretary.\n\nGrave Matters: Rebecca Bennett, the estranged daughter of a well-to-do Las Vegas businessman, is hounding Captain Jim Brass to reopen the investigation into the death of her mother Rita, alleging that - despite appearances to the contrary - her avaricious stepfather had a hand in her mother's untimely end. But noone is prepared for the mystery that Gil Grissom, Sara Sidle and Nick Stokes uncover. Their investigation is inconclusive - because the disinterred body is not that of Rita Bennett. Meanwhile, at the Sunny Day Continuing Care Facility, Catherine Willows and Warrick Brown are looking into the sudden death of Vivian Elliot - which may not be the result of natural causes.\n\nBinding Ties: Ten years ago, Las Vegas was terrorized by &quot;CAST&quot; -- a vicious serial killer responsible for nearly half a dozen brutal murders, and who tested the mettle of the LVPD's new Captain, Jim Brass. After a two-year spree, CASt suddenly disappeared and has not been heard from...until now. Gil Grissom and his CSI team are called in to investigate a homicide that perfectly fits the notorious criminal's modus operandi. But all hell breaks loose when a reporter made famous by the original cases receives a letter from someone claiming to be CAST -- and who says he has nothing to do with the latest slaying.\nNow the CSIs must stop someone who may be a copycat killer from striking again. ...even as a murderer from the past continues to evade capture, and isn't taking too kindly to rivals...\n\nKilling Game: The machinations of a new supervisor may have altered Gil Grissom's team of skillful CSIs, as Catherine Willows, Nick Stokes, and Warrick Brown are reassigned from the graveyard shift to the swing shift. That doesn't mean, however, that their paths will never cross. During the course of their separate investigations, the teams must unite again to investigate two distinct murders -- atrocities that are oddly aligned as they share much of the same collective evidence. Despite the different M.O.s, the CSIs are uncovering two wildly imperfect crimes that could possibly add up to an almost perfect one...\n\nSnake Eyes: Luck is on the side of most during the incident at the Four Kings Casino and Hotel, when the simmering tension between two rival biker gangs suddenly boils over into all-out violence -- miraculously, there are only two fatalities despite the hundreds of rounds fired on the casino floor. Called to an out-of-control crime scene -- located outside Las Vegas in the legendary town of Boot Hill -- forensic investigators Gil Grissom, Catherine Willows, Nick Stokes, and Sara Sidle quickly discover that the two casino shootout victims were no innocent bystanders: one was the powerful leader of the Predator gang, and the other a luckless card dealer who may have borne witness to an elaborately staged execution.\nMeanwhile, back in the glitter of Sin City, CSIs Warrick Brown and Greg Sanders have their own hands full, as the dark side of this desert metropolis is about to wreak havoc on the two investigators via a seemingly endless series of crimes. . .","torrent":{"xt":"urn:btih:f1470cbbdce74d3704a00d7769039ed35e68bb97","amp;dn":"CSI%3A+Crime+Scene+Investigation+series+by+Max+Allan+Collins","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1470cbbdce74d3704a00d7769039ed35e68bb97","infoHashBuffer":{"type":"Buffer","data":[241,71,12,187,220,231,77,55,4,160,13,119,105,3,158,211,94,104,187,151]},"announce":[],"urlList":[]}}