{"title":"Stossel.2013.12.12.[Defending the Market].Fox Business.CF.avi","uid":9348858,"size":343039630,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f2c5baaf58b9b987f17e891e00e1e4b27ea4f52f&amp;dn=Stossel.2013.12.12.%5BDefending+the+Market%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1387084946,"description":"----------\n\nSTOSSEL - [Defending the Market] - Fox Business Network\n2013, December 12, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nMARKETS UNDER ATTACK:\n\n&quot;The problem with Obamacare isn't too much socialism, it's still too much capitalism,&quot; says Bill Maher on HBO. On MSNBC, Lawrence O'Donnell said, &quot;We need to take the political sting out of the word socialist.&quot;\n\nNo. We need to remind Americans that socialism and all forms of big government lead to stagnation and poverty. I'll debate Congressman Charles Rangel, who tells me not to make laws sound &quot;negative.&quot;\n\nFREE MARKETS HELP POOR PEOPLE: Economists Abby McCloskey and Victor Claar point out 500 million people have lifted themselves out of poverty in the last five years, thanks to the worldwide movement toward freer markets.\n\nRAISIN REGULATION: Unfortunately, in America, markets become less free. One example: something called the Raisin Administrative Committee demands raisin farmers give the government almost half their crop. Marvin Horne, owner of Raisin Valley Farms, said no. The government says he owes 1.2 million pounds of raisins.\n\nMARKETS NOT CAPITALISM: Gary Chartier, co-editor of Markets Not Capitalism, says there's actually a lot to hate about &quot;capitalism&quot; when the word suggests capitalists using political connections to get special privileges.\n\nKIDS AND CAPITALISM: 13-year-old Lauren Hudson and her father Rob Hudson co-wrote a book meant to teach students capitalism. They say capitalism is not taught in schools.\n\nECONOMIC FREEDOM: Johan Norberg, of the CATO Institute, made a documentary on economic freedom. He went around the world to see how it improves poor people's lives.\n\nMY TAKE: Sadly, in some ways, America has become rule-bound, like India. I tried to open a business in Calcutta, but quickly gave up. The government there is so hostile to markets that they have a thousand rules. That's why India stays poor. Places with fewer rules, like Hong Kong, prosper.","torrent":{"xt":"urn:btih:f2c5baaf58b9b987f17e891e00e1e4b27ea4f52f","amp;dn":"Stossel.2013.12.12.%5BDefending+the+Market%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2c5baaf58b9b987f17e891e00e1e4b27ea4f52f","infoHashBuffer":{"type":"Buffer","data":[242,197,186,175,88,185,185,135,241,126,137,30,0,225,228,178,126,164,245,47]},"announce":[],"urlList":[]}}