{"title":"Neurologic Outcomes of Surgery &amp; Anesthesia [PDF] [StormRG]","uid":10259744,"size":2467141,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f3399a0985f284f342959847d973beb74daa3758&amp;dn=Neurologic+Outcomes+of+Surgery+%26amp%3B+Anesthesia+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"0xmovva","files":-1,"time":1401411158,"description":"Author: George A. Mashour, Michael S. Avidan\nHardcover: 160 pages\nPublisher: Oxford University Press; 1 edition (August 23, 2013)\nLanguage: English\nISBN-10: 0199895724\nISBN-13: 978-0199895724\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\nMost of the developments in perioperative medicine the 20th century were focused on the establishment of standard monitors, biomarkers, and outcomes measures for the cardiovascular and respiratory systems, with marked improvements in perioperative safety. The fields of anesthesiology and perioperative medicine have now shifted to the consideration of the nervous system. Complications such as delirium, cognitive decline, anesthetic neurotoxicity, stroke and other devastating nervous system events are only now developing significant scientific and clinical attention. Yet, there has been no single reference to serve as a guide for the clinician or the investigator interested in this subject. Neurologic Outcomes of Surgery and Anesthesia fills this gap in perioperative medicine literature by providing a concise yet thorough overview of adverse outcomes involving the brain, spine, and peripheral nerves. Rather than being organized by type of operation, each chapter in this invaluable resource is devoted to a specific adverse outcome. Every outcome is reviewed in an easy-to-follow format which includes an introduction to the clinical problem, a section on incidence, prevalence, and outcomes, an assessment of risk factors, discussions of preventive strategies, treatment, and current recommendations, a conclusion, and references.","torrent":{"xt":"urn:btih:f3399a0985f284f342959847d973beb74daa3758","amp;dn":"Neurologic+Outcomes+of+Surgery+%26amp%3B+Anesthesia+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3399a0985f284f342959847d973beb74daa3758","infoHashBuffer":{"type":"Buffer","data":[243,57,154,9,133,242,132,243,66,149,152,71,217,115,190,183,77,170,55,88]},"announce":[],"urlList":[]}}