{"title":"Kal Cahoone - Saints and Stars [2010][EAC.Log,Cue.FLAC]","uid":9327324,"size":181053722,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f3d4f9445cc3d54ca048872b02ca8b7441d49499&amp;dn=Kal+Cahoone+-+Saints+and+Stars+%5B2010%5D%5BEAC.Log%2CCue.FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dickspic","files":11,"time":1386665682,"description":"\nArtist: Kal Cahoone\nRelease: Saints and Stars \nReleased: 2010\nLabel: kal cahoone records\nCatalog#:50293944\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: folk\n\n\n\n\n1 -\tEvita\n2 -\tBeside the Shalimar\n3 -\tFellow Sparrow\n4 -\tHave You Seen Your Star Tonight\n5 -\tSebastian\n6 -\tTravel Song\n7 -\tAnother Lovely Day\n8 -\tBuild the Fire\n9 -\tIt Takes A Carpenter\n\n\n\n\nkal cahoone was raised in colorado and studied piano as a young child. Her mother had a passion for folk music (bruce cochburn, judy collins, gordon lightfoot, leonard cohen, the fairport convention, tim buckley) and Kal never imagined that one day she would also be a fan.\n\nA friend and admirer of members and wives of local bands like the denver gentlemen and 16 horsepower (now woven hand) in her early 20's she was inspired to create but wanted out of denver and the states.\n\nAfter receiving a degree in Spanish she ended up in valparaiso chile, living on a hill (cerro alegre) in total solitude with nothing but a typewriter and a Beautiful view. Here she began writing songs, at age 26.\n\nSix months later she took a bus across the Andes, arriving in Buenos Aires. Within a few days she met composer Christian Basso and they began recording together and eventually married. Thier song &quot;The Movement&quot; can be heard in the film &quot;Dot the I&quot; starring Gael Garcia Bernal. She also took up accordion, which was easier to travel with than a piano.\n\nSome years later she returned to Denver and immediately formed band Tarantella with John Rumley (Slim Cessna's Auto Club and Hush) where they also shared a meaningful co-writing situation. Since 2000, kal has recorded with Lilium, and has appeared doing back-up vocals for locals Munly and Roger Green. Kal has been onstage to play keyboards for Woven Hand and has appeared with The Denver Gentlemen.The music on &quot;Saints and Stars&quot; is a hauntingly laconic amalgamation of roots americana/country/folk sounds. These pieces are beautifully understated (with the exception of the upbeat and catchy &quot;Sebastian&quot;wink.gif and never once in my many listens did I find myself musing at length about &quot;production&quot;, for this I tip my hat to producer Jason McDaniel. Well done.\n\nThis melange of style is infused with a wistful quality that is easy to mistake for melancholy. These are lovely, lush songs filled with introspection and restraint but they're never depressing or self-indulgent. Perhaps it's because there's a strong current of hooks in these songs, an appeal that should be found in good pop music. Or perhaps it's that Kal Cahoone knows when to expand her palette.\nThere's a bit of world-music and south-of-the-border horns to be found on &quot;Beside the Shilmar&quot; and hints of pop-psychedelia on &quot;Another Lovely Day&quot;. Kal knows when to shift up to a slightly higher gear and when to hold back (without holding out).\n\nIn the end though, it is Kal Cahoone's voice that keeps me coming back. I have no-one to compare her to. Her style, phrasing and timbre are all her own. There's an *appeal* here I can't escape. To call her vocals sensual is to miss the mark, but they are seductive in the truest sense of the word. When she sings I'm pulled in, there is a gravity (though not a gravitas) in Kal Cahoone that I find emotionally compelling, irresistible..","torrent":{"xt":"urn:btih:f3d4f9445cc3d54ca048872b02ca8b7441d49499","amp;dn":"Kal+Cahoone+-+Saints+and+Stars+%5B2010%5D%5BEAC.Log%2CCue.FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3d4f9445cc3d54ca048872b02ca8b7441d49499","infoHashBuffer":{"type":"Buffer","data":[243,212,249,68,92,195,213,76,160,72,135,43,2,202,139,116,65,212,148,153]},"announce":[],"urlList":[]}}