{"title":"Our Beautiful, Fragile World - The Nature and Environmental Phot","uid":9336181,"size":65400442,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f5a963c7b881e114541b38f145b6ce6e7543ae09&amp;dn=Our+Beautiful%2C+Fragile+World+-+The+Nature+and+Environmental+Phot&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"STBGD","files":-1,"time":1386856170,"description":"Peter Essick by Peter Essick, &quot;Our Beautiful, Fragile World: The Nature and Environmental Photographs&quot; \nEnglish | ISBN: 1937538346 | 2014 | 124 pages | PDF, EPUB | 62 + 19 MB\n\nOur Beautiful, Fragile World features a career-spanning look at the images of photojournalist Peter Essick taken while on assignment for National Geographic magazine. In this book, Essick showcases a diverse series of photographs from some of the most beautiful natural areas in the world and documents major contemporary environmental issues, such as climate change and nuclear waste.\n\nEach photograph is accompanied by commentary on the design process of the image, Essick's personal photographic experiences, and informative highlights from the research he completed for each story. Our Beautiful, Fragile World takes the reader on a journey around the globe, from the Oulanka National Park near the Arctic Circle in Finland to the Adelie penguin breeding grounds in Antarctica.\n\nOur Beautiful, Fragile World will interest photographers of all skill levels. It carries an important message about conservation, and the photographs provide a compelling look at our environment that will resonate with people of all ages who care about the state of the natural world.\n\nForeword by Jean-Michel Cousteau.","torrent":{"xt":"urn:btih:f5a963c7b881e114541b38f145b6ce6e7543ae09","amp;dn":"Our+Beautiful%2C+Fragile+World+-+The+Nature+and+Environmental+Phot","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5a963c7b881e114541b38f145b6ce6e7543ae09","infoHashBuffer":{"type":"Buffer","data":[245,169,99,199,184,129,225,20,84,27,56,241,69,182,206,110,117,67,174,9]},"announce":[],"urlList":[]}}