{"title":"Angel's Gate - P. G. Sturges.epub","uid":9360825,"size":1667295,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f6b56577583971d95e5e2073dfb028c32e14714e&amp;dn=Angel%27s+Gate+-+P.+G.+Sturges.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mohammad_AT","files":1,"time":1387314244,"description":"Our hero Dick Henry--aka the Shortcut Man--becomes involved in a case featuring an aging but still amorous Los Angeles movie mogul named Howard Hogue who keeps a stable of young starlets available for his highly ritualized attentions. Retained by the sister of a young woman who has gone missing, Henry becomes friendly with Connie Cielo, the &quot;housemother&quot; to the starlets. Despite Connie's morally questionable responsibilities, she is willing to help (and enjoy the company of) the Shortcut Man. After Hogue's star director assaults one of these women in a drug-fueled romp, Henry is drawn into a deeper mystery from years past involving a mysterious death on a boat and a missing screenplay written by what appears to be a homeless man. As he peels back layer upon layer of sordid Hollywood history, Dick Henry must contend with crazed drug dealers, Hogue's personal doctor, crooked cops, private security henchmen, and Hogue himself--who is so powerful and bunkered in his movie-biz millions that he is unfazed by the resourceful Henry.","torrent":{"xt":"urn:btih:f6b56577583971d95e5e2073dfb028c32e14714e","amp;dn":"Angel%27s+Gate+-+P.+G.+Sturges.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6b56577583971d95e5e2073dfb028c32e14714e","infoHashBuffer":{"type":"Buffer","data":[246,181,101,119,88,57,113,217,94,94,32,115,223,176,40,195,46,20,113,78]},"announce":[],"urlList":[]}}