{"title":"SALT 2010 (GR SUBS)","uid":9331807,"size":1572793528,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f765644d52aae31c051fb297a540048b2aa4efe0&amp;dn=SALT+2010+%28GR+SUBS%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dgk1961","files":2,"time":1386781463,"description":"Salt (2010)\n100 min - Action | Crime | Mystery - 23 July 2010 (USA)\n\nDirector: Phillip Noyce\nWriter: Kurt Wimmer\nStars: Angelina Jolie, Liev Schreiber, Chiwetel Ejiofor\n\nSalt is a 2010 American action thriller spy film directed by Phillip Noyce, written by Kurt Wimmer, and starring Angelina Jolie, Liev Schreiber, Daniel Olbrychski, August Diehl and Chiwetel Ejiofor. Jolie plays Evelyn Salt who is accused of being a Russian sleeper agent and goes on the run to try to clear her name.\n\nOriginally written with a male protagonist, with Tom Cruise initially secured for the lead, the script was ultimately rewritten by Brian Helgeland for Jolie. Filming took place on location in Washington, D.C., the New York City area, and Albany, New York, between March and June 2009, with reshoots in January 2010. Action scenes were primarily performed with practical stunts, computer-generated imagery being used mostly for creating digital environments.\n\nThe film had a panel at the San Diego Comic-Con on July 22 and was released in North America on July 23, 2010, and in the United Kingdom on August 18, 2010. Salt grossed $294 million at the worldwide box office and received mixed-to-positive reviews, with praise for the action scenes and Jolie's performance, but drawing criticism on the writing, with reviewers finding the plot implausible and convoluted. The DVD and Blu-ray Disc were released December 21, 2010, and featured two alternate cuts providing different endings for the movie.","torrent":{"xt":"urn:btih:f765644d52aae31c051fb297a540048b2aa4efe0","amp;dn":"SALT+2010+%28GR+SUBS%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f765644d52aae31c051fb297a540048b2aa4efe0","infoHashBuffer":{"type":"Buffer","data":[247,101,100,77,82,170,227,28,5,31,178,151,165,64,4,139,42,164,239,224]},"announce":[],"urlList":[]}}