{"title":"Trey Smith","uid":9291001,"size":4861586602,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f95ff3a08facfa745a5fc0a9d96d303e383847fe&amp;dn=Trey+Smith&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"POtHS11","files":-1,"time":1386090786,"description":"\n\nTrey Smith, founder of the God in a Nutshell project. The God in a Nutshell project is a continual journey of past, present &amp; prophetic --- served as easy &amp; concise as possible at your fingertips. New videos all the time... Feel free to SUBSCRIBE on Youtube and share with a friend.\n\nThe God in a Nutshell project also is a Biblical, spiritual &amp; intellectual think tank of research, news and information source. At our website godinanutshell(dot)com we are always looking for great writers, bloggers &amp; journalists who like to talk about current world news, prophecy, physics, genetics, emerging sciences, astronomy, archaeology, and interesting ancient and/or Biblical research of their own.... NEW WRITERS, READERS &amp; the CURIOUS always welcomed... Come take a peek.\n\nYes... It is also TRUE that Trey Smith did commit a safe robbery on the TV pastor Mike Murdock in 1999. The book is titled -- Thieves: One dirty TV pastor and the man who robbed him.\n\nVideos by Trey Smith\n\nThieves - SAFE ROBBERY of TV PASTOR- Mike Murdock (Benny Hinn fundraiser)\nTheory of Everything - GOD- Devils - Dimensions - Dragons - Illusion -  Reality - The Theory of Everything\nTBN - TBN SCANDAL - TBN EXPOSED - Trinity Broadcasting Network\nMayan Calendar - Mayans _ Serpents\nHidden Treasures In the Bible - Chuck Missler\nGod in a Nutshell - The Choice\nGod in a Nutshell - Illusion of Reality Holographic Universe by Trey Smith\nGod in a Nutshell - Brief glimpse in Heaven &amp; Hell - (part II of III)\nGod in a Nutshell - Are we Real - Reality - Illusions - Digital Universe - Part I of III\nEvolution - Modern Myth - 100 WAYS to KILL DARWIN'S EVOLUTION)\nEnd of World 2012 - Why it's BOGUS. End of the World facts\nDark Faith - Creflo Dollar - Mike Murdock - Benny Hinn - Friends\nBook of Enoch - REAL STORY of Fallen Angels - Devils - Man - NEPHILIM - ANCIENT ALIENS - NOAHS FLOOD\nBenny Hinn - Screams I Will PUNCH Joel Osteen in the face!\nBenny Hinn - Occult Secrets Scams FULL Benny Hinn - DOCUMENTARY\nALIENS - UFOs - DEMONS  TRUTH on ALIENS  UFOs  DEMONS 30 minutes of Aliens Nephilim\n58$ - Dirty Pastors - Benny Hinn - Mike Murdock\n\n\n","torrent":{"xt":"urn:btih:f95ff3a08facfa745a5fc0a9d96d303e383847fe","amp;dn":"Trey+Smith","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f95ff3a08facfa745a5fc0a9d96d303e383847fe","infoHashBuffer":{"type":"Buffer","data":[249,95,243,160,143,172,250,116,90,95,192,169,217,109,48,62,56,56,71,254]},"announce":[],"urlList":[]}}