{"title":"Diana Ross &amp; The Supremes - Merry Christmas 320cbr","uid":9363601,"size":84749398,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f9cfc2ec2008e7b7ec68d21ebe2362c5c0cfbdf0&amp;dn=Diana+Ross+%26amp%3B+The+Supremes+-+Merry+Christmas+320cbr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Big-Papi","files":-1,"time":1387376803,"description":"Source: 1986 CD with Diana Ross and Stevie Wonder Albums on the one CD. The disc was broken up into 2 compilations and posted separately.\n\nDiana Ross &amp; The Supremes - Merry Christmas 320cbr (Big Papi) 1986 Motown\n\nBy Gary M. Smith\nContrary to what two previous reviewers reported, Mary Wilson and Florence Ballard do sing on all songs on their Christmas album, except &quot;The Christmas Song&quot; and &quot;Noel&quot;. Any &quot;true Supremes fan&quot; definitely will recognize their voices and not attribute the singing to &quot;substitutes&quot;. In reading the booklet notes, it quotes Mary as saying how ecstatic they all were about recording the album. It also explains how the background music tracks were recorded in L.A. in August, 1965 and the vocals were mixed &quot;a month later&quot;. Nowhere in Mary Wilson's book &quot;Dreamgirl&quot; does she state that she took a vacation and did not sing on &quot;Merry Christmas The Supremes&quot;. This being said, the album remains a classic, with the impeccable harmonies of Florence and Mary very evident. My favorites are &quot;White Christmas&quot;, &quot;Silver Bells&quot;, &quot;My Christmas Tree&quot; &quot;Rudolph, The Red-Nosed Reindeer&quot; and &quot;Twinkle, Twinkle Little Me&quot; because of the excellent background vocals enhancing Diana Ross' leads. It is refreshing to hear Florence Ballard's excellent rendition of &quot;Silent Night&quot; in it's complete version. I've had the LP version of the original 12 songs since it came out in 1965 and I can only say that the newest CD version is a welcome update. However, on the original monaural version, the sound has a different quality to it, more like a slight echo, which I found more preferable. All in all, it remains a Christmas album everyone should have, Supremes fans and non-fans alike. Mine will get lots of play this Christmas season.","torrent":{"xt":"urn:btih:f9cfc2ec2008e7b7ec68d21ebe2362c5c0cfbdf0","amp;dn":"Diana+Ross+%26amp%3B+The+Supremes+-+Merry+Christmas+320cbr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9cfc2ec2008e7b7ec68d21ebe2362c5c0cfbdf0","infoHashBuffer":{"type":"Buffer","data":[249,207,194,236,32,8,231,183,236,104,210,30,190,35,98,197,192,207,189,240]},"announce":[],"urlList":[]}}