{"title":"Nathan Bedford Forrest, A Biography (2nd try)","uid":9392634,"size":2587573,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fa1158bf08ba8ca8aa24d5043769d7071909de43&amp;dn=Nathan+Bedford+Forrest%2C+A+Biography+%282nd+try%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"stew_dent","files":2,"time":1387913664,"description":"Let's try this again...\n\nAmid the aristocratic ranks of the Confederate cavalry, Nathan Bedford Forrest was untutored, all but unlettered, and regarded as no more than a guerrilla. HAmid the aristocratic ranks of the Confederate cavalry, Nathan Bedford Forrest was untutored, all but unlettered, and regarded as no more than a guerrilla. His tactic was the headlong charge, mounted with such swiftness and ferocity that General Sherman called him a &quot;devil&quot; who should &quot;be hunted down and killed if it costs 10,000 lives and bankrupts the treasury.&quot; And in a war in which officers prided themselves on their decorum, Forrest habitually issued surrender-or-die ultimatums to the enemy and often intimidated his own superiors. After being in command at the notorious Fort Pillow Massacre, he went on to haunt the South as the first grand wizard of the Ku Klux Klan.\n\nNow this epic figure is restored to human dimensions in an exemplary biography that puts both Forrest's genius and his savagery into the context of his time, chronicling his rise from frontiersman to slave trader, private to lieutenant general, Klansman to -- eventually -- New South businessman and racial moderate. Unflinching in its analysis and with extensive new research, Nathan Bedford Forrest is an invaluable and immensely readable addition to the literature of the Civil War.\n\nFrom the Trade Paperback edition.is tactic was the headlong charge, mounted with such swiftness and ferocity that General Sherman called him a &quot;devil&quot; who should &quot;be hunted down and killed if it costs 10,000 lives and bankrupts the treasury.&quot; And in a war in which officers prided themselves on their decorum, Forrest habitually issued surrender-or-die ultimatums to the enemy and often intimidated his own superiors. After being in command at the notorious Fort Pillow Massacre, he went on to haunt the South as the first grand wizard of the Ku Klux Klan.\n\nNow this epic figure is restored to human dimensions in an exemplary biography that puts both Forrest's genius and his savagery into the context of his time, chronicling his rise from frontiersman to slave trader, private to lieutenant general, Klansman to -- eventually -- New South businessman and racial moderate. Unflinching in its analysis and with extensive new research, Nathan Bedford Forrest is an invaluable and immensely readable addition to the literature of the Civil War.\n\nFrom the Trade Paperback edition.","torrent":{"xt":"urn:btih:fa1158bf08ba8ca8aa24d5043769d7071909de43","amp;dn":"Nathan+Bedford+Forrest%2C+A+Biography+%282nd+try%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa1158bf08ba8ca8aa24d5043769d7071909de43","infoHashBuffer":{"type":"Buffer","data":[250,17,88,191,8,186,140,168,170,36,213,4,55,105,215,7,25,9,222,67]},"announce":[],"urlList":[]}}