{"title":"Stossel.2013.12.05.[I Play One on TV].Fox Business.CF.avi","uid":9316560,"size":344990910,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fb120653be0c7903d44c9fb6ae84c48f32e49e51&amp;dn=Stossel.2013.12.05.%5BI+Play+One+on+TV%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1386481305,"description":"----------\n\nSTOSSEL - [I Play One on TV: Hollywood Hypocrites] - Fox Business Network\n2013, December 5, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nHOLLYWOOD HYPOCRITES: Kevin Sorbo, former star of the TV series Hercules, pushes back against celebrities who say they &quot;know how to fix the world.&quot; Jason Mattera, author of Hollywood Hypocrites, confronts celebrities like &quot;environmental activist&quot; Harrison Ford (he owns seven airplanes) and Robert Redford (after his Bill Ayers movie). He chases them down with his camera and &quot;ambushes&quot; them because, he says, the liberal media won't confront them.\n\nCELEBRITY ECOCRITES (my word for Eco-hypocrites): James Hirsen, author of Hollywood Nation, says environmentalism is like a religion to celebrities, and their leader, Al Gore, is one of the biggest hypocrites of all.\n\nANTI-CAPITALISTS: Special Correspondent Kennedy points out how celebrities contradict themselves by constantly attacking capitalism, even though the film industry benefits from it.\n\nANTI-GUN ACTORS: Former screenwriter, Michael Medved, says that although many actors call for gun control, they sure don't control guns in their own movies.\n\nREAL OR FAKE?: Sometimes celebrities do things that are so bizarre, that if you didn't see or hear it, you wouldn't believe it was real. I quiz new Fox Business hosts Kennedy, Matt Welch and Kmele Foster. You can play along. Which of these is real?\n\n- Actor Adrian Grenier has a website promoting an environmentally friendly compostable tennis shoe.\n\n- Since President Obama's limousine only gets 8 miles per gallon, Ed Begley, Jr. started a petition to get the President to trade in his limo for an electric powered version.\n\nI'll add the correct answers Monday.\n\nGOOD NEWS: A few celebrities who have revealed themselves to be libertarians or libertarian/conservatives: Vince Vaughn, Drew Carey, Penn Jillette, and a few others. They give me hope.","torrent":{"xt":"urn:btih:fb120653be0c7903d44c9fb6ae84c48f32e49e51","amp;dn":"Stossel.2013.12.05.%5BI+Play+One+on+TV%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb120653be0c7903d44c9fb6ae84c48f32e49e51","infoHashBuffer":{"type":"Buffer","data":[251,18,6,83,190,12,121,3,212,76,159,182,174,132,196,143,50,228,158,81]},"announce":[],"urlList":[]}}