{"title":"Figure Photography-Techniques for Digital Photographers [PDF]","uid":9316430,"size":30346890,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fc284465f888342f6bbf80df15b25dab7c1c3c39&amp;dn=Figure+Photography-Techniques+for+Digital+Photographers+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"F1restorm","files":-1,"time":1386478324,"description":"Figure Photography: Techniques for Digital Photographers\nAuthor: Billy Pegram\nPublished: May 2013\nPublisher: Amherst Media\nISBN: 9781608955787\nFormat: Retail PDF\nReader Required: Adobe Reader, Adobe Digital Editions\n\nPLEASE NOTE: THIS BOOK CONTAINS NUDITY AND MAY BE OFFENSIVE TO SOME\n\nA good all-round guide for digital photographer's interested in nude photography. The author discusses techniques, lighting, make-up, posing and post-production. There are plenty of high quality images through the book as well.\n\nTested on the above readers with no problems. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! :D\n__________________________________________________________________________________\n\n\nWalking photographers through the process of capturing the many possibilities of the human form, this guide presents the techniques for shooting figure images that make a statement, grab attention, and create an emotional impact. Professional model photographer Billy Pegram begins by explaining core concepts such as lighting, location, exposure, and styling that are integral to any type of figure image. He then explores a wide variety of specialized genres of figure photography, including commercial, fashion, boudoir, erotic, fine art, glamour, and pin-up, demonstrating the unique hallmarks and techniques that are essential to these styles. The book provides behind-the-scenes looks at a variety of assignments, covered from concept to execution, showing how each image was imagined, the decisions that went into the styling of the set and model, how the pose was developed and refined, the lighting setup used to capture the desired mood, and any postproduction techniques used to enhance the final results.","torrent":{"xt":"urn:btih:fc284465f888342f6bbf80df15b25dab7c1c3c39","amp;dn":"Figure+Photography-Techniques+for+Digital+Photographers+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc284465f888342f6bbf80df15b25dab7c1c3c39","infoHashBuffer":{"type":"Buffer","data":[252,40,68,101,248,136,52,47,107,191,128,223,21,178,93,171,124,28,60,57]},"announce":[],"urlList":[]}}