{"title":"Visual Thinking - Methods for making images memorable (Art Ebook","uid":10246746,"size":32557664,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fd436090a4f436a62ccde9949c1ceb8cdfb3fe7e&amp;dn=Visual+Thinking+-+Methods+for+making+images+memorable+%28Art+Ebook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"STBGD","files":-1,"time":1401303952,"description":"pdf / 31 MB / English / Henry Wolf / 1988 / 192 pages\n\nAn overview of Henry Wolf's career, this book should prove of interest to photographers, designers, art directors and anyone who enjoys photographic images.\n\n\n\nShowcases brilliant graphic design -- A strong stimulant for the imagination.\nBy Mike on January 25, 2013\n\nThe text in this book is relatively short, which has its advantages and limitations.\n\nOn the plus side, this leaves a lot of space for the many excellent examples (posters, covers, ads, photographs, etc.) of the author (mainly) and of some other artists. In this sense -- and this is its strongest point in my opinion -- this book is a great source of references and ideas. It showcases brilliant graphic design and is a strong stimulant for the imagination.\n\nOn the other hand, the shortness of the text means that the general principles described in each chapter remain, well, quite general (though always to the point). However, this is perhaps inevitable, not so much because of the lack of space, but rather because so many elements come into consideration when deciding if a work of graphic design is successful or not, so that trying to theorize it all is probably pointless. To his credit, the author does not attempt to do that and he lets the work speak for itself.\n\nWhat may have made the book even more interesting is detailed explanations (a) regarding the creative process behind each work, and (b) regarding how the images were technically achieved (including lighting patterns for the photographs). Of course, this would have doubled the size of the book, but would have equally increased the pleasure of reading it.","torrent":{"xt":"urn:btih:fd436090a4f436a62ccde9949c1ceb8cdfb3fe7e","amp;dn":"Visual+Thinking+-+Methods+for+making+images+memorable+%28Art+Ebook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd436090a4f436a62ccde9949c1ceb8cdfb3fe7e","infoHashBuffer":{"type":"Buffer","data":[253,67,96,144,164,244,54,166,44,205,233,148,156,28,235,140,223,179,254,126]},"announce":[],"urlList":[]}}