{"title":"St. Theophan the Recluse - The Path to Salvation (pdf)","uid":9299547,"size":5612113,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fe46e8ae14a1859e988ff5a520a0dd8b98e86f19&amp;dn=St.+Theophan+the+Recluse+-+The+Path+to+Salvation+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pharmakate","files":-1,"time":1386219840,"description":"St. Theophan the Recluse - The Path to Salvation: A Manual of Spiritual Transformation (St. Paisius Monastery, 1996). 366 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc. There was some warping in the pages of this book that shows through in this scan in the form of a few wavering lines of text here and there.\n\n\ndescription:\n\nPatristic literature provides an age-old, tried and tested model of spiritual life, foreign to fleeting fashions. Throughout the last two thousand years, Christ has raised up patristic writers who have defended that original model. In modern times, however, this model is being pushed aside, the taste for genuine mystical expression is disappearing, and the initial Christian impetus is being disfigured.\n\nThat is why the works of St. Theophan the Recluse are so vital for today. He keeps the ancient patristic model sharp and clear, presenting it in modern language. He speaks to contemporary people who have been exposed to new realities, and thus renders inestimable help in linking them to the original Christian impetus and revealing to them the way into the Heavenly Kingdom.\n\nThe works of St. Theophan changed the spiritual face of Russia in the 19th century. With the publication of his greatest work, THE PATH TO SALVATION, the English-speaking world now has the opportunity to benefit likewise from this powerful inheritance to the people of the modern age.\n\nSaint Theophan the Recluse is first and foremost a Church Father for modern times. Deeply aware of the roots of the modern age, he reinterprets ancient patristic wisdom in order to adapt it to the needs of the modern unchurched mind, which has been divorced from the Orthodox philosophy of life and even from the rudimentary principles of practical Christianity.\n\nThis classic textbook of spiritual life, now being offered in its entirety for the first time in English, seems to have been sent directly to today's readers by the great Russian recluse himself. Every line breathes his profound psychological understanding, his intricate experience in spiritual struggle, and above all his love, compassion and all-consuming desire that every person might be saved. Inspiring the reader with a sober longing for acquiring the Kingdom of Heaven, St. Theophan provides an infallible system for taking the Kingdom by force, in a Christian life of grace and repentance.\n\n---\n\nSee my other torrents for related books in the area of Eastern Orthodox mysticism and spiritual life, including the Philokalia and other books on the Jesus Prayer.","torrent":{"xt":"urn:btih:fe46e8ae14a1859e988ff5a520a0dd8b98e86f19","amp;dn":"St.+Theophan+the+Recluse+-+The+Path+to+Salvation+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe46e8ae14a1859e988ff5a520a0dd8b98e86f19","infoHashBuffer":{"type":"Buffer","data":[254,70,232,174,20,161,133,158,152,143,245,165,32,160,221,139,152,232,111,25]},"announce":[],"urlList":[]}}