{"title":"Echobelly - Lustra [1997]","uid":9368042,"size":351026807,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fe9d9f16295ace44a7c262d8f25253e4fdb3a114&amp;dn=Echobelly+-+Lustra+%5B1997%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GenXRock","files":-1,"time":1387468197,"description":"It's funny how a band can lose momentum in two years, especially in British pop. Either because of changes in the musical climate or changes in the band, a group that was at the top of charts one year can return 24 months later and find that everything has shifted 180 degrees. Such was the case with Echobelly and their third album, Lustra. There were a few upheavals in the band, and they decided to hire Gil Norton, a producer renowned for his work with the Pixies, to give them a change in sound. Norton does lend his signature clean-but-loud style to Lustra, giving it a bit more volume than Echobelly's first two records, but that ultimately doesn't amount to much of a change in sound. Similarly, no matter how they try to mature, Echobelly simply can't successfully develop their fusion of the Smiths and Blondie into something new. Unfortunately, they can't come up with many memorable hooks, either. There are a handful of solid songs on Lustra, but they lack the spark of &quot;Insomniac&quot; or &quot;Car Fiction&quot; -- they simply sound tired. What makes this really disappointing is that Echobelly sounded fresh and inspired on both Everybody's Got One and On, but with their attempt to sound mature, they've snuffed out their spark. Hopefully, Lustra is simply a misstep, not the end of the line. (2.5/5)","torrent":{"xt":"urn:btih:fe9d9f16295ace44a7c262d8f25253e4fdb3a114","amp;dn":"Echobelly+-+Lustra+%5B1997%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe9d9f16295ace44a7c262d8f25253e4fdb3a114","infoHashBuffer":{"type":"Buffer","data":[254,157,159,22,41,90,206,68,167,194,98,216,242,82,83,228,253,179,161,20]},"announce":[],"urlList":[]}}