{"title":"The Bourne Retribution - Eric Van Lustbader (epub and mobi)","uid":9372268,"size":1551559,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:febd1a6f42d8534164d447fba4f2bc26a622adc8&amp;dn=The+Bourne+Retribution+-+Eric+Van+Lustbader+%28epub+and+mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"7","files":-1,"time":1387553234,"description":"Jason Bourne is one of the most popular and compelling characters in modern fiction. Originally created by bestselling author Robert Ludlum, now New York Times bestselling writer Eric Van Lustbader carries on Ludlum's legacy with a new novel about the rogue secret agent who has lost his memory . . .\n\nJason Bourne has been pursued by powerful governments--and escaped.\nHunted by the most skilled assassins in the world--and outsmarted them.\nTargeted by terrorists--and defeated their plans for global chaos. But now, Bourne wants only one thing: retribution.\n\nTHE BOURNE RETRIBUTION\n\nBourne's friend Eli Yadin, head of Mossad, learns that Ouyang Jidan, a senior member of China's Politburo, and a major Mexican drug lord may have been trafficking in something far more deadly than drugs. Yadin needs Bourne to investigate. Bourne agrees, but only because he has a personal agenda: Ouyang Jidan is the man who ordered Rebeka--one of the only people Bourne has ever truly cared about--murdered. Bourne is determined to avenge her death, but in the process he becomes enmeshed in a monstrous world-wide scheme involving the Chinese, Mexicans, and Russians.\n\nBourne's increasingly desperate search for Ouyang takes him from Tel Aviv to Shanghai, Mexico City, and, ultimately, a village on China's coast where a clever trap has been laid for him. Bourne finds himself pursued on all sides and unsure whom he can trust. As he moves closer to Ouyang, closer to avenging the woman he loved, he also moves ever closer to his own death . . .","torrent":{"xt":"urn:btih:febd1a6f42d8534164d447fba4f2bc26a622adc8","amp;dn":"The+Bourne+Retribution+-+Eric+Van+Lustbader+%28epub+and+mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"febd1a6f42d8534164d447fba4f2bc26a622adc8","infoHashBuffer":{"type":"Buffer","data":[254,189,26,111,66,216,83,65,100,212,71,251,164,242,188,38,166,34,173,200]},"announce":[],"urlList":[]}}