{"title":"The Wonder Years - Discography (2006-2013) [FLAC]","uid":9302871,"size":1730495578,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ff4988575e2f50993e5acc406e7af810b2e8e91f&amp;dn=The+Wonder+Years+-+Discography+%282006-2013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"politux","files":-1,"time":1386270592,"description":"\n  The Wonder Years - Discography (2006-2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Punk-Pop\n  Source: CD, WEB\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  2006 Bangarang / The Wonder Years Split EP\n  2007 Get Stoked on It\n  2007 Tour EP\n  2009 I Refuse to Sink a Collection of Prior Recordings\n  2010 Upsides\n  2011 Suburbia \n  2013 The Greatest Generation\n\n  Taking its name from the TV show The Wonder Years, the Philadelphia punk pop band was formed by guitarists Matt Brasch and Casey Cavaliere, vocalist Dan &quot;Soupy&quot; Campbell, bassist Josh Martin, drummer Mike Kennedy, and keyboardist Mikey Kelly. The sextet got its start in 2005 when previous combo the Premier split up. Regrouping under the new name, the band began playing shows and released two split singles that year (with Bangarang! and Emergency and I). In late 2007, the Wonder Years self-released an album, the emphatically titled Get Stoked on It!, and quickly caught the eye of California label No Sleep, which signed the band. \n\n  Their first record for the label was the EP Won't Be Pathetic Forever, which came out in June of 2008. Following a split single with All or Nothing, Kelly left the band. After a year spent recording its second album, the group released The Upsides in January of 2010. The record made a dent in the lower regions of the Billboard charts, and also gained the Wonder Years a deal with the larger indie Hopeless, which reissued the album in September with four bonus tracks. In the time between releases, drummer Kennedy quit the band and was replaced by Nick Steinborn. Kennedy soon returned to the fold and Steinborn bounced over to play keys and guitar. With the lineup solidified, the Wonder Years got to work on their next album with producer Steve Evetts. In 2011, they released their third album, Suburbia I've Given You All and Now I'm Nothing, followed by the arrival of a B-sides compilation, Sleeping on Trash, as well as their fourth full-length album, The Greatest Generation, in 2013.","torrent":{"xt":"urn:btih:ff4988575e2f50993e5acc406e7af810b2e8e91f","amp;dn":"The+Wonder+Years+-+Discography+%282006-2013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff4988575e2f50993e5acc406e7af810b2e8e91f","infoHashBuffer":{"type":"Buffer","data":[255,73,136,87,94,47,80,153,62,90,204,64,110,122,248,16,178,232,233,31]},"announce":[],"urlList":[]}}